#map = affine_map<(d0, d1, d2, d3) -> (d0, d1, d3)>
#map1 = affine_map<(d0, d1, d2, d3) -> (d0, d1, d2, d3)>
module @module {
  util.global private @__auto.token_embd.weight = #stream.parameter.named<"model"::"token_embd.weight"> : tensor<256x256xf32>
  util.global private @__auto.blk.0.attn_norm.weight = #stream.parameter.named<"model"::"blk.0.attn_norm.weight"> : tensor<256xf32>
  util.global private @__auto.blk.0.attn_q.weight = #stream.parameter.named<"model"::"blk.0.attn_q.weight"> : tensor<256x256xf32>
  util.global private @__auto.blk.0.attn_k.weight = #stream.parameter.named<"model"::"blk.0.attn_k.weight"> : tensor<128x256xf32>
  util.global private @__auto.blk.0.attn_v.weight = #stream.parameter.named<"model"::"blk.0.attn_v.weight"> : tensor<128x256xf32>
  util.global private @__auto.blk.0.attn_output.weight = #stream.parameter.named<"model"::"blk.0.attn_output.weight"> : tensor<256x256xf32>
  util.global private @__auto.blk.0.ffn_norm.weight = #stream.parameter.named<"model"::"blk.0.ffn_norm.weight"> : tensor<256xf32>
  util.global private @__auto.blk.0.ffn_gate.weight = #stream.parameter.named<"model"::"blk.0.ffn_gate.weight"> : tensor<23x256xf32>
  util.global private @__auto.blk.0.ffn_up.weight = #stream.parameter.named<"model"::"blk.0.ffn_up.weight"> : tensor<23x256xf32>
  util.global private @__auto.blk.0.ffn_down.weight = #stream.parameter.named<"model"::"blk.0.ffn_down.weight"> : tensor<256x23xf32>
  util.global private @__auto.blk.1.attn_norm.weight = #stream.parameter.named<"model"::"blk.1.attn_norm.weight"> : tensor<256xf32>
  util.global private @__auto.blk.1.attn_q.weight = #stream.parameter.named<"model"::"blk.1.attn_q.weight"> : tensor<256x256xf32>
  util.global private @__auto.blk.1.attn_k.weight = #stream.parameter.named<"model"::"blk.1.attn_k.weight"> : tensor<128x256xf32>
  util.global private @__auto.blk.1.attn_v.weight = #stream.parameter.named<"model"::"blk.1.attn_v.weight"> : tensor<128x256xf32>
  util.global private @__auto.blk.1.attn_output.weight = #stream.parameter.named<"model"::"blk.1.attn_output.weight"> : tensor<256x256xf32>
  util.global private @__auto.blk.1.ffn_norm.weight = #stream.parameter.named<"model"::"blk.1.ffn_norm.weight"> : tensor<256xf32>
  util.global private @__auto.blk.1.ffn_gate.weight = #stream.parameter.named<"model"::"blk.1.ffn_gate.weight"> : tensor<23x256xf32>
  util.global private @__auto.blk.1.ffn_up.weight = #stream.parameter.named<"model"::"blk.1.ffn_up.weight"> : tensor<23x256xf32>
  util.global private @__auto.blk.1.ffn_down.weight = #stream.parameter.named<"model"::"blk.1.ffn_down.weight"> : tensor<256x23xf32>
  util.global private @__auto.blk.2.attn_norm.weight = #stream.parameter.named<"model"::"blk.2.attn_norm.weight"> : tensor<256xf32>
  util.global private @__auto.blk.2.attn_q.weight = #stream.parameter.named<"model"::"blk.2.attn_q.weight"> : tensor<256x256xf32>
  util.global private @__auto.blk.2.attn_k.weight = #stream.parameter.named<"model"::"blk.2.attn_k.weight"> : tensor<128x256xf32>
  util.global private @__auto.blk.2.attn_v.weight = #stream.parameter.named<"model"::"blk.2.attn_v.weight"> : tensor<128x256xf32>
  util.global private @__auto.blk.2.attn_output.weight = #stream.parameter.named<"model"::"blk.2.attn_output.weight"> : tensor<256x256xf32>
  util.global private @__auto.blk.2.ffn_norm.weight = #stream.parameter.named<"model"::"blk.2.ffn_norm.weight"> : tensor<256xf32>
  util.global private @__auto.blk.2.ffn_gate.weight = #stream.parameter.named<"model"::"blk.2.ffn_gate.weight"> : tensor<23x256xf32>
  util.global private @__auto.blk.2.ffn_up.weight = #stream.parameter.named<"model"::"blk.2.ffn_up.weight"> : tensor<23x256xf32>
  util.global private @__auto.blk.2.ffn_down.weight = #stream.parameter.named<"model"::"blk.2.ffn_down.weight"> : tensor<256x23xf32>
  util.global private @__auto.output_norm.weight = #stream.parameter.named<"model"::"output_norm.weight"> : tensor<1x256xf32>
  util.global private @__auto.output.weight = #stream.parameter.named<"model"::"output.weight"> : tensor<256x256xf32>
  func.func @prefill_bs4(%arg0: !torch.vtensor<[4,?],si64>, %arg1: !torch.vtensor<[4],si64>, %arg2: !torch.vtensor<[4,?],si64>, %arg3: !torch.tensor<[?,24576],f16>) -> !torch.vtensor<[4,?,256],f16> attributes {torch.assume_strict_symbolic_shapes} {
    %__auto.token_embd.weight = util.global.load @__auto.token_embd.weight : tensor<256x256xf32>
    %0 = torch_c.from_builtin_tensor %__auto.token_embd.weight : tensor<256x256xf32> -> !torch.vtensor<[256,256],f32>
    %__auto.blk.0.attn_norm.weight = util.global.load @__auto.blk.0.attn_norm.weight : tensor<256xf32>
    %1 = torch_c.from_builtin_tensor %__auto.blk.0.attn_norm.weight : tensor<256xf32> -> !torch.vtensor<[256],f32>
    %__auto.blk.0.attn_q.weight = util.global.load @__auto.blk.0.attn_q.weight : tensor<256x256xf32>
    %2 = torch_c.from_builtin_tensor %__auto.blk.0.attn_q.weight : tensor<256x256xf32> -> !torch.vtensor<[256,256],f32>
    %__auto.blk.0.attn_k.weight = util.global.load @__auto.blk.0.attn_k.weight : tensor<128x256xf32>
    %3 = torch_c.from_builtin_tensor %__auto.blk.0.attn_k.weight : tensor<128x256xf32> -> !torch.vtensor<[128,256],f32>
    %__auto.blk.0.attn_v.weight = util.global.load @__auto.blk.0.attn_v.weight : tensor<128x256xf32>
    %4 = torch_c.from_builtin_tensor %__auto.blk.0.attn_v.weight : tensor<128x256xf32> -> !torch.vtensor<[128,256],f32>
    %__auto.blk.0.attn_output.weight = util.global.load @__auto.blk.0.attn_output.weight : tensor<256x256xf32>
    %5 = torch_c.from_builtin_tensor %__auto.blk.0.attn_output.weight : tensor<256x256xf32> -> !torch.vtensor<[256,256],f32>
    %__auto.blk.0.ffn_norm.weight = util.global.load @__auto.blk.0.ffn_norm.weight : tensor<256xf32>
    %6 = torch_c.from_builtin_tensor %__auto.blk.0.ffn_norm.weight : tensor<256xf32> -> !torch.vtensor<[256],f32>
    %__auto.blk.0.ffn_gate.weight = util.global.load @__auto.blk.0.ffn_gate.weight : tensor<23x256xf32>
    %7 = torch_c.from_builtin_tensor %__auto.blk.0.ffn_gate.weight : tensor<23x256xf32> -> !torch.vtensor<[23,256],f32>
    %__auto.blk.0.ffn_up.weight = util.global.load @__auto.blk.0.ffn_up.weight : tensor<23x256xf32>
    %8 = torch_c.from_builtin_tensor %__auto.blk.0.ffn_up.weight : tensor<23x256xf32> -> !torch.vtensor<[23,256],f32>
    %__auto.blk.0.ffn_down.weight = util.global.load @__auto.blk.0.ffn_down.weight : tensor<256x23xf32>
    %9 = torch_c.from_builtin_tensor %__auto.blk.0.ffn_down.weight : tensor<256x23xf32> -> !torch.vtensor<[256,23],f32>
    %__auto.blk.1.attn_norm.weight = util.global.load @__auto.blk.1.attn_norm.weight : tensor<256xf32>
    %10 = torch_c.from_builtin_tensor %__auto.blk.1.attn_norm.weight : tensor<256xf32> -> !torch.vtensor<[256],f32>
    %__auto.blk.1.attn_q.weight = util.global.load @__auto.blk.1.attn_q.weight : tensor<256x256xf32>
    %11 = torch_c.from_builtin_tensor %__auto.blk.1.attn_q.weight : tensor<256x256xf32> -> !torch.vtensor<[256,256],f32>
    %__auto.blk.1.attn_k.weight = util.global.load @__auto.blk.1.attn_k.weight : tensor<128x256xf32>
    %12 = torch_c.from_builtin_tensor %__auto.blk.1.attn_k.weight : tensor<128x256xf32> -> !torch.vtensor<[128,256],f32>
    %__auto.blk.1.attn_v.weight = util.global.load @__auto.blk.1.attn_v.weight : tensor<128x256xf32>
    %13 = torch_c.from_builtin_tensor %__auto.blk.1.attn_v.weight : tensor<128x256xf32> -> !torch.vtensor<[128,256],f32>
    %__auto.blk.1.attn_output.weight = util.global.load @__auto.blk.1.attn_output.weight : tensor<256x256xf32>
    %14 = torch_c.from_builtin_tensor %__auto.blk.1.attn_output.weight : tensor<256x256xf32> -> !torch.vtensor<[256,256],f32>
    %__auto.blk.1.ffn_norm.weight = util.global.load @__auto.blk.1.ffn_norm.weight : tensor<256xf32>
    %15 = torch_c.from_builtin_tensor %__auto.blk.1.ffn_norm.weight : tensor<256xf32> -> !torch.vtensor<[256],f32>
    %__auto.blk.1.ffn_gate.weight = util.global.load @__auto.blk.1.ffn_gate.weight : tensor<23x256xf32>
    %16 = torch_c.from_builtin_tensor %__auto.blk.1.ffn_gate.weight : tensor<23x256xf32> -> !torch.vtensor<[23,256],f32>
    %__auto.blk.1.ffn_up.weight = util.global.load @__auto.blk.1.ffn_up.weight : tensor<23x256xf32>
    %17 = torch_c.from_builtin_tensor %__auto.blk.1.ffn_up.weight : tensor<23x256xf32> -> !torch.vtensor<[23,256],f32>
    %__auto.blk.1.ffn_down.weight = util.global.load @__auto.blk.1.ffn_down.weight : tensor<256x23xf32>
    %18 = torch_c.from_builtin_tensor %__auto.blk.1.ffn_down.weight : tensor<256x23xf32> -> !torch.vtensor<[256,23],f32>
    %__auto.blk.2.attn_norm.weight = util.global.load @__auto.blk.2.attn_norm.weight : tensor<256xf32>
    %19 = torch_c.from_builtin_tensor %__auto.blk.2.attn_norm.weight : tensor<256xf32> -> !torch.vtensor<[256],f32>
    %__auto.blk.2.attn_q.weight = util.global.load @__auto.blk.2.attn_q.weight : tensor<256x256xf32>
    %20 = torch_c.from_builtin_tensor %__auto.blk.2.attn_q.weight : tensor<256x256xf32> -> !torch.vtensor<[256,256],f32>
    %__auto.blk.2.attn_k.weight = util.global.load @__auto.blk.2.attn_k.weight : tensor<128x256xf32>
    %21 = torch_c.from_builtin_tensor %__auto.blk.2.attn_k.weight : tensor<128x256xf32> -> !torch.vtensor<[128,256],f32>
    %__auto.blk.2.attn_v.weight = util.global.load @__auto.blk.2.attn_v.weight : tensor<128x256xf32>
    %22 = torch_c.from_builtin_tensor %__auto.blk.2.attn_v.weight : tensor<128x256xf32> -> !torch.vtensor<[128,256],f32>
    %__auto.blk.2.attn_output.weight = util.global.load @__auto.blk.2.attn_output.weight : tensor<256x256xf32>
    %23 = torch_c.from_builtin_tensor %__auto.blk.2.attn_output.weight : tensor<256x256xf32> -> !torch.vtensor<[256,256],f32>
    %__auto.blk.2.ffn_norm.weight = util.global.load @__auto.blk.2.ffn_norm.weight : tensor<256xf32>
    %24 = torch_c.from_builtin_tensor %__auto.blk.2.ffn_norm.weight : tensor<256xf32> -> !torch.vtensor<[256],f32>
    %__auto.blk.2.ffn_gate.weight = util.global.load @__auto.blk.2.ffn_gate.weight : tensor<23x256xf32>
    %25 = torch_c.from_builtin_tensor %__auto.blk.2.ffn_gate.weight : tensor<23x256xf32> -> !torch.vtensor<[23,256],f32>
    %__auto.blk.2.ffn_up.weight = util.global.load @__auto.blk.2.ffn_up.weight : tensor<23x256xf32>
    %26 = torch_c.from_builtin_tensor %__auto.blk.2.ffn_up.weight : tensor<23x256xf32> -> !torch.vtensor<[23,256],f32>
    %__auto.blk.2.ffn_down.weight = util.global.load @__auto.blk.2.ffn_down.weight : tensor<256x23xf32>
    %27 = torch_c.from_builtin_tensor %__auto.blk.2.ffn_down.weight : tensor<256x23xf32> -> !torch.vtensor<[256,23],f32>
    %__auto.output_norm.weight = util.global.load @__auto.output_norm.weight : tensor<1x256xf32>
    %28 = torch_c.from_builtin_tensor %__auto.output_norm.weight : tensor<1x256xf32> -> !torch.vtensor<[1,256],f32>
    %__auto.output.weight = util.global.load @__auto.output.weight : tensor<256x256xf32>
    %29 = torch_c.from_builtin_tensor %__auto.output.weight : tensor<256x256xf32> -> !torch.vtensor<[256,256],f32>
    %30 = torch.copy.to_vtensor %arg3 : !torch.vtensor<[?,24576],f16>
    %31 = torch.symbolic_int "s1" {min_val = 2, max_val = 3} : !torch.int
    %32 = torch.symbolic_int "s2" {min_val = 2, max_val = 9223372036854775806} : !torch.int
    torch.bind_symbolic_shape %arg0, [%31], affine_map<()[s0] -> (4, s0 * 32)> : !torch.vtensor<[4,?],si64>
    torch.bind_symbolic_shape %arg2, [%31], affine_map<()[s0] -> (4, s0)> : !torch.vtensor<[4,?],si64>
    torch.bind_symbolic_shape %30, [%32], affine_map<()[s0] -> (s0, 24576)> : !torch.vtensor<[?,24576],f16>
    %int5 = torch.constant.int 5
    %33 = torch.prims.convert_element_type %0, %int5 : !torch.vtensor<[256,256],f32>, !torch.int -> !torch.vtensor<[256,256],f16>
    %int-1 = torch.constant.int -1
    %false = torch.constant.bool false
    %false_0 = torch.constant.bool false
    %34 = torch.aten.embedding %33, %arg0, %int-1, %false, %false_0 : !torch.vtensor<[256,256],f16>, !torch.vtensor<[4,?],si64>, !torch.int, !torch.bool, !torch.bool -> !torch.vtensor<[4,?,256],f16>
    torch.bind_symbolic_shape %34, [%31], affine_map<()[s0] -> (4, s0 * 32, 256)> : !torch.vtensor<[4,?,256],f16>
    %int6 = torch.constant.int 6
    %35 = torch.prims.convert_element_type %34, %int6 : !torch.vtensor<[4,?,256],f16>, !torch.int -> !torch.vtensor<[4,?,256],f32>
    torch.bind_symbolic_shape %35, [%31], affine_map<()[s0] -> (4, s0 * 32, 256)> : !torch.vtensor<[4,?,256],f32>
    %int2 = torch.constant.int 2
    %36 = torch.aten.pow.Tensor_Scalar %35, %int2 : !torch.vtensor<[4,?,256],f32>, !torch.int -> !torch.vtensor<[4,?,256],f32>
    torch.bind_symbolic_shape %36, [%31], affine_map<()[s0] -> (4, s0 * 32, 256)> : !torch.vtensor<[4,?,256],f32>
    %int-1_1 = torch.constant.int -1
    %37 = torch.prim.ListConstruct %int-1_1 : (!torch.int) -> !torch.list<int>
    %true = torch.constant.bool true
    %none = torch.constant.none
    %38 = torch.aten.mean.dim %36, %37, %true, %none : !torch.vtensor<[4,?,256],f32>, !torch.list<int>, !torch.bool, !torch.none -> !torch.vtensor<[4,?,1],f32>
    torch.bind_symbolic_shape %38, [%31], affine_map<()[s0] -> (4, s0 * 32, 1)> : !torch.vtensor<[4,?,1],f32>
    %float1.000000e-02 = torch.constant.float 1.000000e-02
    %int1 = torch.constant.int 1
    %39 = torch.aten.add.Scalar %38, %float1.000000e-02, %int1 : !torch.vtensor<[4,?,1],f32>, !torch.float, !torch.int -> !torch.vtensor<[4,?,1],f32>
    torch.bind_symbolic_shape %39, [%31], affine_map<()[s0] -> (4, s0 * 32, 1)> : !torch.vtensor<[4,?,1],f32>
    %40 = torch.aten.rsqrt %39 : !torch.vtensor<[4,?,1],f32> -> !torch.vtensor<[4,?,1],f32>
    torch.bind_symbolic_shape %40, [%31], affine_map<()[s0] -> (4, s0 * 32, 1)> : !torch.vtensor<[4,?,1],f32>
    %41 = torch.aten.mul.Tensor %35, %40 : !torch.vtensor<[4,?,256],f32>, !torch.vtensor<[4,?,1],f32> -> !torch.vtensor<[4,?,256],f32>
    torch.bind_symbolic_shape %41, [%31], affine_map<()[s0] -> (4, s0 * 32, 256)> : !torch.vtensor<[4,?,256],f32>
    %int5_2 = torch.constant.int 5
    %42 = torch.prims.convert_element_type %41, %int5_2 : !torch.vtensor<[4,?,256],f32>, !torch.int -> !torch.vtensor<[4,?,256],f16>
    torch.bind_symbolic_shape %42, [%31], affine_map<()[s0] -> (4, s0 * 32, 256)> : !torch.vtensor<[4,?,256],f16>
    %43 = torch.aten.mul.Tensor %1, %42 : !torch.vtensor<[256],f32>, !torch.vtensor<[4,?,256],f16> -> !torch.vtensor<[4,?,256],f32>
    torch.bind_symbolic_shape %43, [%31], affine_map<()[s0] -> (4, s0 * 32, 256)> : !torch.vtensor<[4,?,256],f32>
    %int5_3 = torch.constant.int 5
    %44 = torch.prims.convert_element_type %43, %int5_3 : !torch.vtensor<[4,?,256],f32>, !torch.int -> !torch.vtensor<[4,?,256],f16>
    torch.bind_symbolic_shape %44, [%31], affine_map<()[s0] -> (4, s0 * 32, 256)> : !torch.vtensor<[4,?,256],f16>
    %int5_4 = torch.constant.int 5
    %45 = torch.prims.convert_element_type %2, %int5_4 : !torch.vtensor<[256,256],f32>, !torch.int -> !torch.vtensor<[256,256],f16>
    %int-2 = torch.constant.int -2
    %int-1_5 = torch.constant.int -1
    %46 = torch.aten.transpose.int %45, %int-2, %int-1_5 : !torch.vtensor<[256,256],f16>, !torch.int, !torch.int -> !torch.vtensor<[256,256],f16>
    %int1_6 = torch.constant.int 1
    %47 = torch.aten.size.int %arg0, %int1_6 : !torch.vtensor<[4,?],si64>, !torch.int -> !torch.int
    %int4 = torch.constant.int 4
    %48 = torch.aten.mul.int %int4, %47 : !torch.int, !torch.int -> !torch.int
    %int256 = torch.constant.int 256
    %49 = torch.prim.ListConstruct %48, %int256 : (!torch.int, !torch.int) -> !torch.list<int>
    %50 = torch.aten.view %44, %49 : !torch.vtensor<[4,?,256],f16>, !torch.list<int> -> !torch.vtensor<[?,256],f16>
    torch.bind_symbolic_shape %50, [%31], affine_map<()[s0] -> (s0 * 128, 256)> : !torch.vtensor<[?,256],f16>
    %51 = torch.aten.mm %50, %46 : !torch.vtensor<[?,256],f16>, !torch.vtensor<[256,256],f16> -> !torch.vtensor<[?,256],f16>
    torch.bind_symbolic_shape %51, [%31], affine_map<()[s0] -> (s0 * 128, 256)> : !torch.vtensor<[?,256],f16>
    %int4_7 = torch.constant.int 4
    %int256_8 = torch.constant.int 256
    %52 = torch.prim.ListConstruct %int4_7, %47, %int256_8 : (!torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %53 = torch.aten.view %51, %52 : !torch.vtensor<[?,256],f16>, !torch.list<int> -> !torch.vtensor<[4,?,256],f16>
    torch.bind_symbolic_shape %53, [%31], affine_map<()[s0] -> (4, s0 * 32, 256)> : !torch.vtensor<[4,?,256],f16>
    %int5_9 = torch.constant.int 5
    %54 = torch.prims.convert_element_type %3, %int5_9 : !torch.vtensor<[128,256],f32>, !torch.int -> !torch.vtensor<[128,256],f16>
    %int-2_10 = torch.constant.int -2
    %int-1_11 = torch.constant.int -1
    %55 = torch.aten.transpose.int %54, %int-2_10, %int-1_11 : !torch.vtensor<[128,256],f16>, !torch.int, !torch.int -> !torch.vtensor<[256,128],f16>
    %int4_12 = torch.constant.int 4
    %56 = torch.aten.mul.int %int4_12, %47 : !torch.int, !torch.int -> !torch.int
    %int256_13 = torch.constant.int 256
    %57 = torch.prim.ListConstruct %56, %int256_13 : (!torch.int, !torch.int) -> !torch.list<int>
    %58 = torch.aten.view %44, %57 : !torch.vtensor<[4,?,256],f16>, !torch.list<int> -> !torch.vtensor<[?,256],f16>
    torch.bind_symbolic_shape %58, [%31], affine_map<()[s0] -> (s0 * 128, 256)> : !torch.vtensor<[?,256],f16>
    %59 = torch.aten.mm %58, %55 : !torch.vtensor<[?,256],f16>, !torch.vtensor<[256,128],f16> -> !torch.vtensor<[?,128],f16>
    torch.bind_symbolic_shape %59, [%31], affine_map<()[s0] -> (s0 * 128, 128)> : !torch.vtensor<[?,128],f16>
    %int4_14 = torch.constant.int 4
    %int128 = torch.constant.int 128
    %60 = torch.prim.ListConstruct %int4_14, %47, %int128 : (!torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %61 = torch.aten.view %59, %60 : !torch.vtensor<[?,128],f16>, !torch.list<int> -> !torch.vtensor<[4,?,128],f16>
    torch.bind_symbolic_shape %61, [%31], affine_map<()[s0] -> (4, s0 * 32, 128)> : !torch.vtensor<[4,?,128],f16>
    %int5_15 = torch.constant.int 5
    %62 = torch.prims.convert_element_type %4, %int5_15 : !torch.vtensor<[128,256],f32>, !torch.int -> !torch.vtensor<[128,256],f16>
    %int-2_16 = torch.constant.int -2
    %int-1_17 = torch.constant.int -1
    %63 = torch.aten.transpose.int %62, %int-2_16, %int-1_17 : !torch.vtensor<[128,256],f16>, !torch.int, !torch.int -> !torch.vtensor<[256,128],f16>
    %int4_18 = torch.constant.int 4
    %64 = torch.aten.mul.int %int4_18, %47 : !torch.int, !torch.int -> !torch.int
    %int256_19 = torch.constant.int 256
    %65 = torch.prim.ListConstruct %64, %int256_19 : (!torch.int, !torch.int) -> !torch.list<int>
    %66 = torch.aten.view %44, %65 : !torch.vtensor<[4,?,256],f16>, !torch.list<int> -> !torch.vtensor<[?,256],f16>
    torch.bind_symbolic_shape %66, [%31], affine_map<()[s0] -> (s0 * 128, 256)> : !torch.vtensor<[?,256],f16>
    %67 = torch.aten.mm %66, %63 : !torch.vtensor<[?,256],f16>, !torch.vtensor<[256,128],f16> -> !torch.vtensor<[?,128],f16>
    torch.bind_symbolic_shape %67, [%31], affine_map<()[s0] -> (s0 * 128, 128)> : !torch.vtensor<[?,128],f16>
    %int4_20 = torch.constant.int 4
    %int128_21 = torch.constant.int 128
    %68 = torch.prim.ListConstruct %int4_20, %47, %int128_21 : (!torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %69 = torch.aten.view %67, %68 : !torch.vtensor<[?,128],f16>, !torch.list<int> -> !torch.vtensor<[4,?,128],f16>
    torch.bind_symbolic_shape %69, [%31], affine_map<()[s0] -> (4, s0 * 32, 128)> : !torch.vtensor<[4,?,128],f16>
    %int4_22 = torch.constant.int 4
    %int8 = torch.constant.int 8
    %int32 = torch.constant.int 32
    %70 = torch.prim.ListConstruct %int4_22, %47, %int8, %int32 : (!torch.int, !torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %71 = torch.aten.view %53, %70 : !torch.vtensor<[4,?,256],f16>, !torch.list<int> -> !torch.vtensor<[4,?,8,32],f16>
    torch.bind_symbolic_shape %71, [%31], affine_map<()[s0] -> (4, s0 * 32, 8, 32)> : !torch.vtensor<[4,?,8,32],f16>
    %int4_23 = torch.constant.int 4
    %int4_24 = torch.constant.int 4
    %int32_25 = torch.constant.int 32
    %72 = torch.prim.ListConstruct %int4_23, %47, %int4_24, %int32_25 : (!torch.int, !torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %73 = torch.aten.view %61, %72 : !torch.vtensor<[4,?,128],f16>, !torch.list<int> -> !torch.vtensor<[4,?,4,32],f16>
    torch.bind_symbolic_shape %73, [%31], affine_map<()[s0] -> (4, s0 * 32, 4, 32)> : !torch.vtensor<[4,?,4,32],f16>
    %int4_26 = torch.constant.int 4
    %int4_27 = torch.constant.int 4
    %int32_28 = torch.constant.int 32
    %74 = torch.prim.ListConstruct %int4_26, %47, %int4_27, %int32_28 : (!torch.int, !torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %75 = torch.aten.view %69, %74 : !torch.vtensor<[4,?,128],f16>, !torch.list<int> -> !torch.vtensor<[4,?,4,32],f16>
    torch.bind_symbolic_shape %75, [%31], affine_map<()[s0] -> (4, s0 * 32, 4, 32)> : !torch.vtensor<[4,?,4,32],f16>
    %int128_29 = torch.constant.int 128
    %none_30 = torch.constant.none
    %none_31 = torch.constant.none
    %cpu = torch.constant.device "cpu"
    %false_32 = torch.constant.bool false
    %76 = torch.aten.arange %int128_29, %none_30, %none_31, %cpu, %false_32 : !torch.int, !torch.none, !torch.none, !torch.Device, !torch.bool -> !torch.vtensor<[128],si64>
    %int0 = torch.constant.int 0
    %int32_33 = torch.constant.int 32
    %none_34 = torch.constant.none
    %none_35 = torch.constant.none
    %cpu_36 = torch.constant.device "cpu"
    %false_37 = torch.constant.bool false
    %77 = torch.aten.arange.start %int0, %int32_33, %none_34, %none_35, %cpu_36, %false_37 : !torch.int, !torch.int, !torch.none, !torch.none, !torch.Device, !torch.bool -> !torch.vtensor<[32],si64>
    %int2_38 = torch.constant.int 2
    %78 = torch.aten.floor_divide.Scalar %77, %int2_38 : !torch.vtensor<[32],si64>, !torch.int -> !torch.vtensor<[32],si64>
    %int6_39 = torch.constant.int 6
    %79 = torch.prims.convert_element_type %78, %int6_39 : !torch.vtensor<[32],si64>, !torch.int -> !torch.vtensor<[32],f32>
    %int32_40 = torch.constant.int 32
    %80 = torch.aten.div.Scalar %79, %int32_40 : !torch.vtensor<[32],f32>, !torch.int -> !torch.vtensor<[32],f32>
    %float2.000000e00 = torch.constant.float 2.000000e+00
    %81 = torch.aten.mul.Scalar %80, %float2.000000e00 : !torch.vtensor<[32],f32>, !torch.float -> !torch.vtensor<[32],f32>
    %float5.000000e05 = torch.constant.float 5.000000e+05
    %82 = torch.aten.pow.Scalar %float5.000000e05, %81 : !torch.float, !torch.vtensor<[32],f32> -> !torch.vtensor<[32],f32>
    %83 = torch.aten.reciprocal %82 : !torch.vtensor<[32],f32> -> !torch.vtensor<[32],f32>
    %float1.000000e00 = torch.constant.float 1.000000e+00
    %84 = torch.aten.mul.Scalar %83, %float1.000000e00 : !torch.vtensor<[32],f32>, !torch.float -> !torch.vtensor<[32],f32>
    %int1_41 = torch.constant.int 1
    %85 = torch.aten.unsqueeze %76, %int1_41 : !torch.vtensor<[128],si64>, !torch.int -> !torch.vtensor<[128,1],si64>
    %int0_42 = torch.constant.int 0
    %86 = torch.aten.unsqueeze %84, %int0_42 : !torch.vtensor<[32],f32>, !torch.int -> !torch.vtensor<[1,32],f32>
    %87 = torch.aten.mul.Tensor %85, %86 : !torch.vtensor<[128,1],si64>, !torch.vtensor<[1,32],f32> -> !torch.vtensor<[128,32],f32>
    %int1_43 = torch.constant.int 1
    %88 = torch.aten.size.int %53, %int1_43 : !torch.vtensor<[4,?,256],f16>, !torch.int -> !torch.int
    %int0_44 = torch.constant.int 0
    %89 = torch.aten.add.int %int0_44, %88 : !torch.int, !torch.int -> !torch.int
    %int0_45 = torch.constant.int 0
    %int0_46 = torch.constant.int 0
    %int1_47 = torch.constant.int 1
    %90 = torch.aten.slice.Tensor %87, %int0_45, %int0_46, %89, %int1_47 : !torch.vtensor<[128,32],f32>, !torch.int, !torch.int, !torch.int, !torch.int -> !torch.vtensor<[?,32],f32>
    torch.bind_symbolic_shape %90, [%31], affine_map<()[s0] -> (s0 * 32, 32)> : !torch.vtensor<[?,32],f32>
    %int1_48 = torch.constant.int 1
    %int0_49 = torch.constant.int 0
    %int9223372036854775807 = torch.constant.int 9223372036854775807
    %int1_50 = torch.constant.int 1
    %91 = torch.aten.slice.Tensor %90, %int1_48, %int0_49, %int9223372036854775807, %int1_50 : !torch.vtensor<[?,32],f32>, !torch.int, !torch.int, !torch.int, !torch.int -> !torch.vtensor<[?,32],f32>
    torch.bind_symbolic_shape %91, [%31], affine_map<()[s0] -> (s0 * 32, 32)> : !torch.vtensor<[?,32],f32>
    %int1_51 = torch.constant.int 1
    %int0_52 = torch.constant.int 0
    %int9223372036854775807_53 = torch.constant.int 9223372036854775807
    %int1_54 = torch.constant.int 1
    %92 = torch.aten.slice.Tensor %91, %int1_51, %int0_52, %int9223372036854775807_53, %int1_54 : !torch.vtensor<[?,32],f32>, !torch.int, !torch.int, !torch.int, !torch.int -> !torch.vtensor<[?,32],f32>
    torch.bind_symbolic_shape %92, [%31], affine_map<()[s0] -> (s0 * 32, 32)> : !torch.vtensor<[?,32],f32>
    %int0_55 = torch.constant.int 0
    %93 = torch.aten.unsqueeze %92, %int0_55 : !torch.vtensor<[?,32],f32>, !torch.int -> !torch.vtensor<[1,?,32],f32>
    torch.bind_symbolic_shape %93, [%31], affine_map<()[s0] -> (1, s0 * 32, 32)> : !torch.vtensor<[1,?,32],f32>
    %int1_56 = torch.constant.int 1
    %int0_57 = torch.constant.int 0
    %int9223372036854775807_58 = torch.constant.int 9223372036854775807
    %int1_59 = torch.constant.int 1
    %94 = torch.aten.slice.Tensor %93, %int1_56, %int0_57, %int9223372036854775807_58, %int1_59 : !torch.vtensor<[1,?,32],f32>, !torch.int, !torch.int, !torch.int, !torch.int -> !torch.vtensor<[1,?,32],f32>
    torch.bind_symbolic_shape %94, [%31], affine_map<()[s0] -> (1, s0 * 32, 32)> : !torch.vtensor<[1,?,32],f32>
    %int2_60 = torch.constant.int 2
    %int0_61 = torch.constant.int 0
    %int9223372036854775807_62 = torch.constant.int 9223372036854775807
    %int1_63 = torch.constant.int 1
    %95 = torch.aten.slice.Tensor %94, %int2_60, %int0_61, %int9223372036854775807_62, %int1_63 : !torch.vtensor<[1,?,32],f32>, !torch.int, !torch.int, !torch.int, !torch.int -> !torch.vtensor<[1,?,32],f32>
    torch.bind_symbolic_shape %95, [%31], affine_map<()[s0] -> (1, s0 * 32, 32)> : !torch.vtensor<[1,?,32],f32>
    %int4_64 = torch.constant.int 4
    %int1_65 = torch.constant.int 1
    %int1_66 = torch.constant.int 1
    %96 = torch.prim.ListConstruct %int4_64, %int1_65, %int1_66 : (!torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %97 = torch.aten.repeat %95, %96 : !torch.vtensor<[1,?,32],f32>, !torch.list<int> -> !torch.vtensor<[4,?,32],f32>
    torch.bind_symbolic_shape %97, [%31], affine_map<()[s0] -> (4, s0 * 32, 32)> : !torch.vtensor<[4,?,32],f32>
    %int6_67 = torch.constant.int 6
    %98 = torch.prims.convert_element_type %71, %int6_67 : !torch.vtensor<[4,?,8,32],f16>, !torch.int -> !torch.vtensor<[4,?,8,32],f32>
    torch.bind_symbolic_shape %98, [%31], affine_map<()[s0] -> (4, s0 * 32, 8, 32)> : !torch.vtensor<[4,?,8,32],f32>
    %99 = torch_c.to_builtin_tensor %98 : !torch.vtensor<[4,?,8,32],f32> -> tensor<4x?x8x32xf32>
    %100 = torch_c.to_builtin_tensor %97 : !torch.vtensor<[4,?,32],f32> -> tensor<4x?x32xf32>
    %101 = util.call @sharktank_rotary_embedding_4_D_8_32_f32(%99, %100) : (tensor<4x?x8x32xf32>, tensor<4x?x32xf32>) -> tensor<4x?x8x32xf32>
    %102 = torch_c.from_builtin_tensor %101 : tensor<4x?x8x32xf32> -> !torch.vtensor<[4,?,8,32],f32>
    torch.bind_symbolic_shape %102, [%31], affine_map<()[s0] -> (4, s0 * 32, 8, 32)> : !torch.vtensor<[4,?,8,32],f32>
    %int5_68 = torch.constant.int 5
    %103 = torch.prims.convert_element_type %102, %int5_68 : !torch.vtensor<[4,?,8,32],f32>, !torch.int -> !torch.vtensor<[4,?,8,32],f16>
    torch.bind_symbolic_shape %103, [%31], affine_map<()[s0] -> (4, s0 * 32, 8, 32)> : !torch.vtensor<[4,?,8,32],f16>
    %int128_69 = torch.constant.int 128
    %none_70 = torch.constant.none
    %none_71 = torch.constant.none
    %cpu_72 = torch.constant.device "cpu"
    %false_73 = torch.constant.bool false
    %104 = torch.aten.arange %int128_69, %none_70, %none_71, %cpu_72, %false_73 : !torch.int, !torch.none, !torch.none, !torch.Device, !torch.bool -> !torch.vtensor<[128],si64>
    %int0_74 = torch.constant.int 0
    %int32_75 = torch.constant.int 32
    %none_76 = torch.constant.none
    %none_77 = torch.constant.none
    %cpu_78 = torch.constant.device "cpu"
    %false_79 = torch.constant.bool false
    %105 = torch.aten.arange.start %int0_74, %int32_75, %none_76, %none_77, %cpu_78, %false_79 : !torch.int, !torch.int, !torch.none, !torch.none, !torch.Device, !torch.bool -> !torch.vtensor<[32],si64>
    %int2_80 = torch.constant.int 2
    %106 = torch.aten.floor_divide.Scalar %105, %int2_80 : !torch.vtensor<[32],si64>, !torch.int -> !torch.vtensor<[32],si64>
    %int6_81 = torch.constant.int 6
    %107 = torch.prims.convert_element_type %106, %int6_81 : !torch.vtensor<[32],si64>, !torch.int -> !torch.vtensor<[32],f32>
    %int32_82 = torch.constant.int 32
    %108 = torch.aten.div.Scalar %107, %int32_82 : !torch.vtensor<[32],f32>, !torch.int -> !torch.vtensor<[32],f32>
    %float2.000000e00_83 = torch.constant.float 2.000000e+00
    %109 = torch.aten.mul.Scalar %108, %float2.000000e00_83 : !torch.vtensor<[32],f32>, !torch.float -> !torch.vtensor<[32],f32>
    %float5.000000e05_84 = torch.constant.float 5.000000e+05
    %110 = torch.aten.pow.Scalar %float5.000000e05_84, %109 : !torch.float, !torch.vtensor<[32],f32> -> !torch.vtensor<[32],f32>
    %111 = torch.aten.reciprocal %110 : !torch.vtensor<[32],f32> -> !torch.vtensor<[32],f32>
    %float1.000000e00_85 = torch.constant.float 1.000000e+00
    %112 = torch.aten.mul.Scalar %111, %float1.000000e00_85 : !torch.vtensor<[32],f32>, !torch.float -> !torch.vtensor<[32],f32>
    %int1_86 = torch.constant.int 1
    %113 = torch.aten.unsqueeze %104, %int1_86 : !torch.vtensor<[128],si64>, !torch.int -> !torch.vtensor<[128,1],si64>
    %int0_87 = torch.constant.int 0
    %114 = torch.aten.unsqueeze %112, %int0_87 : !torch.vtensor<[32],f32>, !torch.int -> !torch.vtensor<[1,32],f32>
    %115 = torch.aten.mul.Tensor %113, %114 : !torch.vtensor<[128,1],si64>, !torch.vtensor<[1,32],f32> -> !torch.vtensor<[128,32],f32>
    %int1_88 = torch.constant.int 1
    %116 = torch.aten.size.int %61, %int1_88 : !torch.vtensor<[4,?,128],f16>, !torch.int -> !torch.int
    %int0_89 = torch.constant.int 0
    %117 = torch.aten.add.int %int0_89, %116 : !torch.int, !torch.int -> !torch.int
    %int0_90 = torch.constant.int 0
    %int0_91 = torch.constant.int 0
    %int1_92 = torch.constant.int 1
    %118 = torch.aten.slice.Tensor %115, %int0_90, %int0_91, %117, %int1_92 : !torch.vtensor<[128,32],f32>, !torch.int, !torch.int, !torch.int, !torch.int -> !torch.vtensor<[?,32],f32>
    torch.bind_symbolic_shape %118, [%31], affine_map<()[s0] -> (s0 * 32, 32)> : !torch.vtensor<[?,32],f32>
    %int1_93 = torch.constant.int 1
    %int0_94 = torch.constant.int 0
    %int9223372036854775807_95 = torch.constant.int 9223372036854775807
    %int1_96 = torch.constant.int 1
    %119 = torch.aten.slice.Tensor %118, %int1_93, %int0_94, %int9223372036854775807_95, %int1_96 : !torch.vtensor<[?,32],f32>, !torch.int, !torch.int, !torch.int, !torch.int -> !torch.vtensor<[?,32],f32>
    torch.bind_symbolic_shape %119, [%31], affine_map<()[s0] -> (s0 * 32, 32)> : !torch.vtensor<[?,32],f32>
    %int1_97 = torch.constant.int 1
    %int0_98 = torch.constant.int 0
    %int9223372036854775807_99 = torch.constant.int 9223372036854775807
    %int1_100 = torch.constant.int 1
    %120 = torch.aten.slice.Tensor %119, %int1_97, %int0_98, %int9223372036854775807_99, %int1_100 : !torch.vtensor<[?,32],f32>, !torch.int, !torch.int, !torch.int, !torch.int -> !torch.vtensor<[?,32],f32>
    torch.bind_symbolic_shape %120, [%31], affine_map<()[s0] -> (s0 * 32, 32)> : !torch.vtensor<[?,32],f32>
    %int0_101 = torch.constant.int 0
    %121 = torch.aten.unsqueeze %120, %int0_101 : !torch.vtensor<[?,32],f32>, !torch.int -> !torch.vtensor<[1,?,32],f32>
    torch.bind_symbolic_shape %121, [%31], affine_map<()[s0] -> (1, s0 * 32, 32)> : !torch.vtensor<[1,?,32],f32>
    %int1_102 = torch.constant.int 1
    %int0_103 = torch.constant.int 0
    %int9223372036854775807_104 = torch.constant.int 9223372036854775807
    %int1_105 = torch.constant.int 1
    %122 = torch.aten.slice.Tensor %121, %int1_102, %int0_103, %int9223372036854775807_104, %int1_105 : !torch.vtensor<[1,?,32],f32>, !torch.int, !torch.int, !torch.int, !torch.int -> !torch.vtensor<[1,?,32],f32>
    torch.bind_symbolic_shape %122, [%31], affine_map<()[s0] -> (1, s0 * 32, 32)> : !torch.vtensor<[1,?,32],f32>
    %int2_106 = torch.constant.int 2
    %int0_107 = torch.constant.int 0
    %int9223372036854775807_108 = torch.constant.int 9223372036854775807
    %int1_109 = torch.constant.int 1
    %123 = torch.aten.slice.Tensor %122, %int2_106, %int0_107, %int9223372036854775807_108, %int1_109 : !torch.vtensor<[1,?,32],f32>, !torch.int, !torch.int, !torch.int, !torch.int -> !torch.vtensor<[1,?,32],f32>
    torch.bind_symbolic_shape %123, [%31], affine_map<()[s0] -> (1, s0 * 32, 32)> : !torch.vtensor<[1,?,32],f32>
    %int4_110 = torch.constant.int 4
    %int1_111 = torch.constant.int 1
    %int1_112 = torch.constant.int 1
    %124 = torch.prim.ListConstruct %int4_110, %int1_111, %int1_112 : (!torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %125 = torch.aten.repeat %123, %124 : !torch.vtensor<[1,?,32],f32>, !torch.list<int> -> !torch.vtensor<[4,?,32],f32>
    torch.bind_symbolic_shape %125, [%31], affine_map<()[s0] -> (4, s0 * 32, 32)> : !torch.vtensor<[4,?,32],f32>
    %int6_113 = torch.constant.int 6
    %126 = torch.prims.convert_element_type %73, %int6_113 : !torch.vtensor<[4,?,4,32],f16>, !torch.int -> !torch.vtensor<[4,?,4,32],f32>
    torch.bind_symbolic_shape %126, [%31], affine_map<()[s0] -> (4, s0 * 32, 4, 32)> : !torch.vtensor<[4,?,4,32],f32>
    %127 = torch_c.to_builtin_tensor %126 : !torch.vtensor<[4,?,4,32],f32> -> tensor<4x?x4x32xf32>
    %128 = torch_c.to_builtin_tensor %125 : !torch.vtensor<[4,?,32],f32> -> tensor<4x?x32xf32>
    %129 = util.call @sharktank_rotary_embedding_4_D_4_32_f32(%127, %128) : (tensor<4x?x4x32xf32>, tensor<4x?x32xf32>) -> tensor<4x?x4x32xf32>
    %130 = torch_c.from_builtin_tensor %129 : tensor<4x?x4x32xf32> -> !torch.vtensor<[4,?,4,32],f32>
    torch.bind_symbolic_shape %130, [%31], affine_map<()[s0] -> (4, s0 * 32, 4, 32)> : !torch.vtensor<[4,?,4,32],f32>
    %int5_114 = torch.constant.int 5
    %131 = torch.prims.convert_element_type %130, %int5_114 : !torch.vtensor<[4,?,4,32],f32>, !torch.int -> !torch.vtensor<[4,?,4,32],f16>
    torch.bind_symbolic_shape %131, [%31], affine_map<()[s0] -> (4, s0 * 32, 4, 32)> : !torch.vtensor<[4,?,4,32],f16>
    %int0_115 = torch.constant.int 0
    %132 = torch.aten.size.int %30, %int0_115 : !torch.vtensor<[?,24576],f16>, !torch.int -> !torch.int
    %int3 = torch.constant.int 3
    %int2_116 = torch.constant.int 2
    %int32_117 = torch.constant.int 32
    %int4_118 = torch.constant.int 4
    %int32_119 = torch.constant.int 32
    %133 = torch.prim.ListConstruct %132, %int3, %int2_116, %int32_117, %int4_118, %int32_119 : (!torch.int, !torch.int, !torch.int, !torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %134 = torch.aten.view %30, %133 : !torch.vtensor<[?,24576],f16>, !torch.list<int> -> !torch.vtensor<[?,3,2,32,4,32],f16>
    torch.bind_symbolic_shape %134, [%32], affine_map<()[s0] -> (s0, 3, 2, 32, 4, 32)> : !torch.vtensor<[?,3,2,32,4,32],f16>
    %int3_120 = torch.constant.int 3
    %135 = torch.aten.mul.int %132, %int3_120 : !torch.int, !torch.int -> !torch.int
    %int2_121 = torch.constant.int 2
    %136 = torch.aten.mul.int %135, %int2_121 : !torch.int, !torch.int -> !torch.int
    %int32_122 = torch.constant.int 32
    %int4_123 = torch.constant.int 4
    %int32_124 = torch.constant.int 32
    %137 = torch.prim.ListConstruct %136, %int32_122, %int4_123, %int32_124 : (!torch.int, !torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %138 = torch.aten.view %134, %137 : !torch.vtensor<[?,3,2,32,4,32],f16>, !torch.list<int> -> !torch.vtensor<[?,32,4,32],f16>
    torch.bind_symbolic_shape %138, [%32], affine_map<()[s0] -> (s0 * 6, 32, 4, 32)> : !torch.vtensor<[?,32,4,32],f16>
    %int6_125 = torch.constant.int 6
    %139 = torch.aten.mul.Scalar %arg2, %int6_125 : !torch.vtensor<[4,?],si64>, !torch.int -> !torch.vtensor<[4,?],si64>
    torch.bind_symbolic_shape %139, [%31], affine_map<()[s0] -> (4, s0)> : !torch.vtensor<[4,?],si64>
    %int0_126 = torch.constant.int 0
    %int1_127 = torch.constant.int 1
    %140 = torch.aten.add.Scalar %139, %int0_126, %int1_127 : !torch.vtensor<[4,?],si64>, !torch.int, !torch.int -> !torch.vtensor<[4,?],si64>
    torch.bind_symbolic_shape %140, [%31], affine_map<()[s0] -> (4, s0)> : !torch.vtensor<[4,?],si64>
    %int1_128 = torch.constant.int 1
    %141 = torch.aten.size.int %arg2, %int1_128 : !torch.vtensor<[4,?],si64>, !torch.int -> !torch.int
    %int4_129 = torch.constant.int 4
    %int32_130 = torch.constant.int 32
    %int4_131 = torch.constant.int 4
    %int32_132 = torch.constant.int 32
    %142 = torch.prim.ListConstruct %int4_129, %141, %int32_130, %int4_131, %int32_132 : (!torch.int, !torch.int, !torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %143 = torch.aten.view %131, %142 : !torch.vtensor<[4,?,4,32],f16>, !torch.list<int> -> !torch.vtensor<[4,?,32,4,32],f16>
    torch.bind_symbolic_shape %143, [%31], affine_map<()[s0] -> (4, s0, 32, 4, 32)> : !torch.vtensor<[4,?,32,4,32],f16>
    %int4_133 = torch.constant.int 4
    %144 = torch.aten.mul.int %int4_133, %141 : !torch.int, !torch.int -> !torch.int
    %int32_134 = torch.constant.int 32
    %int4_135 = torch.constant.int 4
    %int32_136 = torch.constant.int 32
    %145 = torch.prim.ListConstruct %144, %int32_134, %int4_135, %int32_136 : (!torch.int, !torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %146 = torch.aten.view %143, %145 : !torch.vtensor<[4,?,32,4,32],f16>, !torch.list<int> -> !torch.vtensor<[?,32,4,32],f16>
    torch.bind_symbolic_shape %146, [%31], affine_map<()[s0] -> (s0 * 4, 32, 4, 32)> : !torch.vtensor<[?,32,4,32],f16>
    %int4_137 = torch.constant.int 4
    %147 = torch.aten.mul.int %int4_137, %141 : !torch.int, !torch.int -> !torch.int
    %148 = torch.prim.ListConstruct %147 : (!torch.int) -> !torch.list<int>
    %149 = torch.aten.view %140, %148 : !torch.vtensor<[4,?],si64>, !torch.list<int> -> !torch.vtensor<[?],si64>
    torch.bind_symbolic_shape %149, [%31], affine_map<()[s0] -> (s0 * 4)> : !torch.vtensor<[?],si64>
    %150 = torch.prim.ListConstruct %149 : (!torch.vtensor<[?],si64>) -> !torch.list<optional<vtensor>>
    %false_138 = torch.constant.bool false
    %151 = torch.aten.index_put %138, %150, %146, %false_138 : !torch.vtensor<[?,32,4,32],f16>, !torch.list<optional<vtensor>>, !torch.vtensor<[?,32,4,32],f16>, !torch.bool -> !torch.vtensor<[?,32,4,32],f16>
    torch.bind_symbolic_shape %151, [%32], affine_map<()[s0] -> (s0 * 6, 32, 4, 32)> : !torch.vtensor<[?,32,4,32],f16>
    %int3_139 = torch.constant.int 3
    %int2_140 = torch.constant.int 2
    %int32_141 = torch.constant.int 32
    %int4_142 = torch.constant.int 4
    %int32_143 = torch.constant.int 32
    %152 = torch.prim.ListConstruct %132, %int3_139, %int2_140, %int32_141, %int4_142, %int32_143 : (!torch.int, !torch.int, !torch.int, !torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %153 = torch.aten.view %151, %152 : !torch.vtensor<[?,32,4,32],f16>, !torch.list<int> -> !torch.vtensor<[?,3,2,32,4,32],f16>
    torch.bind_symbolic_shape %153, [%32], affine_map<()[s0] -> (s0, 3, 2, 32, 4, 32)> : !torch.vtensor<[?,3,2,32,4,32],f16>
    %int24576 = torch.constant.int 24576
    %154 = torch.prim.ListConstruct %132, %int24576 : (!torch.int, !torch.int) -> !torch.list<int>
    %155 = torch.aten.view %153, %154 : !torch.vtensor<[?,3,2,32,4,32],f16>, !torch.list<int> -> !torch.vtensor<[?,24576],f16>
    torch.bind_symbolic_shape %155, [%32], affine_map<()[s0] -> (s0, 24576)> : !torch.vtensor<[?,24576],f16>
    %int3_144 = torch.constant.int 3
    %int2_145 = torch.constant.int 2
    %int32_146 = torch.constant.int 32
    %int4_147 = torch.constant.int 4
    %int32_148 = torch.constant.int 32
    %156 = torch.prim.ListConstruct %132, %int3_144, %int2_145, %int32_146, %int4_147, %int32_148 : (!torch.int, !torch.int, !torch.int, !torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %157 = torch.aten.view %155, %156 : !torch.vtensor<[?,24576],f16>, !torch.list<int> -> !torch.vtensor<[?,3,2,32,4,32],f16>
    torch.bind_symbolic_shape %157, [%32], affine_map<()[s0] -> (s0, 3, 2, 32, 4, 32)> : !torch.vtensor<[?,3,2,32,4,32],f16>
    %int32_149 = torch.constant.int 32
    %int4_150 = torch.constant.int 4
    %int32_151 = torch.constant.int 32
    %158 = torch.prim.ListConstruct %136, %int32_149, %int4_150, %int32_151 : (!torch.int, !torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %159 = torch.aten.view %157, %158 : !torch.vtensor<[?,3,2,32,4,32],f16>, !torch.list<int> -> !torch.vtensor<[?,32,4,32],f16>
    torch.bind_symbolic_shape %159, [%32], affine_map<()[s0] -> (s0 * 6, 32, 4, 32)> : !torch.vtensor<[?,32,4,32],f16>
    %int4_152 = torch.constant.int 4
    %int32_153 = torch.constant.int 32
    %int4_154 = torch.constant.int 4
    %int32_155 = torch.constant.int 32
    %160 = torch.prim.ListConstruct %int4_152, %141, %int32_153, %int4_154, %int32_155 : (!torch.int, !torch.int, !torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %161 = torch.aten.view %75, %160 : !torch.vtensor<[4,?,4,32],f16>, !torch.list<int> -> !torch.vtensor<[4,?,32,4,32],f16>
    torch.bind_symbolic_shape %161, [%31], affine_map<()[s0] -> (4, s0, 32, 4, 32)> : !torch.vtensor<[4,?,32,4,32],f16>
    %int4_156 = torch.constant.int 4
    %162 = torch.aten.mul.int %int4_156, %141 : !torch.int, !torch.int -> !torch.int
    %int32_157 = torch.constant.int 32
    %int4_158 = torch.constant.int 4
    %int32_159 = torch.constant.int 32
    %163 = torch.prim.ListConstruct %162, %int32_157, %int4_158, %int32_159 : (!torch.int, !torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %164 = torch.aten.view %161, %163 : !torch.vtensor<[4,?,32,4,32],f16>, !torch.list<int> -> !torch.vtensor<[?,32,4,32],f16>
    torch.bind_symbolic_shape %164, [%31], affine_map<()[s0] -> (s0 * 4, 32, 4, 32)> : !torch.vtensor<[?,32,4,32],f16>
    %int1_160 = torch.constant.int 1
    %int1_161 = torch.constant.int 1
    %165 = torch.aten.add.Scalar %140, %int1_160, %int1_161 : !torch.vtensor<[4,?],si64>, !torch.int, !torch.int -> !torch.vtensor<[4,?],si64>
    torch.bind_symbolic_shape %165, [%31], affine_map<()[s0] -> (4, s0)> : !torch.vtensor<[4,?],si64>
    %int4_162 = torch.constant.int 4
    %166 = torch.aten.mul.int %int4_162, %141 : !torch.int, !torch.int -> !torch.int
    %167 = torch.prim.ListConstruct %166 : (!torch.int) -> !torch.list<int>
    %168 = torch.aten.view %165, %167 : !torch.vtensor<[4,?],si64>, !torch.list<int> -> !torch.vtensor<[?],si64>
    torch.bind_symbolic_shape %168, [%31], affine_map<()[s0] -> (s0 * 4)> : !torch.vtensor<[?],si64>
    %169 = torch.prim.ListConstruct %168 : (!torch.vtensor<[?],si64>) -> !torch.list<optional<vtensor>>
    %false_163 = torch.constant.bool false
    %170 = torch.aten.index_put %159, %169, %164, %false_163 : !torch.vtensor<[?,32,4,32],f16>, !torch.list<optional<vtensor>>, !torch.vtensor<[?,32,4,32],f16>, !torch.bool -> !torch.vtensor<[?,32,4,32],f16>
    torch.bind_symbolic_shape %170, [%32], affine_map<()[s0] -> (s0 * 6, 32, 4, 32)> : !torch.vtensor<[?,32,4,32],f16>
    %int3_164 = torch.constant.int 3
    %int2_165 = torch.constant.int 2
    %int32_166 = torch.constant.int 32
    %int4_167 = torch.constant.int 4
    %int32_168 = torch.constant.int 32
    %171 = torch.prim.ListConstruct %132, %int3_164, %int2_165, %int32_166, %int4_167, %int32_168 : (!torch.int, !torch.int, !torch.int, !torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %172 = torch.aten.view %170, %171 : !torch.vtensor<[?,32,4,32],f16>, !torch.list<int> -> !torch.vtensor<[?,3,2,32,4,32],f16>
    torch.bind_symbolic_shape %172, [%32], affine_map<()[s0] -> (s0, 3, 2, 32, 4, 32)> : !torch.vtensor<[?,3,2,32,4,32],f16>
    %int24576_169 = torch.constant.int 24576
    %173 = torch.prim.ListConstruct %132, %int24576_169 : (!torch.int, !torch.int) -> !torch.list<int>
    %174 = torch.aten.view %172, %173 : !torch.vtensor<[?,3,2,32,4,32],f16>, !torch.list<int> -> !torch.vtensor<[?,24576],f16>
    torch.bind_symbolic_shape %174, [%32], affine_map<()[s0] -> (s0, 24576)> : !torch.vtensor<[?,24576],f16>
    %int-2_170 = torch.constant.int -2
    %175 = torch.aten.unsqueeze %131, %int-2_170 : !torch.vtensor<[4,?,4,32],f16>, !torch.int -> !torch.vtensor<[4,?,4,1,32],f16>
    torch.bind_symbolic_shape %175, [%31], affine_map<()[s0] -> (4, s0 * 32, 4, 1, 32)> : !torch.vtensor<[4,?,4,1,32],f16>
    %int4_171 = torch.constant.int 4
    %int4_172 = torch.constant.int 4
    %int2_173 = torch.constant.int 2
    %int32_174 = torch.constant.int 32
    %176 = torch.prim.ListConstruct %int4_171, %116, %int4_172, %int2_173, %int32_174 : (!torch.int, !torch.int, !torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %false_175 = torch.constant.bool false
    %177 = torch.aten.expand %175, %176, %false_175 : !torch.vtensor<[4,?,4,1,32],f16>, !torch.list<int>, !torch.bool -> !torch.vtensor<[4,?,4,2,32],f16>
    torch.bind_symbolic_shape %177, [%31], affine_map<()[s0] -> (4, s0 * 32, 4, 2, 32)> : !torch.vtensor<[4,?,4,2,32],f16>
    %int0_176 = torch.constant.int 0
    %178 = torch.aten.clone %177, %int0_176 : !torch.vtensor<[4,?,4,2,32],f16>, !torch.int -> !torch.vtensor<[4,?,4,2,32],f16>
    torch.bind_symbolic_shape %178, [%31], affine_map<()[s0] -> (4, s0 * 32, 4, 2, 32)> : !torch.vtensor<[4,?,4,2,32],f16>
    %int4_177 = torch.constant.int 4
    %int8_178 = torch.constant.int 8
    %int32_179 = torch.constant.int 32
    %179 = torch.prim.ListConstruct %int4_177, %116, %int8_178, %int32_179 : (!torch.int, !torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %180 = torch.aten._unsafe_view %178, %179 : !torch.vtensor<[4,?,4,2,32],f16>, !torch.list<int> -> !torch.vtensor<[4,?,8,32],f16>
    torch.bind_symbolic_shape %180, [%31], affine_map<()[s0] -> (4, s0 * 32, 8, 32)> : !torch.vtensor<[4,?,8,32],f16>
    %int-2_180 = torch.constant.int -2
    %181 = torch.aten.unsqueeze %75, %int-2_180 : !torch.vtensor<[4,?,4,32],f16>, !torch.int -> !torch.vtensor<[4,?,4,1,32],f16>
    torch.bind_symbolic_shape %181, [%31], affine_map<()[s0] -> (4, s0 * 32, 4, 1, 32)> : !torch.vtensor<[4,?,4,1,32],f16>
    %int1_181 = torch.constant.int 1
    %182 = torch.aten.size.int %69, %int1_181 : !torch.vtensor<[4,?,128],f16>, !torch.int -> !torch.int
    %int4_182 = torch.constant.int 4
    %int4_183 = torch.constant.int 4
    %int2_184 = torch.constant.int 2
    %int32_185 = torch.constant.int 32
    %183 = torch.prim.ListConstruct %int4_182, %182, %int4_183, %int2_184, %int32_185 : (!torch.int, !torch.int, !torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %false_186 = torch.constant.bool false
    %184 = torch.aten.expand %181, %183, %false_186 : !torch.vtensor<[4,?,4,1,32],f16>, !torch.list<int>, !torch.bool -> !torch.vtensor<[4,?,4,2,32],f16>
    torch.bind_symbolic_shape %184, [%31], affine_map<()[s0] -> (4, s0 * 32, 4, 2, 32)> : !torch.vtensor<[4,?,4,2,32],f16>
    %int0_187 = torch.constant.int 0
    %185 = torch.aten.clone %184, %int0_187 : !torch.vtensor<[4,?,4,2,32],f16>, !torch.int -> !torch.vtensor<[4,?,4,2,32],f16>
    torch.bind_symbolic_shape %185, [%31], affine_map<()[s0] -> (4, s0 * 32, 4, 2, 32)> : !torch.vtensor<[4,?,4,2,32],f16>
    %int4_188 = torch.constant.int 4
    %int8_189 = torch.constant.int 8
    %int32_190 = torch.constant.int 32
    %186 = torch.prim.ListConstruct %int4_188, %182, %int8_189, %int32_190 : (!torch.int, !torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %187 = torch.aten._unsafe_view %185, %186 : !torch.vtensor<[4,?,4,2,32],f16>, !torch.list<int> -> !torch.vtensor<[4,?,8,32],f16>
    torch.bind_symbolic_shape %187, [%31], affine_map<()[s0] -> (4, s0 * 32, 8, 32)> : !torch.vtensor<[4,?,8,32],f16>
    %int1_191 = torch.constant.int 1
    %int2_192 = torch.constant.int 2
    %188 = torch.aten.transpose.int %103, %int1_191, %int2_192 : !torch.vtensor<[4,?,8,32],f16>, !torch.int, !torch.int -> !torch.vtensor<[4,8,?,32],f16>
    torch.bind_symbolic_shape %188, [%31], affine_map<()[s0] -> (4, 8, s0 * 32, 32)> : !torch.vtensor<[4,8,?,32],f16>
    %int1_193 = torch.constant.int 1
    %int2_194 = torch.constant.int 2
    %189 = torch.aten.transpose.int %180, %int1_193, %int2_194 : !torch.vtensor<[4,?,8,32],f16>, !torch.int, !torch.int -> !torch.vtensor<[4,8,?,32],f16>
    torch.bind_symbolic_shape %189, [%31], affine_map<()[s0] -> (4, 8, s0 * 32, 32)> : !torch.vtensor<[4,8,?,32],f16>
    %int1_195 = torch.constant.int 1
    %int2_196 = torch.constant.int 2
    %190 = torch.aten.transpose.int %187, %int1_195, %int2_196 : !torch.vtensor<[4,?,8,32],f16>, !torch.int, !torch.int -> !torch.vtensor<[4,8,?,32],f16>
    torch.bind_symbolic_shape %190, [%31], affine_map<()[s0] -> (4, 8, s0 * 32, 32)> : !torch.vtensor<[4,8,?,32],f16>
    %float0.000000e00 = torch.constant.float 0.000000e+00
    %true_197 = torch.constant.bool true
    %none_198 = torch.constant.none
    %none_199 = torch.constant.none
    %191:2 = torch.operator "torch.aten._scaled_dot_product_flash_attention_for_cpu"(%188, %189, %190, %float0.000000e00, %true_197, %none_198, %none_199) : (!torch.vtensor<[4,8,?,32],f16>, !torch.vtensor<[4,8,?,32],f16>, !torch.vtensor<[4,8,?,32],f16>, !torch.float, !torch.bool, !torch.none, !torch.none) -> (!torch.vtensor<[4,8,?,32],f16>, !torch.vtensor<[4,8,?],f32>) 
    torch.bind_symbolic_shape %191#0, [%31], affine_map<()[s0] -> (4, 8, s0 * 32, 32)> : !torch.vtensor<[4,8,?,32],f16>
    %int1_200 = torch.constant.int 1
    %int2_201 = torch.constant.int 2
