module @module {
  util.global private @__auto.token_embd.weight = #stream.parameter.named<"model"::"token_embd.weight"> : tensor<256x256xf32>
  util.global private @__auto.blk.0.attn_norm.weight = #stream.parameter.named<"model"::"blk.0.attn_norm.weight"> : tensor<256xf32>
  util.global private @__auto.blk.0.attn_q.weight = #stream.parameter.named<"model"::"blk.0.attn_q.weight"> : tensor<256x256xf32>
  util.global private @__auto.blk.0.attn_k.weight = #stream.parameter.named<"model"::"blk.0.attn_k.weight"> : tensor<128x256xf32>
  util.global private @__auto.blk.0.attn_v.weight = #stream.parameter.named<"model"::"blk.0.attn_v.weight"> : tensor<128x256xf32>
  util.global private @__auto.blk.0.attn_output.weight = #stream.parameter.named<"model"::"blk.0.attn_output.weight"> : tensor<256x256xf32>
  util.global private @__auto.blk.0.ffn_norm.weight = #stream.parameter.named<"model"::"blk.0.ffn_norm.weight"> : tensor<256xf32>
  util.global private @__auto.blk.0.ffn_gate.weight = #stream.parameter.named<"model"::"blk.0.ffn_gate.weight"> : tensor<23x256xf32>
  util.global private @__auto.blk.0.ffn_up.weight = #stream.parameter.named<"model"::"blk.0.ffn_up.weight"> : tensor<23x256xf32>
  util.global private @__auto.blk.0.ffn_down.weight = #stream.parameter.named<"model"::"blk.0.ffn_down.weight"> : tensor<256x23xf32>
  util.global private @__auto.blk.1.attn_norm.weight = #stream.parameter.named<"model"::"blk.1.attn_norm.weight"> : tensor<256xf32>
  util.global private @__auto.blk.1.attn_q.weight = #stream.parameter.named<"model"::"blk.1.attn_q.weight"> : tensor<256x256xf32>
  util.global private @__auto.blk.1.attn_k.weight = #stream.parameter.named<"model"::"blk.1.attn_k.weight"> : tensor<128x256xf32>
  util.global private @__auto.blk.1.attn_v.weight = #stream.parameter.named<"model"::"blk.1.attn_v.weight"> : tensor<128x256xf32>
  util.global private @__auto.blk.1.attn_output.weight = #stream.parameter.named<"model"::"blk.1.attn_output.weight"> : tensor<256x256xf32>
  util.global private @__auto.blk.1.ffn_norm.weight = #stream.parameter.named<"model"::"blk.1.ffn_norm.weight"> : tensor<256xf32>
  util.global private @__auto.blk.1.ffn_gate.weight = #stream.parameter.named<"model"::"blk.1.ffn_gate.weight"> : tensor<23x256xf32>
  util.global private @__auto.blk.1.ffn_up.weight = #stream.parameter.named<"model"::"blk.1.ffn_up.weight"> : tensor<23x256xf32>
  util.global private @__auto.blk.1.ffn_down.weight = #stream.parameter.named<"model"::"blk.1.ffn_down.weight"> : tensor<256x23xf32>
  util.global private @__auto.blk.2.attn_norm.weight = #stream.parameter.named<"model"::"blk.2.attn_norm.weight"> : tensor<256xf32>
  util.global private @__auto.blk.2.attn_q.weight = #stream.parameter.named<"model"::"blk.2.attn_q.weight"> : tensor<256x256xf32>
  util.global private @__auto.blk.2.attn_k.weight = #stream.parameter.named<"model"::"blk.2.attn_k.weight"> : tensor<128x256xf32>
  util.global private @__auto.blk.2.attn_v.weight = #stream.parameter.named<"model"::"blk.2.attn_v.weight"> : tensor<128x256xf32>
  util.global private @__auto.blk.2.attn_output.weight = #stream.parameter.named<"model"::"blk.2.attn_output.weight"> : tensor<256x256xf32>
  util.global private @__auto.blk.2.ffn_norm.weight = #stream.parameter.named<"model"::"blk.2.ffn_norm.weight"> : tensor<256xf32>
  util.global private @__auto.blk.2.ffn_gate.weight = #stream.parameter.named<"model"::"blk.2.ffn_gate.weight"> : tensor<23x256xf32>
  util.global private @__auto.blk.2.ffn_up.weight = #stream.parameter.named<"model"::"blk.2.ffn_up.weight"> : tensor<23x256xf32>
  util.global private @__auto.blk.2.ffn_down.weight = #stream.parameter.named<"model"::"blk.2.ffn_down.weight"> : tensor<256x23xf32>
  util.global private @__auto.output_norm.weight = #stream.parameter.named<"model"::"output_norm.weight"> : tensor<1x256xf32>
  util.global private @__auto.output.weight = #stream.parameter.named<"model"::"output.weight"> : tensor<256x256xf32>
  func.func @prefill_bs1(%arg0: !torch.vtensor<[1,?],si64>, %arg1: !torch.vtensor<[1],si64>, %arg2: !torch.vtensor<[1,?],si64>, %arg3: !torch.tensor<[?,12288],f16>) -> !torch.vtensor<[1,?,256],f16> attributes {torch.assume_strict_symbolic_shapes} {
    %__auto.token_embd.weight = util.global.load @__auto.token_embd.weight : tensor<256x256xf32>
    %0 = torch_c.from_builtin_tensor %__auto.token_embd.weight : tensor<256x256xf32> -> !torch.vtensor<[256,256],f32>
    %__auto.blk.0.attn_norm.weight = util.global.load @__auto.blk.0.attn_norm.weight : tensor<256xf32>
    %1 = torch_c.from_builtin_tensor %__auto.blk.0.attn_norm.weight : tensor<256xf32> -> !torch.vtensor<[256],f32>
    %__auto.blk.0.attn_q.weight = util.global.load @__auto.blk.0.attn_q.weight : tensor<256x256xf32>
    %2 = torch_c.from_builtin_tensor %__auto.blk.0.attn_q.weight : tensor<256x256xf32> -> !torch.vtensor<[256,256],f32>
    %__auto.blk.0.attn_k.weight = util.global.load @__auto.blk.0.attn_k.weight : tensor<128x256xf32>
    %3 = torch_c.from_builtin_tensor %__auto.blk.0.attn_k.weight : tensor<128x256xf32> -> !torch.vtensor<[128,256],f32>
    %__auto.blk.0.attn_v.weight = util.global.load @__auto.blk.0.attn_v.weight : tensor<128x256xf32>
    %4 = torch_c.from_builtin_tensor %__auto.blk.0.attn_v.weight : tensor<128x256xf32> -> !torch.vtensor<[128,256],f32>
    %__auto.blk.0.attn_output.weight = util.global.load @__auto.blk.0.attn_output.weight : tensor<256x256xf32>
    %5 = torch_c.from_builtin_tensor %__auto.blk.0.attn_output.weight : tensor<256x256xf32> -> !torch.vtensor<[256,256],f32>
    %__auto.blk.0.ffn_norm.weight = util.global.load @__auto.blk.0.ffn_norm.weight : tensor<256xf32>
    %6 = torch_c.from_builtin_tensor %__auto.blk.0.ffn_norm.weight : tensor<256xf32> -> !torch.vtensor<[256],f32>
    %__auto.blk.0.ffn_gate.weight = util.global.load @__auto.blk.0.ffn_gate.weight : tensor<23x256xf32>
    %7 = torch_c.from_builtin_tensor %__auto.blk.0.ffn_gate.weight : tensor<23x256xf32> -> !torch.vtensor<[23,256],f32>
    %__auto.blk.0.ffn_up.weight = util.global.load @__auto.blk.0.ffn_up.weight : tensor<23x256xf32>
    %8 = torch_c.from_builtin_tensor %__auto.blk.0.ffn_up.weight : tensor<23x256xf32> -> !torch.vtensor<[23,256],f32>
    %__auto.blk.0.ffn_down.weight = util.global.load @__auto.blk.0.ffn_down.weight : tensor<256x23xf32>
    %9 = torch_c.from_builtin_tensor %__auto.blk.0.ffn_down.weight : tensor<256x23xf32> -> !torch.vtensor<[256,23],f32>
    %__auto.blk.1.attn_norm.weight = util.global.load @__auto.blk.1.attn_norm.weight : tensor<256xf32>
    %10 = torch_c.from_builtin_tensor %__auto.blk.1.attn_norm.weight : tensor<256xf32> -> !torch.vtensor<[256],f32>
    %__auto.blk.1.attn_q.weight = util.global.load @__auto.blk.1.attn_q.weight : tensor<256x256xf32>
    %11 = torch_c.from_builtin_tensor %__auto.blk.1.attn_q.weight : tensor<256x256xf32> -> !torch.vtensor<[256,256],f32>
    %__auto.blk.1.attn_k.weight = util.global.load @__auto.blk.1.attn_k.weight : tensor<128x256xf32>
    %12 = torch_c.from_builtin_tensor %__auto.blk.1.attn_k.weight : tensor<128x256xf32> -> !torch.vtensor<[128,256],f32>
    %__auto.blk.1.attn_v.weight = util.global.load @__auto.blk.1.attn_v.weight : tensor<128x256xf32>
    %13 = torch_c.from_builtin_tensor %__auto.blk.1.attn_v.weight : tensor<128x256xf32> -> !torch.vtensor<[128,256],f32>
    %__auto.blk.1.attn_output.weight = util.global.load @__auto.blk.1.attn_output.weight : tensor<256x256xf32>
    %14 = torch_c.from_builtin_tensor %__auto.blk.1.attn_output.weight : tensor<256x256xf32> -> !torch.vtensor<[256,256],f32>
    %__auto.blk.1.ffn_norm.weight = util.global.load @__auto.blk.1.ffn_norm.weight : tensor<256xf32>
    %15 = torch_c.from_builtin_tensor %__auto.blk.1.ffn_norm.weight : tensor<256xf32> -> !torch.vtensor<[256],f32>
    %__auto.blk.1.ffn_gate.weight = util.global.load @__auto.blk.1.ffn_gate.weight : tensor<23x256xf32>
    %16 = torch_c.from_builtin_tensor %__auto.blk.1.ffn_gate.weight : tensor<23x256xf32> -> !torch.vtensor<[23,256],f32>
    %__auto.blk.1.ffn_up.weight = util.global.load @__auto.blk.1.ffn_up.weight : tensor<23x256xf32>
    %17 = torch_c.from_builtin_tensor %__auto.blk.1.ffn_up.weight : tensor<23x256xf32> -> !torch.vtensor<[23,256],f32>
    %__auto.blk.1.ffn_down.weight = util.global.load @__auto.blk.1.ffn_down.weight : tensor<256x23xf32>
    %18 = torch_c.from_builtin_tensor %__auto.blk.1.ffn_down.weight : tensor<256x23xf32> -> !torch.vtensor<[256,23],f32>
    %__auto.blk.2.attn_norm.weight = util.global.load @__auto.blk.2.attn_norm.weight : tensor<256xf32>
    %19 = torch_c.from_builtin_tensor %__auto.blk.2.attn_norm.weight : tensor<256xf32> -> !torch.vtensor<[256],f32>
    %__auto.blk.2.attn_q.weight = util.global.load @__auto.blk.2.attn_q.weight : tensor<256x256xf32>
    %20 = torch_c.from_builtin_tensor %__auto.blk.2.attn_q.weight : tensor<256x256xf32> -> !torch.vtensor<[256,256],f32>
    %__auto.blk.2.attn_k.weight = util.global.load @__auto.blk.2.attn_k.weight : tensor<128x256xf32>
    %21 = torch_c.from_builtin_tensor %__auto.blk.2.attn_k.weight : tensor<128x256xf32> -> !torch.vtensor<[128,256],f32>
    %__auto.blk.2.attn_v.weight = util.global.load @__auto.blk.2.attn_v.weight : tensor<128x256xf32>
    %22 = torch_c.from_builtin_tensor %__auto.blk.2.attn_v.weight : tensor<128x256xf32> -> !torch.vtensor<[128,256],f32>
    %__auto.blk.2.attn_output.weight = util.global.load @__auto.blk.2.attn_output.weight : tensor<256x256xf32>
    %23 = torch_c.from_builtin_tensor %__auto.blk.2.attn_output.weight : tensor<256x256xf32> -> !torch.vtensor<[256,256],f32>
    %__auto.blk.2.ffn_norm.weight = util.global.load @__auto.blk.2.ffn_norm.weight : tensor<256xf32>
    %24 = torch_c.from_builtin_tensor %__auto.blk.2.ffn_norm.weight : tensor<256xf32> -> !torch.vtensor<[256],f32>
    %__auto.blk.2.ffn_gate.weight = util.global.load @__auto.blk.2.ffn_gate.weight : tensor<23x256xf32>
    %25 = torch_c.from_builtin_tensor %__auto.blk.2.ffn_gate.weight : tensor<23x256xf32> -> !torch.vtensor<[23,256],f32>
    %__auto.blk.2.ffn_up.weight = util.global.load @__auto.blk.2.ffn_up.weight : tensor<23x256xf32>
    %26 = torch_c.from_builtin_tensor %__auto.blk.2.ffn_up.weight : tensor<23x256xf32> -> !torch.vtensor<[23,256],f32>
    %__auto.blk.2.ffn_down.weight = util.global.load @__auto.blk.2.ffn_down.weight : tensor<256x23xf32>
    %27 = torch_c.from_builtin_tensor %__auto.blk.2.ffn_down.weight : tensor<256x23xf32> -> !torch.vtensor<[256,23],f32>
    %__auto.output_norm.weight = util.global.load @__auto.output_norm.weight : tensor<1x256xf32>
    %28 = torch_c.from_builtin_tensor %__auto.output_norm.weight : tensor<1x256xf32> -> !torch.vtensor<[1,256],f32>
    %__auto.output.weight = util.global.load @__auto.output.weight : tensor<256x256xf32>
    %29 = torch_c.from_builtin_tensor %__auto.output.weight : tensor<256x256xf32> -> !torch.vtensor<[256,256],f32>
    %30 = torch.copy.to_vtensor %arg3 : !torch.vtensor<[?,12288],f16>
    %31 = torch.symbolic_int "16*s1" {min_val = 32, max_val = 112} : !torch.int
    %32 = torch.symbolic_int "s1" {min_val = 2, max_val = 7} : !torch.int
    %33 = torch.symbolic_int "s2" {min_val = 0, max_val = 9223372036854775807} : !torch.int
    torch.bind_symbolic_shape %arg0, [%32], affine_map<()[s0] -> (1, s0 * 16)> : !torch.vtensor<[1,?],si64>
    torch.bind_symbolic_shape %arg2, [%32], affine_map<()[s0] -> (1, s0)> : !torch.vtensor<[1,?],si64>
    torch.bind_symbolic_shape %30, [%33], affine_map<()[s0] -> (s0, 12288)> : !torch.vtensor<[?,12288],f16>
    %int1 = torch.constant.int 1
    %34 = torch.aten.size.int %arg2, %int1 : !torch.vtensor<[1,?],si64>, !torch.int -> !torch.int
    %int0 = torch.constant.int 0
    %35 = torch.aten.size.int %30, %int0 : !torch.vtensor<[?,12288],f16>, !torch.int -> !torch.int
    %int1_0 = torch.constant.int 1
    %36 = torch.aten.size.int %arg0, %int1_0 : !torch.vtensor<[1,?],si64>, !torch.int -> !torch.int
    %int0_1 = torch.constant.int 0
    %int1_2 = torch.constant.int 1
    %none = torch.constant.none
    %none_3 = torch.constant.none
    %cpu = torch.constant.device "cpu"
    %false = torch.constant.bool false
    %37 = torch.aten.arange.start_step %int0_1, %36, %int1_2, %none, %none_3, %cpu, %false : !torch.int, !torch.int, !torch.int, !torch.none, !torch.none, !torch.Device, !torch.bool -> !torch.vtensor<[?],si64>
    torch.bind_symbolic_shape %37, [%32], affine_map<()[s0] -> (s0 * 16)> : !torch.vtensor<[?],si64>
    %int-1 = torch.constant.int -1
    %38 = torch.aten.unsqueeze %arg1, %int-1 : !torch.vtensor<[1],si64>, !torch.int -> !torch.vtensor<[1,1],si64>
    %39 = torch.aten.ge.Tensor %37, %38 : !torch.vtensor<[?],si64>, !torch.vtensor<[1,1],si64> -> !torch.vtensor<[1,?],i1>
    torch.bind_symbolic_shape %39, [%32], affine_map<()[s0] -> (1, s0 * 16)> : !torch.vtensor<[1,?],i1>
    %int1_4 = torch.constant.int 1
    %int1_5 = torch.constant.int 1
    %40 = torch.prim.ListConstruct %int1_4, %int1_5 : (!torch.int, !torch.int) -> !torch.list<int>
    %int11 = torch.constant.int 11
    %none_6 = torch.constant.none
    %cpu_7 = torch.constant.device "cpu"
    %false_8 = torch.constant.bool false
    %41 = torch.aten.ones %40, %int11, %none_6, %cpu_7, %false_8 : !torch.list<int>, !torch.int, !torch.none, !torch.Device, !torch.bool -> !torch.vtensor<[1,1],i1>
    %int128 = torch.constant.int 128
    %int128_9 = torch.constant.int 128
    %42 = torch.prim.ListConstruct %int128, %int128_9 : (!torch.int, !torch.int) -> !torch.list<int>
    %false_10 = torch.constant.bool false
    %43 = torch.aten.expand %41, %42, %false_10 : !torch.vtensor<[1,1],i1>, !torch.list<int>, !torch.bool -> !torch.vtensor<[128,128],i1>
    %int1_11 = torch.constant.int 1
    %44 = torch.aten.triu %43, %int1_11 : !torch.vtensor<[128,128],i1>, !torch.int -> !torch.vtensor<[128,128],i1>
    %int0_12 = torch.constant.int 0
    %45 = torch.aten.unsqueeze %44, %int0_12 : !torch.vtensor<[128,128],i1>, !torch.int -> !torch.vtensor<[1,128,128],i1>
    %int1_13 = torch.constant.int 1
    %46 = torch.aten.unsqueeze %45, %int1_13 : !torch.vtensor<[1,128,128],i1>, !torch.int -> !torch.vtensor<[1,1,128,128],i1>
    %int2 = torch.constant.int 2
    %int0_14 = torch.constant.int 0
    %int9223372036854775807 = torch.constant.int 9223372036854775807
    %int1_15 = torch.constant.int 1
    %47 = torch.aten.slice.Tensor %46, %int2, %int0_14, %int9223372036854775807, %int1_15 : !torch.vtensor<[1,1,128,128],i1>, !torch.int, !torch.int, !torch.int, !torch.int -> !torch.vtensor<[1,1,128,128],i1>
    %int3 = torch.constant.int 3
    %int0_16 = torch.constant.int 0
    %int9223372036854775807_17 = torch.constant.int 9223372036854775807
    %int1_18 = torch.constant.int 1
    %48 = torch.aten.slice.Tensor %47, %int3, %int0_16, %int9223372036854775807_17, %int1_18 : !torch.vtensor<[1,1,128,128],i1>, !torch.int, !torch.int, !torch.int, !torch.int -> !torch.vtensor<[1,1,128,128],i1>
    %int0_19 = torch.constant.int 0
    %int0_20 = torch.constant.int 0
    %int9223372036854775807_21 = torch.constant.int 9223372036854775807
    %int1_22 = torch.constant.int 1
    %49 = torch.aten.slice.Tensor %48, %int0_19, %int0_20, %int9223372036854775807_21, %int1_22 : !torch.vtensor<[1,1,128,128],i1>, !torch.int, !torch.int, !torch.int, !torch.int -> !torch.vtensor<[1,1,128,128],i1>
    %int1_23 = torch.constant.int 1
    %int0_24 = torch.constant.int 0
    %int9223372036854775807_25 = torch.constant.int 9223372036854775807
    %int1_26 = torch.constant.int 1
    %50 = torch.aten.slice.Tensor %49, %int1_23, %int0_24, %int9223372036854775807_25, %int1_26 : !torch.vtensor<[1,1,128,128],i1>, !torch.int, !torch.int, !torch.int, !torch.int -> !torch.vtensor<[1,1,128,128],i1>
    %int2_27 = torch.constant.int 2
    %int0_28 = torch.constant.int 0
    %int1_29 = torch.constant.int 1
    %51 = torch.aten.slice.Tensor %50, %int2_27, %int0_28, %36, %int1_29 : !torch.vtensor<[1,1,128,128],i1>, !torch.int, !torch.int, !torch.int, !torch.int -> !torch.vtensor<[1,1,?,128],i1>
    torch.bind_symbolic_shape %51, [%32], affine_map<()[s0] -> (1, 1, s0 * 16, 128)> : !torch.vtensor<[1,1,?,128],i1>
    %int3_30 = torch.constant.int 3
    %int0_31 = torch.constant.int 0
    %int1_32 = torch.constant.int 1
    %52 = torch.aten.slice.Tensor %51, %int3_30, %int0_31, %36, %int1_32 : !torch.vtensor<[1,1,?,128],i1>, !torch.int, !torch.int, !torch.int, !torch.int -> !torch.vtensor<[1,1,?,?],i1>
    torch.bind_symbolic_shape %52, [%32], affine_map<()[s0] -> (1, 1, s0 * 16, s0 * 16)> : !torch.vtensor<[1,1,?,?],i1>
    %int0_33 = torch.constant.int 0
    %int0_34 = torch.constant.int 0
    %int9223372036854775807_35 = torch.constant.int 9223372036854775807
    %int1_36 = torch.constant.int 1
    %53 = torch.aten.slice.Tensor %39, %int0_33, %int0_34, %int9223372036854775807_35, %int1_36 : !torch.vtensor<[1,?],i1>, !torch.int, !torch.int, !torch.int, !torch.int -> !torch.vtensor<[1,?],i1>
    torch.bind_symbolic_shape %53, [%32], affine_map<()[s0] -> (1, s0 * 16)> : !torch.vtensor<[1,?],i1>
    %int1_37 = torch.constant.int 1
    %54 = torch.aten.unsqueeze %53, %int1_37 : !torch.vtensor<[1,?],i1>, !torch.int -> !torch.vtensor<[1,1,?],i1>
    torch.bind_symbolic_shape %54, [%32], affine_map<()[s0] -> (1, 1, s0 * 16)> : !torch.vtensor<[1,1,?],i1>
    %int2_38 = torch.constant.int 2
    %55 = torch.aten.unsqueeze %54, %int2_38 : !torch.vtensor<[1,1,?],i1>, !torch.int -> !torch.vtensor<[1,1,1,?],i1>
    torch.bind_symbolic_shape %55, [%32], affine_map<()[s0] -> (1, 1, 1, s0 * 16)> : !torch.vtensor<[1,1,1,?],i1>
    %int3_39 = torch.constant.int 3
    %int0_40 = torch.constant.int 0
    %int9223372036854775807_41 = torch.constant.int 9223372036854775807
    %int1_42 = torch.constant.int 1
    %56 = torch.aten.slice.Tensor %55, %int3_39, %int0_40, %int9223372036854775807_41, %int1_42 : !torch.vtensor<[1,1,1,?],i1>, !torch.int, !torch.int, !torch.int, !torch.int -> !torch.vtensor<[1,1,1,?],i1>
    torch.bind_symbolic_shape %56, [%32], affine_map<()[s0] -> (1, 1, 1, s0 * 16)> : !torch.vtensor<[1,1,1,?],i1>
    %57 = torch.aten.logical_or %52, %56 : !torch.vtensor<[1,1,?,?],i1>, !torch.vtensor<[1,1,1,?],i1> -> !torch.vtensor<[1,1,?,?],i1>
    torch.bind_symbolic_shape %57, [%32], affine_map<()[s0] -> (1, 1, s0 * 16, s0 * 16)> : !torch.vtensor<[1,1,?,?],i1>
    %int0_43 = torch.constant.int 0
    %int6 = torch.constant.int 6
    %int0_44 = torch.constant.int 0
    %cpu_45 = torch.constant.device "cpu"
    %none_46 = torch.constant.none
    %58 = torch.aten.scalar_tensor %int0_43, %int6, %int0_44, %cpu_45, %none_46 : !torch.int, !torch.int, !torch.int, !torch.Device, !torch.none -> !torch.vtensor<[],f32>
    %float-Inf = torch.constant.float 0xFFF0000000000000
    %int6_47 = torch.constant.int 6
    %int0_48 = torch.constant.int 0
    %cpu_49 = torch.constant.device "cpu"
    %none_50 = torch.constant.none
    %59 = torch.aten.scalar_tensor %float-Inf, %int6_47, %int0_48, %cpu_49, %none_50 : !torch.float, !torch.int, !torch.int, !torch.Device, !torch.none -> !torch.vtensor<[],f32>
    %60 = torch.aten.where.self %57, %59, %58 : !torch.vtensor<[1,1,?,?],i1>, !torch.vtensor<[],f32>, !torch.vtensor<[],f32> -> !torch.vtensor<[1,1,?,?],f32>
    torch.bind_symbolic_shape %60, [%32], affine_map<()[s0] -> (1, 1, s0 * 16, s0 * 16)> : !torch.vtensor<[1,1,?,?],f32>
    %int5 = torch.constant.int 5
    %61 = torch.prims.convert_element_type %60, %int5 : !torch.vtensor<[1,1,?,?],f32>, !torch.int -> !torch.vtensor<[1,1,?,?],f16>
    torch.bind_symbolic_shape %61, [%32], affine_map<()[s0] -> (1, 1, s0 * 16, s0 * 16)> : !torch.vtensor<[1,1,?,?],f16>
    %int5_51 = torch.constant.int 5
    %62 = torch.prims.convert_element_type %61, %int5_51 : !torch.vtensor<[1,1,?,?],f16>, !torch.int -> !torch.vtensor<[1,1,?,?],f16>
    torch.bind_symbolic_shape %62, [%32], affine_map<()[s0] -> (1, 1, s0 * 16, s0 * 16)> : !torch.vtensor<[1,1,?,?],f16>
    %int5_52 = torch.constant.int 5
    %63 = torch.prims.convert_element_type %0, %int5_52 : !torch.vtensor<[256,256],f32>, !torch.int -> !torch.vtensor<[256,256],f16>
    %int-1_53 = torch.constant.int -1
    %false_54 = torch.constant.bool false
    %false_55 = torch.constant.bool false
    %64 = torch.aten.embedding %63, %arg0, %int-1_53, %false_54, %false_55 : !torch.vtensor<[256,256],f16>, !torch.vtensor<[1,?],si64>, !torch.int, !torch.bool, !torch.bool -> !torch.vtensor<[1,?,256],f16>
    torch.bind_symbolic_shape %64, [%32], affine_map<()[s0] -> (1, s0 * 16, 256)> : !torch.vtensor<[1,?,256],f16>
    %int6_56 = torch.constant.int 6
    %65 = torch.prims.convert_element_type %64, %int6_56 : !torch.vtensor<[1,?,256],f16>, !torch.int -> !torch.vtensor<[1,?,256],f32>
    torch.bind_symbolic_shape %65, [%32], affine_map<()[s0] -> (1, s0 * 16, 256)> : !torch.vtensor<[1,?,256],f32>
    %int2_57 = torch.constant.int 2
    %66 = torch.aten.pow.Tensor_Scalar %65, %int2_57 : !torch.vtensor<[1,?,256],f32>, !torch.int -> !torch.vtensor<[1,?,256],f32>
    torch.bind_symbolic_shape %66, [%32], affine_map<()[s0] -> (1, s0 * 16, 256)> : !torch.vtensor<[1,?,256],f32>
    %int-1_58 = torch.constant.int -1
    %67 = torch.prim.ListConstruct %int-1_58 : (!torch.int) -> !torch.list<int>
    %true = torch.constant.bool true
    %none_59 = torch.constant.none
    %68 = torch.aten.mean.dim %66, %67, %true, %none_59 : !torch.vtensor<[1,?,256],f32>, !torch.list<int>, !torch.bool, !torch.none -> !torch.vtensor<[1,?,1],f32>
    torch.bind_symbolic_shape %68, [%32], affine_map<()[s0] -> (1, s0 * 16, 1)> : !torch.vtensor<[1,?,1],f32>
    %float1.000000e-02 = torch.constant.float 1.000000e-02
    %int1_60 = torch.constant.int 1
    %69 = torch.aten.add.Scalar %68, %float1.000000e-02, %int1_60 : !torch.vtensor<[1,?,1],f32>, !torch.float, !torch.int -> !torch.vtensor<[1,?,1],f32>
    torch.bind_symbolic_shape %69, [%32], affine_map<()[s0] -> (1, s0 * 16, 1)> : !torch.vtensor<[1,?,1],f32>
    %70 = torch.aten.rsqrt %69 : !torch.vtensor<[1,?,1],f32> -> !torch.vtensor<[1,?,1],f32>
    torch.bind_symbolic_shape %70, [%32], affine_map<()[s0] -> (1, s0 * 16, 1)> : !torch.vtensor<[1,?,1],f32>
    %71 = torch.aten.mul.Tensor %65, %70 : !torch.vtensor<[1,?,256],f32>, !torch.vtensor<[1,?,1],f32> -> !torch.vtensor<[1,?,256],f32>
    torch.bind_symbolic_shape %71, [%32], affine_map<()[s0] -> (1, s0 * 16, 256)> : !torch.vtensor<[1,?,256],f32>
    %int6_61 = torch.constant.int 6
    %72 = torch.prims.convert_element_type %71, %int6_61 : !torch.vtensor<[1,?,256],f32>, !torch.int -> !torch.vtensor<[1,?,256],f32>
    torch.bind_symbolic_shape %72, [%32], affine_map<()[s0] -> (1, s0 * 16, 256)> : !torch.vtensor<[1,?,256],f32>
    %73 = torch.aten.mul.Tensor %1, %72 : !torch.vtensor<[256],f32>, !torch.vtensor<[1,?,256],f32> -> !torch.vtensor<[1,?,256],f32>
    torch.bind_symbolic_shape %73, [%32], affine_map<()[s0] -> (1, s0 * 16, 256)> : !torch.vtensor<[1,?,256],f32>
    %int5_62 = torch.constant.int 5
    %74 = torch.prims.convert_element_type %73, %int5_62 : !torch.vtensor<[1,?,256],f32>, !torch.int -> !torch.vtensor<[1,?,256],f16>
    torch.bind_symbolic_shape %74, [%32], affine_map<()[s0] -> (1, s0 * 16, 256)> : !torch.vtensor<[1,?,256],f16>
    %int5_63 = torch.constant.int 5
    %75 = torch.prims.convert_element_type %2, %int5_63 : !torch.vtensor<[256,256],f32>, !torch.int -> !torch.vtensor<[256,256],f16>
    %int-2 = torch.constant.int -2
    %int-1_64 = torch.constant.int -1
    %76 = torch.aten.transpose.int %75, %int-2, %int-1_64 : !torch.vtensor<[256,256],f16>, !torch.int, !torch.int -> !torch.vtensor<[256,256],f16>
    %int5_65 = torch.constant.int 5
    %77 = torch.prims.convert_element_type %76, %int5_65 : !torch.vtensor<[256,256],f16>, !torch.int -> !torch.vtensor<[256,256],f16>
    %int256 = torch.constant.int 256
    %78 = torch.prim.ListConstruct %36, %int256 : (!torch.int, !torch.int) -> !torch.list<int>
    %79 = torch.aten.view %74, %78 : !torch.vtensor<[1,?,256],f16>, !torch.list<int> -> !torch.vtensor<[?,256],f16>
    torch.bind_symbolic_shape %79, [%32], affine_map<()[s0] -> (s0 * 16, 256)> : !torch.vtensor<[?,256],f16>
    %80 = torch.aten.mm %79, %77 : !torch.vtensor<[?,256],f16>, !torch.vtensor<[256,256],f16> -> !torch.vtensor<[?,256],f16>
    torch.bind_symbolic_shape %80, [%32], affine_map<()[s0] -> (s0 * 16, 256)> : !torch.vtensor<[?,256],f16>
    %int1_66 = torch.constant.int 1
    %int256_67 = torch.constant.int 256
    %81 = torch.prim.ListConstruct %int1_66, %36, %int256_67 : (!torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %82 = torch.aten.view %80, %81 : !torch.vtensor<[?,256],f16>, !torch.list<int> -> !torch.vtensor<[1,?,256],f16>
    torch.bind_symbolic_shape %82, [%32], affine_map<()[s0] -> (1, s0 * 16, 256)> : !torch.vtensor<[1,?,256],f16>
    %int5_68 = torch.constant.int 5
    %83 = torch.prims.convert_element_type %3, %int5_68 : !torch.vtensor<[128,256],f32>, !torch.int -> !torch.vtensor<[128,256],f16>
    %int-2_69 = torch.constant.int -2
    %int-1_70 = torch.constant.int -1
    %84 = torch.aten.transpose.int %83, %int-2_69, %int-1_70 : !torch.vtensor<[128,256],f16>, !torch.int, !torch.int -> !torch.vtensor<[256,128],f16>
    %int5_71 = torch.constant.int 5
    %85 = torch.prims.convert_element_type %84, %int5_71 : !torch.vtensor<[256,128],f16>, !torch.int -> !torch.vtensor<[256,128],f16>
    %int256_72 = torch.constant.int 256
    %86 = torch.prim.ListConstruct %36, %int256_72 : (!torch.int, !torch.int) -> !torch.list<int>
    %87 = torch.aten.view %74, %86 : !torch.vtensor<[1,?,256],f16>, !torch.list<int> -> !torch.vtensor<[?,256],f16>
    torch.bind_symbolic_shape %87, [%32], affine_map<()[s0] -> (s0 * 16, 256)> : !torch.vtensor<[?,256],f16>
    %88 = torch.aten.mm %87, %85 : !torch.vtensor<[?,256],f16>, !torch.vtensor<[256,128],f16> -> !torch.vtensor<[?,128],f16>
    torch.bind_symbolic_shape %88, [%32], affine_map<()[s0] -> (s0 * 16, 128)> : !torch.vtensor<[?,128],f16>
    %int1_73 = torch.constant.int 1
    %int128_74 = torch.constant.int 128
    %89 = torch.prim.ListConstruct %int1_73, %36, %int128_74 : (!torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %90 = torch.aten.view %88, %89 : !torch.vtensor<[?,128],f16>, !torch.list<int> -> !torch.vtensor<[1,?,128],f16>
    torch.bind_symbolic_shape %90, [%32], affine_map<()[s0] -> (1, s0 * 16, 128)> : !torch.vtensor<[1,?,128],f16>
    %int5_75 = torch.constant.int 5
    %91 = torch.prims.convert_element_type %4, %int5_75 : !torch.vtensor<[128,256],f32>, !torch.int -> !torch.vtensor<[128,256],f16>
    %int-2_76 = torch.constant.int -2
    %int-1_77 = torch.constant.int -1
    %92 = torch.aten.transpose.int %91, %int-2_76, %int-1_77 : !torch.vtensor<[128,256],f16>, !torch.int, !torch.int -> !torch.vtensor<[256,128],f16>
    %int5_78 = torch.constant.int 5
    %93 = torch.prims.convert_element_type %92, %int5_78 : !torch.vtensor<[256,128],f16>, !torch.int -> !torch.vtensor<[256,128],f16>
    %int256_79 = torch.constant.int 256
    %94 = torch.prim.ListConstruct %36, %int256_79 : (!torch.int, !torch.int) -> !torch.list<int>
    %95 = torch.aten.view %74, %94 : !torch.vtensor<[1,?,256],f16>, !torch.list<int> -> !torch.vtensor<[?,256],f16>
    torch.bind_symbolic_shape %95, [%32], affine_map<()[s0] -> (s0 * 16, 256)> : !torch.vtensor<[?,256],f16>
    %96 = torch.aten.mm %95, %93 : !torch.vtensor<[?,256],f16>, !torch.vtensor<[256,128],f16> -> !torch.vtensor<[?,128],f16>
    torch.bind_symbolic_shape %96, [%32], affine_map<()[s0] -> (s0 * 16, 128)> : !torch.vtensor<[?,128],f16>
    %int1_80 = torch.constant.int 1
    %int128_81 = torch.constant.int 128
    %97 = torch.prim.ListConstruct %int1_80, %36, %int128_81 : (!torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %98 = torch.aten.view %96, %97 : !torch.vtensor<[?,128],f16>, !torch.list<int> -> !torch.vtensor<[1,?,128],f16>
    torch.bind_symbolic_shape %98, [%32], affine_map<()[s0] -> (1, s0 * 16, 128)> : !torch.vtensor<[1,?,128],f16>
    %int1_82 = torch.constant.int 1
    %int8 = torch.constant.int 8
    %int32 = torch.constant.int 32
    %99 = torch.prim.ListConstruct %int1_82, %36, %int8, %int32 : (!torch.int, !torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %100 = torch.aten.view %82, %99 : !torch.vtensor<[1,?,256],f16>, !torch.list<int> -> !torch.vtensor<[1,?,8,32],f16>
    torch.bind_symbolic_shape %100, [%32], affine_map<()[s0] -> (1, s0 * 16, 8, 32)> : !torch.vtensor<[1,?,8,32],f16>
    %int1_83 = torch.constant.int 1
    %int4 = torch.constant.int 4
    %int32_84 = torch.constant.int 32
    %101 = torch.prim.ListConstruct %int1_83, %36, %int4, %int32_84 : (!torch.int, !torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %102 = torch.aten.view %90, %101 : !torch.vtensor<[1,?,128],f16>, !torch.list<int> -> !torch.vtensor<[1,?,4,32],f16>
    torch.bind_symbolic_shape %102, [%32], affine_map<()[s0] -> (1, s0 * 16, 4, 32)> : !torch.vtensor<[1,?,4,32],f16>
    %int1_85 = torch.constant.int 1
    %int4_86 = torch.constant.int 4
    %int32_87 = torch.constant.int 32
    %103 = torch.prim.ListConstruct %int1_85, %36, %int4_86, %int32_87 : (!torch.int, !torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %104 = torch.aten.view %98, %103 : !torch.vtensor<[1,?,128],f16>, !torch.list<int> -> !torch.vtensor<[1,?,4,32],f16>
    torch.bind_symbolic_shape %104, [%32], affine_map<()[s0] -> (1, s0 * 16, 4, 32)> : !torch.vtensor<[1,?,4,32],f16>
    %int128_88 = torch.constant.int 128
    %none_89 = torch.constant.none
    %none_90 = torch.constant.none
    %cpu_91 = torch.constant.device "cpu"
    %false_92 = torch.constant.bool false
    %105 = torch.aten.arange %int128_88, %none_89, %none_90, %cpu_91, %false_92 : !torch.int, !torch.none, !torch.none, !torch.Device, !torch.bool -> !torch.vtensor<[128],si64>
    %int0_93 = torch.constant.int 0
    %int32_94 = torch.constant.int 32
    %int2_95 = torch.constant.int 2
    %none_96 = torch.constant.none
    %none_97 = torch.constant.none
    %cpu_98 = torch.constant.device "cpu"
    %false_99 = torch.constant.bool false
    %106 = torch.aten.arange.start_step %int0_93, %int32_94, %int2_95, %none_96, %none_97, %cpu_98, %false_99 : !torch.int, !torch.int, !torch.int, !torch.none, !torch.none, !torch.Device, !torch.bool -> !torch.vtensor<[16],si64>
    %int0_100 = torch.constant.int 0
    %int0_101 = torch.constant.int 0
    %int16 = torch.constant.int 16
    %int1_102 = torch.constant.int 1
    %107 = torch.aten.slice.Tensor %106, %int0_100, %int0_101, %int16, %int1_102 : !torch.vtensor<[16],si64>, !torch.int, !torch.int, !torch.int, !torch.int -> !torch.vtensor<[16],si64>
    %int6_103 = torch.constant.int 6
    %108 = torch.prims.convert_element_type %107, %int6_103 : !torch.vtensor<[16],si64>, !torch.int -> !torch.vtensor<[16],f32>
    %int32_104 = torch.constant.int 32
    %109 = torch.aten.div.Scalar %108, %int32_104 : !torch.vtensor<[16],f32>, !torch.int -> !torch.vtensor<[16],f32>
    %float5.000000e05 = torch.constant.float 5.000000e+05
    %110 = torch.aten.pow.Scalar %float5.000000e05, %109 : !torch.float, !torch.vtensor<[16],f32> -> !torch.vtensor<[16],f32>
    %111 = torch.aten.reciprocal %110 : !torch.vtensor<[16],f32> -> !torch.vtensor<[16],f32>
    %float1.000000e00 = torch.constant.float 1.000000e+00
    %112 = torch.aten.mul.Scalar %111, %float1.000000e00 : !torch.vtensor<[16],f32>, !torch.float -> !torch.vtensor<[16],f32>
    %int128_105 = torch.constant.int 128
    %int1_106 = torch.constant.int 1
    %113 = torch.prim.ListConstruct %int128_105, %int1_106 : (!torch.int, !torch.int) -> !torch.list<int>
    %114 = torch.aten.view %105, %113 : !torch.vtensor<[128],si64>, !torch.list<int> -> !torch.vtensor<[128,1],si64>
    %115 = torch.aten.mul.Tensor %114, %112 : !torch.vtensor<[128,1],si64>, !torch.vtensor<[16],f32> -> !torch.vtensor<[128,16],f32>
    %int6_107 = torch.constant.int 6
    %116 = torch.prims.convert_element_type %115, %int6_107 : !torch.vtensor<[128,16],f32>, !torch.int -> !torch.vtensor<[128,16],f32>
    %117 = torch.aten.cos %116 : !torch.vtensor<[128,16],f32> -> !torch.vtensor<[128,16],f32>
    %118 = torch.aten.sin %116 : !torch.vtensor<[128,16],f32> -> !torch.vtensor<[128,16],f32>
    %119 = torch.aten.complex %117, %118 : !torch.vtensor<[128,16],f32>, !torch.vtensor<[128,16],f32> -> !torch.vtensor<[128,16],complex<f32>>
    %int0_108 = torch.constant.int 0
    %int0_109 = torch.constant.int 0
    %int1_110 = torch.constant.int 1
    %120 = torch.aten.slice.Tensor %119, %int0_108, %int0_109, %36, %int1_110 : !torch.vtensor<[128,16],complex<f32>>, !torch.int, !torch.int, !torch.int, !torch.int -> !torch.vtensor<[?,16],complex<f32>>
    torch.bind_symbolic_shape %120, [%32], affine_map<()[s0] -> (s0 * 16, 16)> : !torch.vtensor<[?,16],complex<f32>>
    %int1_111 = torch.constant.int 1
    %int0_112 = torch.constant.int 0
    %int9223372036854775807_113 = torch.constant.int 9223372036854775807
    %int1_114 = torch.constant.int 1
    %121 = torch.aten.slice.Tensor %120, %int1_111, %int0_112, %int9223372036854775807_113, %int1_114 : !torch.vtensor<[?,16],complex<f32>>, !torch.int, !torch.int, !torch.int, !torch.int -> !torch.vtensor<[?,16],complex<f32>>
    torch.bind_symbolic_shape %121, [%32], affine_map<()[s0] -> (s0 * 16, 16)> : !torch.vtensor<[?,16],complex<f32>>
    %int0_115 = torch.constant.int 0
    %122 = torch.aten.unsqueeze %121, %int0_115 : !torch.vtensor<[?,16],complex<f32>>, !torch.int -> !torch.vtensor<[1,?,16],complex<f32>>
    torch.bind_symbolic_shape %122, [%32], affine_map<()[s0] -> (1, s0 * 16, 16)> : !torch.vtensor<[1,?,16],complex<f32>>
    %int2_116 = torch.constant.int 2
    %123 = torch.aten.unsqueeze %122, %int2_116 : !torch.vtensor<[1,?,16],complex<f32>>, !torch.int -> !torch.vtensor<[1,?,1,16],complex<f32>>
    torch.bind_symbolic_shape %123, [%32], affine_map<()[s0] -> (1, s0 * 16, 1, 16)> : !torch.vtensor<[1,?,1,16],complex<f32>>
    %int3_117 = torch.constant.int 3
    %int0_118 = torch.constant.int 0
    %int9223372036854775807_119 = torch.constant.int 9223372036854775807
    %int1_120 = torch.constant.int 1
    %124 = torch.aten.slice.Tensor %123, %int3_117, %int0_118, %int9223372036854775807_119, %int1_120 : !torch.vtensor<[1,?,1,16],complex<f32>>, !torch.int, !torch.int, !torch.int, !torch.int -> !torch.vtensor<[1,?,1,16],complex<f32>>
    torch.bind_symbolic_shape %124, [%32], affine_map<()[s0] -> (1, s0 * 16, 1, 16)> : !torch.vtensor<[1,?,1,16],complex<f32>>
    %125 = torch_c.to_builtin_tensor %100 : !torch.vtensor<[1,?,8,32],f16> -> tensor<1x?x8x32xf16>
    %c1 = arith.constant 1 : index
    %dim = tensor.dim %125, %c1 : tensor<1x?x8x32xf16>
    %126 = flow.tensor.bitcast %125 : tensor<1x?x8x32xf16>{%dim} -> tensor<1x?x8x16xcomplex<f16>>{%dim}
    %127 = torch_c.from_builtin_tensor %126 : tensor<1x?x8x16xcomplex<f16>> -> !torch.vtensor<[1,?,8,16],complex<f16>>
    torch.bind_symbolic_shape %127, [%32], affine_map<()[s0] -> (1, s0 * 16, 8, 16)> : !torch.vtensor<[1,?,8,16],complex<f16>>
    %128 = torch.aten.mul.Tensor %127, %124 : !torch.vtensor<[1,?,8,16],complex<f16>>, !torch.vtensor<[1,?,1,16],complex<f32>> -> !torch.vtensor<[1,?,8,16],complex<f32>>
    torch.bind_symbolic_shape %128, [%32], affine_map<()[s0] -> (1, s0 * 16, 8, 16)> : !torch.vtensor<[1,?,8,16],complex<f32>>
    %129 = torch_c.to_builtin_tensor %128 : !torch.vtensor<[1,?,8,16],complex<f32>> -> tensor<1x?x8x16xcomplex<f32>>
    %c1_121 = arith.constant 1 : index
    %dim_122 = tensor.dim %129, %c1_121 : tensor<1x?x8x16xcomplex<f32>>
    %130 = flow.tensor.bitcast %129 : tensor<1x?x8x16xcomplex<f32>>{%dim_122} -> tensor<1x?x8x32xf32>{%dim_122}
    %131 = torch_c.from_builtin_tensor %130 : tensor<1x?x8x32xf32> -> !torch.vtensor<[1,?,8,32],f32>
    torch.bind_symbolic_shape %131, [%32], affine_map<()[s0] -> (1, s0 * 16, 8, 32)> : !torch.vtensor<[1,?,8,32],f32>
    %int5_123 = torch.constant.int 5
    %132 = torch.prims.convert_element_type %131, %int5_123 : !torch.vtensor<[1,?,8,32],f32>, !torch.int -> !torch.vtensor<[1,?,8,32],f16>
    torch.bind_symbolic_shape %132, [%32], affine_map<()[s0] -> (1, s0 * 16, 8, 32)> : !torch.vtensor<[1,?,8,32],f16>
    %int128_124 = torch.constant.int 128
    %none_125 = torch.constant.none
    %none_126 = torch.constant.none
    %cpu_127 = torch.constant.device "cpu"
    %false_128 = torch.constant.bool false
    %133 = torch.aten.arange %int128_124, %none_125, %none_126, %cpu_127, %false_128 : !torch.int, !torch.none, !torch.none, !torch.Device, !torch.bool -> !torch.vtensor<[128],si64>
    %int0_129 = torch.constant.int 0
    %int32_130 = torch.constant.int 32
    %int2_131 = torch.constant.int 2
    %none_132 = torch.constant.none
    %none_133 = torch.constant.none
    %cpu_134 = torch.constant.device "cpu"
    %false_135 = torch.constant.bool false
    %134 = torch.aten.arange.start_step %int0_129, %int32_130, %int2_131, %none_132, %none_133, %cpu_134, %false_135 : !torch.int, !torch.int, !torch.int, !torch.none, !torch.none, !torch.Device, !torch.bool -> !torch.vtensor<[16],si64>
    %int0_136 = torch.constant.int 0
    %int0_137 = torch.constant.int 0
    %int16_138 = torch.constant.int 16
    %int1_139 = torch.constant.int 1
    %135 = torch.aten.slice.Tensor %134, %int0_136, %int0_137, %int16_138, %int1_139 : !torch.vtensor<[16],si64>, !torch.int, !torch.int, !torch.int, !torch.int -> !torch.vtensor<[16],si64>
    %int6_140 = torch.constant.int 6
    %136 = torch.prims.convert_element_type %135, %int6_140 : !torch.vtensor<[16],si64>, !torch.int -> !torch.vtensor<[16],f32>
    %int32_141 = torch.constant.int 32
    %137 = torch.aten.div.Scalar %136, %int32_141 : !torch.vtensor<[16],f32>, !torch.int -> !torch.vtensor<[16],f32>
    %float5.000000e05_142 = torch.constant.float 5.000000e+05
    %138 = torch.aten.pow.Scalar %float5.000000e05_142, %137 : !torch.float, !torch.vtensor<[16],f32> -> !torch.vtensor<[16],f32>
    %139 = torch.aten.reciprocal %138 : !torch.vtensor<[16],f32> -> !torch.vtensor<[16],f32>
    %float1.000000e00_143 = torch.constant.float 1.000000e+00
    %140 = torch.aten.mul.Scalar %139, %float1.000000e00_143 : !torch.vtensor<[16],f32>, !torch.float -> !torch.vtensor<[16],f32>
    %int128_144 = torch.constant.int 128
    %int1_145 = torch.constant.int 1
    %141 = torch.prim.ListConstruct %int128_144, %int1_145 : (!torch.int, !torch.int) -> !torch.list<int>
    %142 = torch.aten.view %133, %141 : !torch.vtensor<[128],si64>, !torch.list<int> -> !torch.vtensor<[128,1],si64>
    %143 = torch.aten.mul.Tensor %142, %140 : !torch.vtensor<[128,1],si64>, !torch.vtensor<[16],f32> -> !torch.vtensor<[128,16],f32>
    %int6_146 = torch.constant.int 6
    %144 = torch.prims.convert_element_type %143, %int6_146 : !torch.vtensor<[128,16],f32>, !torch.int -> !torch.vtensor<[128,16],f32>
    %145 = torch.aten.cos %144 : !torch.vtensor<[128,16],f32> -> !torch.vtensor<[128,16],f32>
    %146 = torch.aten.sin %144 : !torch.vtensor<[128,16],f32> -> !torch.vtensor<[128,16],f32>
    %147 = torch.aten.complex %145, %146 : !torch.vtensor<[128,16],f32>, !torch.vtensor<[128,16],f32> -> !torch.vtensor<[128,16],complex<f32>>
    %int0_147 = torch.constant.int 0
    %int0_148 = torch.constant.int 0
    %int1_149 = torch.constant.int 1
    %148 = torch.aten.slice.Tensor %147, %int0_147, %int0_148, %36, %int1_149 : !torch.vtensor<[128,16],complex<f32>>, !torch.int, !torch.int, !torch.int, !torch.int -> !torch.vtensor<[?,16],complex<f32>>
    torch.bind_symbolic_shape %148, [%32], affine_map<()[s0] -> (s0 * 16, 16)> : !torch.vtensor<[?,16],complex<f32>>
    %int1_150 = torch.constant.int 1
    %int0_151 = torch.constant.int 0
    %int9223372036854775807_152 = torch.constant.int 9223372036854775807
    %int1_153 = torch.constant.int 1
    %149 = torch.aten.slice.Tensor %148, %int1_150, %int0_151, %int9223372036854775807_152, %int1_153 : !torch.vtensor<[?,16],complex<f32>>, !torch.int, !torch.int, !torch.int, !torch.int -> !torch.vtensor<[?,16],complex<f32>>
    torch.bind_symbolic_shape %149, [%32], affine_map<()[s0] -> (s0 * 16, 16)> : !torch.vtensor<[?,16],complex<f32>>
    %int0_154 = torch.constant.int 0
    %150 = torch.aten.unsqueeze %149, %int0_154 : !torch.vtensor<[?,16],complex<f32>>, !torch.int -> !torch.vtensor<[1,?,16],complex<f32>>
    torch.bind_symbolic_shape %150, [%32], affine_map<()[s0] -> (1, s0 * 16, 16)> : !torch.vtensor<[1,?,16],complex<f32>>
    %int2_155 = torch.constant.int 2
    %151 = torch.aten.unsqueeze %150, %int2_155 : !torch.vtensor<[1,?,16],complex<f32>>, !torch.int -> !torch.vtensor<[1,?,1,16],complex<f32>>
    torch.bind_symbolic_shape %151, [%32], affine_map<()[s0] -> (1, s0 * 16, 1, 16)> : !torch.vtensor<[1,?,1,16],complex<f32>>
    %int3_156 = torch.constant.int 3
    %int0_157 = torch.constant.int 0
    %int9223372036854775807_158 = torch.constant.int 9223372036854775807
    %int1_159 = torch.constant.int 1
    %152 = torch.aten.slice.Tensor %151, %int3_156, %int0_157, %int9223372036854775807_158, %int1_159 : !torch.vtensor<[1,?,1,16],complex<f32>>, !torch.int, !torch.int, !torch.int, !torch.int -> !torch.vtensor<[1,?,1,16],complex<f32>>
    torch.bind_symbolic_shape %152, [%32], affine_map<()[s0] -> (1, s0 * 16, 1, 16)> : !torch.vtensor<[1,?,1,16],complex<f32>>
    %153 = torch_c.to_builtin_tensor %102 : !torch.vtensor<[1,?,4,32],f16> -> tensor<1x?x4x32xf16>
    %c1_160 = arith.constant 1 : index
    %dim_161 = tensor.dim %153, %c1_160 : tensor<1x?x4x32xf16>
    %154 = flow.tensor.bitcast %153 : tensor<1x?x4x32xf16>{%dim_161} -> tensor<1x?x4x16xcomplex<f16>>{%dim_161}
    %155 = torch_c.from_builtin_tensor %154 : tensor<1x?x4x16xcomplex<f16>> -> !torch.vtensor<[1,?,4,16],complex<f16>>
    torch.bind_symbolic_shape %155, [%32], affine_map<()[s0] -> (1, s0 * 16, 4, 16)> : !torch.vtensor<[1,?,4,16],complex<f16>>
    %156 = torch.aten.mul.Tensor %155, %152 : !torch.vtensor<[1,?,4,16],complex<f16>>, !torch.vtensor<[1,?,1,16],complex<f32>> -> !torch.vtensor<[1,?,4,16],complex<f32>>
    torch.bind_symbolic_shape %156, [%32], affine_map<()[s0] -> (1, s0 * 16, 4, 16)> : !torch.vtensor<[1,?,4,16],complex<f32>>
    %157 = torch_c.to_builtin_tensor %156 : !torch.vtensor<[1,?,4,16],complex<f32>> -> tensor<1x?x4x16xcomplex<f32>>
    %c1_162 = arith.constant 1 : index
    %dim_163 = tensor.dim %157, %c1_162 : tensor<1x?x4x16xcomplex<f32>>
    %158 = flow.tensor.bitcast %157 : tensor<1x?x4x16xcomplex<f32>>{%dim_163} -> tensor<1x?x4x32xf32>{%dim_163}
    %159 = torch_c.from_builtin_tensor %158 : tensor<1x?x4x32xf32> -> !torch.vtensor<[1,?,4,32],f32>
    torch.bind_symbolic_shape %159, [%32], affine_map<()[s0] -> (1, s0 * 16, 4, 32)> : !torch.vtensor<[1,?,4,32],f32>
    %int5_164 = torch.constant.int 5
    %160 = torch.prims.convert_element_type %159, %int5_164 : !torch.vtensor<[1,?,4,32],f32>, !torch.int -> !torch.vtensor<[1,?,4,32],f16>
    torch.bind_symbolic_shape %160, [%32], affine_map<()[s0] -> (1, s0 * 16, 4, 32)> : !torch.vtensor<[1,?,4,32],f16>
    %int3_165 = torch.constant.int 3
    %int2_166 = torch.constant.int 2
    %int16_167 = torch.constant.int 16
    %int4_168 = torch.constant.int 4
    %int32_169 = torch.constant.int 32
    %161 = torch.prim.ListConstruct %35, %int3_165, %int2_166, %int16_167, %int4_168, %int32_169 : (!torch.int, !torch.int, !torch.int, !torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %162 = torch.aten.view %30, %161 : !torch.vtensor<[?,12288],f16>, !torch.list<int> -> !torch.vtensor<[?,3,2,16,4,32],f16>
    torch.bind_symbolic_shape %162, [%33], affine_map<()[s0] -> (s0, 3, 2, 16, 4, 32)> : !torch.vtensor<[?,3,2,16,4,32],f16>
    %int3_170 = torch.constant.int 3
    %163 = torch.aten.mul.int %35, %int3_170 : !torch.int, !torch.int -> !torch.int
    %int2_171 = torch.constant.int 2
    %164 = torch.aten.mul.int %163, %int2_171 : !torch.int, !torch.int -> !torch.int
    %int16_172 = torch.constant.int 16
    %int4_173 = torch.constant.int 4
    %int32_174 = torch.constant.int 32
    %165 = torch.prim.ListConstruct %164, %int16_172, %int4_173, %int32_174 : (!torch.int, !torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %166 = torch.aten.view %162, %165 : !torch.vtensor<[?,3,2,16,4,32],f16>, !torch.list<int> -> !torch.vtensor<[?,16,4,32],f16>
    torch.bind_symbolic_shape %166, [%33], affine_map<()[s0] -> (s0 * 6, 16, 4, 32)> : !torch.vtensor<[?,16,4,32],f16>
    %int6_175 = torch.constant.int 6
    %167 = torch.aten.mul.Scalar %arg2, %int6_175 : !torch.vtensor<[1,?],si64>, !torch.int -> !torch.vtensor<[1,?],si64>
    torch.bind_symbolic_shape %167, [%32], affine_map<()[s0] -> (1, s0)> : !torch.vtensor<[1,?],si64>
    %int0_176 = torch.constant.int 0
    %int1_177 = torch.constant.int 1
    %168 = torch.aten.add.Scalar %167, %int0_176, %int1_177 : !torch.vtensor<[1,?],si64>, !torch.int, !torch.int -> !torch.vtensor<[1,?],si64>
    torch.bind_symbolic_shape %168, [%32], affine_map<()[s0] -> (1, s0)> : !torch.vtensor<[1,?],si64>
    %int1_178 = torch.constant.int 1
    %int16_179 = torch.constant.int 16
    %int4_180 = torch.constant.int 4
    %int32_181 = torch.constant.int 32
    %169 = torch.prim.ListConstruct %int1_178, %34, %int16_179, %int4_180, %int32_181 : (!torch.int, !torch.int, !torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %170 = torch.aten.view %160, %169 : !torch.vtensor<[1,?,4,32],f16>, !torch.list<int> -> !torch.vtensor<[1,?,16,4,32],f16>
    torch.bind_symbolic_shape %170, [%32], affine_map<()[s0] -> (1, s0, 16, 4, 32)> : !torch.vtensor<[1,?,16,4,32],f16>
    %int16_182 = torch.constant.int 16
    %int4_183 = torch.constant.int 4
    %int32_184 = torch.constant.int 32
    %171 = torch.prim.ListConstruct %34, %int16_182, %int4_183, %int32_184 : (!torch.int, !torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %172 = torch.aten.view %170, %171 : !torch.vtensor<[1,?,16,4,32],f16>, !torch.list<int> -> !torch.vtensor<[?,16,4,32],f16>
    torch.bind_symbolic_shape %172, [%32], affine_map<()[s0] -> (s0, 16, 4, 32)> : !torch.vtensor<[?,16,4,32],f16>
    %173 = torch.prim.ListConstruct %34 : (!torch.int) -> !torch.list<int>
    %174 = torch.aten.view %168, %173 : !torch.vtensor<[1,?],si64>, !torch.list<int> -> !torch.vtensor<[?],si64>
    torch.bind_symbolic_shape %174, [%32], affine_map<()[s0] -> (s0)> : !torch.vtensor<[?],si64>
    %int1_185 = torch.constant.int 1
    %int16_186 = torch.constant.int 16
    %int4_187 = torch.constant.int 4
    %int32_188 = torch.constant.int 32
    %175 = torch.prim.ListConstruct %int1_185, %34, %int16_186, %int4_187, %int32_188 : (!torch.int, !torch.int, !torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %176 = torch.aten.view %104, %175 : !torch.vtensor<[1,?,4,32],f16>, !torch.list<int> -> !torch.vtensor<[1,?,16,4,32],f16>
    torch.bind_symbolic_shape %176, [%32], affine_map<()[s0] -> (1, s0, 16, 4, 32)> : !torch.vtensor<[1,?,16,4,32],f16>
    %int16_189 = torch.constant.int 16
    %int4_190 = torch.constant.int 4
    %int32_191 = torch.constant.int 32
    %177 = torch.prim.ListConstruct %34, %int16_189, %int4_190, %int32_191 : (!torch.int, !torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %178 = torch.aten.view %176, %177 : !torch.vtensor<[1,?,16,4,32],f16>, !torch.list<int> -> !torch.vtensor<[?,16,4,32],f16>
    torch.bind_symbolic_shape %178, [%32], affine_map<()[s0] -> (s0, 16, 4, 32)> : !torch.vtensor<[?,16,4,32],f16>
    %int1_192 = torch.constant.int 1
    %int1_193 = torch.constant.int 1
    %179 = torch.aten.add.Scalar %168, %int1_192, %int1_193 : !torch.vtensor<[1,?],si64>, !torch.int, !torch.int -> !torch.vtensor<[1,?],si64>
    torch.bind_symbolic_shape %179, [%32], affine_map<()[s0] -> (1, s0)> : !torch.vtensor<[1,?],si64>
    %180 = torch.prim.ListConstruct %34 : (!torch.int) -> !torch.list<int>
    %181 = torch.aten.view %179, %180 : !torch.vtensor<[1,?],si64>, !torch.list<int> -> !torch.vtensor<[?],si64>
    torch.bind_symbolic_shape %181, [%32], affine_map<()[s0] -> (s0)> : !torch.vtensor<[?],si64>
    %182 = torch.prim.ListConstruct %174, %181 : (!torch.vtensor<[?],si64>, !torch.vtensor<[?],si64>) -> !torch.list<vtensor>
    %int0_194 = torch.constant.int 0
    %183 = torch.aten.cat %182, %int0_194 : !torch.list<vtensor>, !torch.int -> !torch.vtensor<[?],si64>
    torch.bind_symbolic_shape %183, [%32], affine_map<()[s0] -> (s0 * 2)> : !torch.vtensor<[?],si64>
    %184 = torch.prim.ListConstruct %172, %178 : (!torch.vtensor<[?,16,4,32],f16>, !torch.vtensor<[?,16,4,32],f16>) -> !torch.list<vtensor>
    %int0_195 = torch.constant.int 0
    %185 = torch.aten.cat %184, %int0_195 : !torch.list<vtensor>, !torch.int -> !torch.vtensor<[?,16,4,32],f16>
    torch.bind_symbolic_shape %185, [%32], affine_map<()[s0] -> (s0 * 2, 16, 4, 32)> : !torch.vtensor<[?,16,4,32],f16>
    %186 = torch.prim.ListConstruct %183 : (!torch.vtensor<[?],si64>) -> !torch.list<optional<vtensor>>
    %false_196 = torch.constant.bool false
    %187 = torch.aten.index_put %166, %186, %185, %false_196 : !torch.vtensor<[?,16,4,32],f16>, !torch.list<optional<vtensor>>, !torch.vtensor<[?,16,4,32],f16>, !torch.bool -> !torch.vtensor<[?,16,4,32],f16>
    torch.bind_symbolic_shape %187, [%33], affine_map<()[s0] -> (s0 * 6, 16, 4, 32)> : !torch.vtensor<[?,16,4,32],f16>
    %int3_197 = torch.constant.int 3
    %int2_198 = torch.constant.int 2
    %int16_199 = torch.constant.int 16
    %int4_200 = torch.constant.int 4
    %int32_201 = torch.constant.int 32
    %188 = torch.prim.ListConstruct %35, %int3_197, %int2_198, %int16_199, %int4_200, %int32_201 : (!torch.int, !torch.int, !torch.int, !torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %189 = torch.aten.view %187, %188 : !torch.vtensor<[?,16,4,32],f16>, !torch.list<int> -> !torch.vtensor<[?,3,2,16,4,32],f16>
    torch.bind_symbolic_shape %189, [%33], affine_map<()[s0] -> (s0, 3, 2, 16, 4, 32)> : !torch.vtensor<[?,3,2,16,4,32],f16>
    %int12288 = torch.constant.int 12288
    %190 = torch.prim.ListConstruct %35, %int12288 : (!torch.int, !torch.int) -> !torch.list<int>
    %191 = torch.aten.view %189, %190 : !torch.vtensor<[?,3,2,16,4,32],f16>, !torch.list<int> -> !torch.vtensor<[?,12288],f16>
