#map = affine_map<(d0, d1, d2, d3) -> (d0, d1, d3)>
#map1 = affine_map<(d0, d1, d2, d3) -> (d0, d1, d2, d3)>
module @module {
  util.global private @__auto.token_embd.weight = #stream.parameter.named<"model"::"token_embd.weight"> : tensor<256x256xf32>
  util.global private @__auto.blk.0.attn_norm.weight = #stream.parameter.named<"model"::"blk.0.attn_norm.weight"> : tensor<256xf32>
  util.global private @__auto.blk.0.attn_q.weight = #stream.parameter.named<"model"::"blk.0.attn_q.weight"> : tensor<256x256xf32>
  util.global private @__auto.blk.0.attn_k.weight = #stream.parameter.named<"model"::"blk.0.attn_k.weight"> : tensor<128x256xf32>
  util.global private @__auto.blk.0.attn_v.weight = #stream.parameter.named<"model"::"blk.0.attn_v.weight"> : tensor<128x256xf32>
  util.global private @__auto.blk.0.attn_output.weight = #stream.parameter.named<"model"::"blk.0.attn_output.weight"> : tensor<256x256xf32>
  util.global private @__auto.blk.0.ffn_norm.weight = #stream.parameter.named<"model"::"blk.0.ffn_norm.weight"> : tensor<256xf32>
  util.global private @__auto.blk.0.ffn_gate.weight = #stream.parameter.named<"model"::"blk.0.ffn_gate.weight"> : tensor<23x256xf32>
  util.global private @__auto.blk.0.ffn_up.weight = #stream.parameter.named<"model"::"blk.0.ffn_up.weight"> : tensor<23x256xf32>
  util.global private @__auto.blk.0.ffn_down.weight = #stream.parameter.named<"model"::"blk.0.ffn_down.weight"> : tensor<256x23xf32>
  util.global private @__auto.blk.1.attn_norm.weight = #stream.parameter.named<"model"::"blk.1.attn_norm.weight"> : tensor<256xf32>
  util.global private @__auto.blk.1.attn_q.weight = #stream.parameter.named<"model"::"blk.1.attn_q.weight"> : tensor<256x256xf32>
  util.global private @__auto.blk.1.attn_k.weight = #stream.parameter.named<"model"::"blk.1.attn_k.weight"> : tensor<128x256xf32>
  util.global private @__auto.blk.1.attn_v.weight = #stream.parameter.named<"model"::"blk.1.attn_v.weight"> : tensor<128x256xf32>
  util.global private @__auto.blk.1.attn_output.weight = #stream.parameter.named<"model"::"blk.1.attn_output.weight"> : tensor<256x256xf32>
  util.global private @__auto.blk.1.ffn_norm.weight = #stream.parameter.named<"model"::"blk.1.ffn_norm.weight"> : tensor<256xf32>
  util.global private @__auto.blk.1.ffn_gate.weight = #stream.parameter.named<"model"::"blk.1.ffn_gate.weight"> : tensor<23x256xf32>
  util.global private @__auto.blk.1.ffn_up.weight = #stream.parameter.named<"model"::"blk.1.ffn_up.weight"> : tensor<23x256xf32>
  util.global private @__auto.blk.1.ffn_down.weight = #stream.parameter.named<"model"::"blk.1.ffn_down.weight"> : tensor<256x23xf32>
  util.global private @__auto.blk.2.attn_norm.weight = #stream.parameter.named<"model"::"blk.2.attn_norm.weight"> : tensor<256xf32>
  util.global private @__auto.blk.2.attn_q.weight = #stream.parameter.named<"model"::"blk.2.attn_q.weight"> : tensor<256x256xf32>
  util.global private @__auto.blk.2.attn_k.weight = #stream.parameter.named<"model"::"blk.2.attn_k.weight"> : tensor<128x256xf32>
  util.global private @__auto.blk.2.attn_v.weight = #stream.parameter.named<"model"::"blk.2.attn_v.weight"> : tensor<128x256xf32>
  util.global private @__auto.blk.2.attn_output.weight = #stream.parameter.named<"model"::"blk.2.attn_output.weight"> : tensor<256x256xf32>
  util.global private @__auto.blk.2.ffn_norm.weight = #stream.parameter.named<"model"::"blk.2.ffn_norm.weight"> : tensor<256xf32>
  util.global private @__auto.blk.2.ffn_gate.weight = #stream.parameter.named<"model"::"blk.2.ffn_gate.weight"> : tensor<23x256xf32>
  util.global private @__auto.blk.2.ffn_up.weight = #stream.parameter.named<"model"::"blk.2.ffn_up.weight"> : tensor<23x256xf32>
  util.global private @__auto.blk.2.ffn_down.weight = #stream.parameter.named<"model"::"blk.2.ffn_down.weight"> : tensor<256x23xf32>
  util.global private @__auto.output_norm.weight = #stream.parameter.named<"model"::"output_norm.weight"> : tensor<1x256xf32>
  util.global private @__auto.output.weight = #stream.parameter.named<"model"::"output.weight"> : tensor<256x256xf32>
  func.func @prefill_bs1(%arg0: !torch.vtensor<[1,?],si64>, %arg1: !torch.vtensor<[1],si64>, %arg2: !torch.vtensor<[1,?],si64>, %arg3: !torch.tensor<[?,24576],f16>) -> !torch.vtensor<[1,?,256],f16> attributes {torch.assume_strict_symbolic_shapes} {
    %__auto.token_embd.weight = util.global.load @__auto.token_embd.weight : tensor<256x256xf32>
    %0 = torch_c.from_builtin_tensor %__auto.token_embd.weight : tensor<256x256xf32> -> !torch.vtensor<[256,256],f32>
    %__auto.blk.0.attn_norm.weight = util.global.load @__auto.blk.0.attn_norm.weight : tensor<256xf32>
    %1 = torch_c.from_builtin_tensor %__auto.blk.0.attn_norm.weight : tensor<256xf32> -> !torch.vtensor<[256],f32>
    %__auto.blk.0.attn_q.weight = util.global.load @__auto.blk.0.attn_q.weight : tensor<256x256xf32>
    %2 = torch_c.from_builtin_tensor %__auto.blk.0.attn_q.weight : tensor<256x256xf32> -> !torch.vtensor<[256,256],f32>
    %__auto.blk.0.attn_k.weight = util.global.load @__auto.blk.0.attn_k.weight : tensor<128x256xf32>
    %3 = torch_c.from_builtin_tensor %__auto.blk.0.attn_k.weight : tensor<128x256xf32> -> !torch.vtensor<[128,256],f32>
    %__auto.blk.0.attn_v.weight = util.global.load @__auto.blk.0.attn_v.weight : tensor<128x256xf32>
    %4 = torch_c.from_builtin_tensor %__auto.blk.0.attn_v.weight : tensor<128x256xf32> -> !torch.vtensor<[128,256],f32>
    %__auto.blk.0.attn_output.weight = util.global.load @__auto.blk.0.attn_output.weight : tensor<256x256xf32>
    %5 = torch_c.from_builtin_tensor %__auto.blk.0.attn_output.weight : tensor<256x256xf32> -> !torch.vtensor<[256,256],f32>
    %__auto.blk.0.ffn_norm.weight = util.global.load @__auto.blk.0.ffn_norm.weight : tensor<256xf32>
    %6 = torch_c.from_builtin_tensor %__auto.blk.0.ffn_norm.weight : tensor<256xf32> -> !torch.vtensor<[256],f32>
    %__auto.blk.0.ffn_gate.weight = util.global.load @__auto.blk.0.ffn_gate.weight : tensor<23x256xf32>
    %7 = torch_c.from_builtin_tensor %__auto.blk.0.ffn_gate.weight : tensor<23x256xf32> -> !torch.vtensor<[23,256],f32>
    %__auto.blk.0.ffn_up.weight = util.global.load @__auto.blk.0.ffn_up.weight : tensor<23x256xf32>
    %8 = torch_c.from_builtin_tensor %__auto.blk.0.ffn_up.weight : tensor<23x256xf32> -> !torch.vtensor<[23,256],f32>
    %__auto.blk.0.ffn_down.weight = util.global.load @__auto.blk.0.ffn_down.weight : tensor<256x23xf32>
    %9 = torch_c.from_builtin_tensor %__auto.blk.0.ffn_down.weight : tensor<256x23xf32> -> !torch.vtensor<[256,23],f32>
    %__auto.blk.1.attn_norm.weight = util.global.load @__auto.blk.1.attn_norm.weight : tensor<256xf32>
    %10 = torch_c.from_builtin_tensor %__auto.blk.1.attn_norm.weight : tensor<256xf32> -> !torch.vtensor<[256],f32>
    %__auto.blk.1.attn_q.weight = util.global.load @__auto.blk.1.attn_q.weight : tensor<256x256xf32>
    %11 = torch_c.from_builtin_tensor %__auto.blk.1.attn_q.weight : tensor<256x256xf32> -> !torch.vtensor<[256,256],f32>
    %__auto.blk.1.attn_k.weight = util.global.load @__auto.blk.1.attn_k.weight : tensor<128x256xf32>
    %12 = torch_c.from_builtin_tensor %__auto.blk.1.attn_k.weight : tensor<128x256xf32> -> !torch.vtensor<[128,256],f32>
    %__auto.blk.1.attn_v.weight = util.global.load @__auto.blk.1.attn_v.weight : tensor<128x256xf32>
    %13 = torch_c.from_builtin_tensor %__auto.blk.1.attn_v.weight : tensor<128x256xf32> -> !torch.vtensor<[128,256],f32>
    %__auto.blk.1.attn_output.weight = util.global.load @__auto.blk.1.attn_output.weight : tensor<256x256xf32>
    %14 = torch_c.from_builtin_tensor %__auto.blk.1.attn_output.weight : tensor<256x256xf32> -> !torch.vtensor<[256,256],f32>
    %__auto.blk.1.ffn_norm.weight = util.global.load @__auto.blk.1.ffn_norm.weight : tensor<256xf32>
    %15 = torch_c.from_builtin_tensor %__auto.blk.1.ffn_norm.weight : tensor<256xf32> -> !torch.vtensor<[256],f32>
    %__auto.blk.1.ffn_gate.weight = util.global.load @__auto.blk.1.ffn_gate.weight : tensor<23x256xf32>
    %16 = torch_c.from_builtin_tensor %__auto.blk.1.ffn_gate.weight : tensor<23x256xf32> -> !torch.vtensor<[23,256],f32>
    %__auto.blk.1.ffn_up.weight = util.global.load @__auto.blk.1.ffn_up.weight : tensor<23x256xf32>
    %17 = torch_c.from_builtin_tensor %__auto.blk.1.ffn_up.weight : tensor<23x256xf32> -> !torch.vtensor<[23,256],f32>
    %__auto.blk.1.ffn_down.weight = util.global.load @__auto.blk.1.ffn_down.weight : tensor<256x23xf32>
    %18 = torch_c.from_builtin_tensor %__auto.blk.1.ffn_down.weight : tensor<256x23xf32> -> !torch.vtensor<[256,23],f32>
    %__auto.blk.2.attn_norm.weight = util.global.load @__auto.blk.2.attn_norm.weight : tensor<256xf32>
    %19 = torch_c.from_builtin_tensor %__auto.blk.2.attn_norm.weight : tensor<256xf32> -> !torch.vtensor<[256],f32>
    %__auto.blk.2.attn_q.weight = util.global.load @__auto.blk.2.attn_q.weight : tensor<256x256xf32>
    %20 = torch_c.from_builtin_tensor %__auto.blk.2.attn_q.weight : tensor<256x256xf32> -> !torch.vtensor<[256,256],f32>
    %__auto.blk.2.attn_k.weight = util.global.load @__auto.blk.2.attn_k.weight : tensor<128x256xf32>
    %21 = torch_c.from_builtin_tensor %__auto.blk.2.attn_k.weight : tensor<128x256xf32> -> !torch.vtensor<[128,256],f32>
    %__auto.blk.2.attn_v.weight = util.global.load @__auto.blk.2.attn_v.weight : tensor<128x256xf32>
    %22 = torch_c.from_builtin_tensor %__auto.blk.2.attn_v.weight : tensor<128x256xf32> -> !torch.vtensor<[128,256],f32>
    %__auto.blk.2.attn_output.weight = util.global.load @__auto.blk.2.attn_output.weight : tensor<256x256xf32>
    %23 = torch_c.from_builtin_tensor %__auto.blk.2.attn_output.weight : tensor<256x256xf32> -> !torch.vtensor<[256,256],f32>
    %__auto.blk.2.ffn_norm.weight = util.global.load @__auto.blk.2.ffn_norm.weight : tensor<256xf32>
    %24 = torch_c.from_builtin_tensor %__auto.blk.2.ffn_norm.weight : tensor<256xf32> -> !torch.vtensor<[256],f32>
    %__auto.blk.2.ffn_gate.weight = util.global.load @__auto.blk.2.ffn_gate.weight : tensor<23x256xf32>
    %25 = torch_c.from_builtin_tensor %__auto.blk.2.ffn_gate.weight : tensor<23x256xf32> -> !torch.vtensor<[23,256],f32>
    %__auto.blk.2.ffn_up.weight = util.global.load @__auto.blk.2.ffn_up.weight : tensor<23x256xf32>
    %26 = torch_c.from_builtin_tensor %__auto.blk.2.ffn_up.weight : tensor<23x256xf32> -> !torch.vtensor<[23,256],f32>
    %__auto.blk.2.ffn_down.weight = util.global.load @__auto.blk.2.ffn_down.weight : tensor<256x23xf32>
    %27 = torch_c.from_builtin_tensor %__auto.blk.2.ffn_down.weight : tensor<256x23xf32> -> !torch.vtensor<[256,23],f32>
    %__auto.output_norm.weight = util.global.load @__auto.output_norm.weight : tensor<1x256xf32>
    %28 = torch_c.from_builtin_tensor %__auto.output_norm.weight : tensor<1x256xf32> -> !torch.vtensor<[1,256],f32>
    %__auto.output.weight = util.global.load @__auto.output.weight : tensor<256x256xf32>
    %29 = torch_c.from_builtin_tensor %__auto.output.weight : tensor<256x256xf32> -> !torch.vtensor<[256,256],f32>
    %30 = torch.copy.to_vtensor %arg3 : !torch.vtensor<[?,24576],f16>
    %31 = torch.symbolic_int "32*s1" {min_val = 64, max_val = 96} : !torch.int
    %32 = torch.symbolic_int "s1" {min_val = 2, max_val = 3} : !torch.int
    %33 = torch.symbolic_int "s2" {min_val = 0, max_val = 9223372036854775807} : !torch.int
    torch.bind_symbolic_shape %arg0, [%32], affine_map<()[s0] -> (1, s0 * 32)> : !torch.vtensor<[1,?],si64>
    torch.bind_symbolic_shape %arg2, [%32], affine_map<()[s0] -> (1, s0)> : !torch.vtensor<[1,?],si64>
    torch.bind_symbolic_shape %30, [%33], affine_map<()[s0] -> (s0, 24576)> : !torch.vtensor<[?,24576],f16>
    %int1 = torch.constant.int 1
    %34 = torch.aten.size.int %arg2, %int1 : !torch.vtensor<[1,?],si64>, !torch.int -> !torch.int
    %int0 = torch.constant.int 0
    %35 = torch.aten.size.int %30, %int0 : !torch.vtensor<[?,24576],f16>, !torch.int -> !torch.int
    %int5 = torch.constant.int 5
    %36 = torch.prims.convert_element_type %0, %int5 : !torch.vtensor<[256,256],f32>, !torch.int -> !torch.vtensor<[256,256],f16>
    %int-1 = torch.constant.int -1
    %false = torch.constant.bool false
    %false_0 = torch.constant.bool false
    %37 = torch.aten.embedding %36, %arg0, %int-1, %false, %false_0 : !torch.vtensor<[256,256],f16>, !torch.vtensor<[1,?],si64>, !torch.int, !torch.bool, !torch.bool -> !torch.vtensor<[1,?,256],f16>
    torch.bind_symbolic_shape %37, [%32], affine_map<()[s0] -> (1, s0 * 32, 256)> : !torch.vtensor<[1,?,256],f16>
    %int1_1 = torch.constant.int 1
    %38 = torch.aten.size.int %arg0, %int1_1 : !torch.vtensor<[1,?],si64>, !torch.int -> !torch.int
    %int6 = torch.constant.int 6
    %39 = torch.prims.convert_element_type %37, %int6 : !torch.vtensor<[1,?,256],f16>, !torch.int -> !torch.vtensor<[1,?,256],f32>
    torch.bind_symbolic_shape %39, [%32], affine_map<()[s0] -> (1, s0 * 32, 256)> : !torch.vtensor<[1,?,256],f32>
    %int2 = torch.constant.int 2
    %40 = torch.aten.pow.Tensor_Scalar %39, %int2 : !torch.vtensor<[1,?,256],f32>, !torch.int -> !torch.vtensor<[1,?,256],f32>
    torch.bind_symbolic_shape %40, [%32], affine_map<()[s0] -> (1, s0 * 32, 256)> : !torch.vtensor<[1,?,256],f32>
    %int-1_2 = torch.constant.int -1
    %41 = torch.prim.ListConstruct %int-1_2 : (!torch.int) -> !torch.list<int>
    %true = torch.constant.bool true
    %none = torch.constant.none
    %42 = torch.aten.mean.dim %40, %41, %true, %none : !torch.vtensor<[1,?,256],f32>, !torch.list<int>, !torch.bool, !torch.none -> !torch.vtensor<[1,?,1],f32>
    torch.bind_symbolic_shape %42, [%32], affine_map<()[s0] -> (1, s0 * 32, 1)> : !torch.vtensor<[1,?,1],f32>
    %float1.000000e-02 = torch.constant.float 1.000000e-02
    %int1_3 = torch.constant.int 1
    %43 = torch.aten.add.Scalar %42, %float1.000000e-02, %int1_3 : !torch.vtensor<[1,?,1],f32>, !torch.float, !torch.int -> !torch.vtensor<[1,?,1],f32>
    torch.bind_symbolic_shape %43, [%32], affine_map<()[s0] -> (1, s0 * 32, 1)> : !torch.vtensor<[1,?,1],f32>
    %44 = torch.aten.rsqrt %43 : !torch.vtensor<[1,?,1],f32> -> !torch.vtensor<[1,?,1],f32>
    torch.bind_symbolic_shape %44, [%32], affine_map<()[s0] -> (1, s0 * 32, 1)> : !torch.vtensor<[1,?,1],f32>
    %45 = torch.aten.mul.Tensor %39, %44 : !torch.vtensor<[1,?,256],f32>, !torch.vtensor<[1,?,1],f32> -> !torch.vtensor<[1,?,256],f32>
    torch.bind_symbolic_shape %45, [%32], affine_map<()[s0] -> (1, s0 * 32, 256)> : !torch.vtensor<[1,?,256],f32>
    %int5_4 = torch.constant.int 5
    %46 = torch.prims.convert_element_type %45, %int5_4 : !torch.vtensor<[1,?,256],f32>, !torch.int -> !torch.vtensor<[1,?,256],f16>
    torch.bind_symbolic_shape %46, [%32], affine_map<()[s0] -> (1, s0 * 32, 256)> : !torch.vtensor<[1,?,256],f16>
    %47 = torch.aten.mul.Tensor %1, %46 : !torch.vtensor<[256],f32>, !torch.vtensor<[1,?,256],f16> -> !torch.vtensor<[1,?,256],f32>
    torch.bind_symbolic_shape %47, [%32], affine_map<()[s0] -> (1, s0 * 32, 256)> : !torch.vtensor<[1,?,256],f32>
    %int5_5 = torch.constant.int 5
    %48 = torch.prims.convert_element_type %47, %int5_5 : !torch.vtensor<[1,?,256],f32>, !torch.int -> !torch.vtensor<[1,?,256],f16>
    torch.bind_symbolic_shape %48, [%32], affine_map<()[s0] -> (1, s0 * 32, 256)> : !torch.vtensor<[1,?,256],f16>
    %int5_6 = torch.constant.int 5
    %49 = torch.prims.convert_element_type %2, %int5_6 : !torch.vtensor<[256,256],f32>, !torch.int -> !torch.vtensor<[256,256],f16>
    %int-2 = torch.constant.int -2
    %int-1_7 = torch.constant.int -1
    %50 = torch.aten.transpose.int %49, %int-2, %int-1_7 : !torch.vtensor<[256,256],f16>, !torch.int, !torch.int -> !torch.vtensor<[256,256],f16>
    %int5_8 = torch.constant.int 5
    %51 = torch.prims.convert_element_type %50, %int5_8 : !torch.vtensor<[256,256],f16>, !torch.int -> !torch.vtensor<[256,256],f16>
    %int256 = torch.constant.int 256
    %52 = torch.prim.ListConstruct %38, %int256 : (!torch.int, !torch.int) -> !torch.list<int>
    %53 = torch.aten.view %48, %52 : !torch.vtensor<[1,?,256],f16>, !torch.list<int> -> !torch.vtensor<[?,256],f16>
    torch.bind_symbolic_shape %53, [%32], affine_map<()[s0] -> (s0 * 32, 256)> : !torch.vtensor<[?,256],f16>
    %54 = torch.aten.mm %53, %51 : !torch.vtensor<[?,256],f16>, !torch.vtensor<[256,256],f16> -> !torch.vtensor<[?,256],f16>
    torch.bind_symbolic_shape %54, [%32], affine_map<()[s0] -> (s0 * 32, 256)> : !torch.vtensor<[?,256],f16>
    %int1_9 = torch.constant.int 1
    %int256_10 = torch.constant.int 256
    %55 = torch.prim.ListConstruct %int1_9, %38, %int256_10 : (!torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %56 = torch.aten.view %54, %55 : !torch.vtensor<[?,256],f16>, !torch.list<int> -> !torch.vtensor<[1,?,256],f16>
    torch.bind_symbolic_shape %56, [%32], affine_map<()[s0] -> (1, s0 * 32, 256)> : !torch.vtensor<[1,?,256],f16>
    %int5_11 = torch.constant.int 5
    %57 = torch.prims.convert_element_type %3, %int5_11 : !torch.vtensor<[128,256],f32>, !torch.int -> !torch.vtensor<[128,256],f16>
    %int-2_12 = torch.constant.int -2
    %int-1_13 = torch.constant.int -1
    %58 = torch.aten.transpose.int %57, %int-2_12, %int-1_13 : !torch.vtensor<[128,256],f16>, !torch.int, !torch.int -> !torch.vtensor<[256,128],f16>
    %int5_14 = torch.constant.int 5
    %59 = torch.prims.convert_element_type %58, %int5_14 : !torch.vtensor<[256,128],f16>, !torch.int -> !torch.vtensor<[256,128],f16>
    %int256_15 = torch.constant.int 256
    %60 = torch.prim.ListConstruct %38, %int256_15 : (!torch.int, !torch.int) -> !torch.list<int>
    %61 = torch.aten.view %48, %60 : !torch.vtensor<[1,?,256],f16>, !torch.list<int> -> !torch.vtensor<[?,256],f16>
    torch.bind_symbolic_shape %61, [%32], affine_map<()[s0] -> (s0 * 32, 256)> : !torch.vtensor<[?,256],f16>
    %62 = torch.aten.mm %61, %59 : !torch.vtensor<[?,256],f16>, !torch.vtensor<[256,128],f16> -> !torch.vtensor<[?,128],f16>
    torch.bind_symbolic_shape %62, [%32], affine_map<()[s0] -> (s0 * 32, 128)> : !torch.vtensor<[?,128],f16>
    %int1_16 = torch.constant.int 1
    %int128 = torch.constant.int 128
    %63 = torch.prim.ListConstruct %int1_16, %38, %int128 : (!torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %64 = torch.aten.view %62, %63 : !torch.vtensor<[?,128],f16>, !torch.list<int> -> !torch.vtensor<[1,?,128],f16>
    torch.bind_symbolic_shape %64, [%32], affine_map<()[s0] -> (1, s0 * 32, 128)> : !torch.vtensor<[1,?,128],f16>
    %int5_17 = torch.constant.int 5
    %65 = torch.prims.convert_element_type %4, %int5_17 : !torch.vtensor<[128,256],f32>, !torch.int -> !torch.vtensor<[128,256],f16>
    %int-2_18 = torch.constant.int -2
    %int-1_19 = torch.constant.int -1
    %66 = torch.aten.transpose.int %65, %int-2_18, %int-1_19 : !torch.vtensor<[128,256],f16>, !torch.int, !torch.int -> !torch.vtensor<[256,128],f16>
    %int5_20 = torch.constant.int 5
    %67 = torch.prims.convert_element_type %66, %int5_20 : !torch.vtensor<[256,128],f16>, !torch.int -> !torch.vtensor<[256,128],f16>
    %int256_21 = torch.constant.int 256
    %68 = torch.prim.ListConstruct %38, %int256_21 : (!torch.int, !torch.int) -> !torch.list<int>
    %69 = torch.aten.view %48, %68 : !torch.vtensor<[1,?,256],f16>, !torch.list<int> -> !torch.vtensor<[?,256],f16>
    torch.bind_symbolic_shape %69, [%32], affine_map<()[s0] -> (s0 * 32, 256)> : !torch.vtensor<[?,256],f16>
    %70 = torch.aten.mm %69, %67 : !torch.vtensor<[?,256],f16>, !torch.vtensor<[256,128],f16> -> !torch.vtensor<[?,128],f16>
    torch.bind_symbolic_shape %70, [%32], affine_map<()[s0] -> (s0 * 32, 128)> : !torch.vtensor<[?,128],f16>
    %int1_22 = torch.constant.int 1
    %int128_23 = torch.constant.int 128
    %71 = torch.prim.ListConstruct %int1_22, %38, %int128_23 : (!torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %72 = torch.aten.view %70, %71 : !torch.vtensor<[?,128],f16>, !torch.list<int> -> !torch.vtensor<[1,?,128],f16>
    torch.bind_symbolic_shape %72, [%32], affine_map<()[s0] -> (1, s0 * 32, 128)> : !torch.vtensor<[1,?,128],f16>
    %int1_24 = torch.constant.int 1
    %int8 = torch.constant.int 8
    %int32 = torch.constant.int 32
    %73 = torch.prim.ListConstruct %int1_24, %38, %int8, %int32 : (!torch.int, !torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %74 = torch.aten.view %56, %73 : !torch.vtensor<[1,?,256],f16>, !torch.list<int> -> !torch.vtensor<[1,?,8,32],f16>
    torch.bind_symbolic_shape %74, [%32], affine_map<()[s0] -> (1, s0 * 32, 8, 32)> : !torch.vtensor<[1,?,8,32],f16>
    %int1_25 = torch.constant.int 1
    %int4 = torch.constant.int 4
    %int32_26 = torch.constant.int 32
    %75 = torch.prim.ListConstruct %int1_25, %38, %int4, %int32_26 : (!torch.int, !torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %76 = torch.aten.view %64, %75 : !torch.vtensor<[1,?,128],f16>, !torch.list<int> -> !torch.vtensor<[1,?,4,32],f16>
    torch.bind_symbolic_shape %76, [%32], affine_map<()[s0] -> (1, s0 * 32, 4, 32)> : !torch.vtensor<[1,?,4,32],f16>
    %int1_27 = torch.constant.int 1
    %int4_28 = torch.constant.int 4
    %int32_29 = torch.constant.int 32
    %77 = torch.prim.ListConstruct %int1_27, %38, %int4_28, %int32_29 : (!torch.int, !torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %78 = torch.aten.view %72, %77 : !torch.vtensor<[1,?,128],f16>, !torch.list<int> -> !torch.vtensor<[1,?,4,32],f16>
    torch.bind_symbolic_shape %78, [%32], affine_map<()[s0] -> (1, s0 * 32, 4, 32)> : !torch.vtensor<[1,?,4,32],f16>
    %int128_30 = torch.constant.int 128
    %none_31 = torch.constant.none
    %none_32 = torch.constant.none
    %cpu = torch.constant.device "cpu"
    %false_33 = torch.constant.bool false
    %79 = torch.aten.arange %int128_30, %none_31, %none_32, %cpu, %false_33 : !torch.int, !torch.none, !torch.none, !torch.Device, !torch.bool -> !torch.vtensor<[128],si64>
    %int0_34 = torch.constant.int 0
    %int32_35 = torch.constant.int 32
    %none_36 = torch.constant.none
    %none_37 = torch.constant.none
    %cpu_38 = torch.constant.device "cpu"
    %false_39 = torch.constant.bool false
    %80 = torch.aten.arange.start %int0_34, %int32_35, %none_36, %none_37, %cpu_38, %false_39 : !torch.int, !torch.int, !torch.none, !torch.none, !torch.Device, !torch.bool -> !torch.vtensor<[32],si64>
    %int2_40 = torch.constant.int 2
    %81 = torch.aten.floor_divide.Scalar %80, %int2_40 : !torch.vtensor<[32],si64>, !torch.int -> !torch.vtensor<[32],si64>
    %int6_41 = torch.constant.int 6
    %82 = torch.prims.convert_element_type %81, %int6_41 : !torch.vtensor<[32],si64>, !torch.int -> !torch.vtensor<[32],f32>
    %int32_42 = torch.constant.int 32
    %83 = torch.aten.div.Scalar %82, %int32_42 : !torch.vtensor<[32],f32>, !torch.int -> !torch.vtensor<[32],f32>
    %float2.000000e00 = torch.constant.float 2.000000e+00
    %84 = torch.aten.mul.Scalar %83, %float2.000000e00 : !torch.vtensor<[32],f32>, !torch.float -> !torch.vtensor<[32],f32>
    %float5.000000e05 = torch.constant.float 5.000000e+05
    %85 = torch.aten.pow.Scalar %float5.000000e05, %84 : !torch.float, !torch.vtensor<[32],f32> -> !torch.vtensor<[32],f32>
    %86 = torch.aten.reciprocal %85 : !torch.vtensor<[32],f32> -> !torch.vtensor<[32],f32>
    %float1.000000e00 = torch.constant.float 1.000000e+00
    %87 = torch.aten.mul.Scalar %86, %float1.000000e00 : !torch.vtensor<[32],f32>, !torch.float -> !torch.vtensor<[32],f32>
    %int1_43 = torch.constant.int 1
    %88 = torch.aten.unsqueeze %79, %int1_43 : !torch.vtensor<[128],si64>, !torch.int -> !torch.vtensor<[128,1],si64>
    %int0_44 = torch.constant.int 0
    %89 = torch.aten.unsqueeze %87, %int0_44 : !torch.vtensor<[32],f32>, !torch.int -> !torch.vtensor<[1,32],f32>
    %90 = torch.aten.mul.Tensor %88, %89 : !torch.vtensor<[128,1],si64>, !torch.vtensor<[1,32],f32> -> !torch.vtensor<[128,32],f32>
    %int6_45 = torch.constant.int 6
    %91 = torch.prims.convert_element_type %90, %int6_45 : !torch.vtensor<[128,32],f32>, !torch.int -> !torch.vtensor<[128,32],f32>
    %int0_46 = torch.constant.int 0
    %int0_47 = torch.constant.int 0
    %int1_48 = torch.constant.int 1
    %92 = torch.aten.slice.Tensor %91, %int0_46, %int0_47, %38, %int1_48 : !torch.vtensor<[128,32],f32>, !torch.int, !torch.int, !torch.int, !torch.int -> !torch.vtensor<[?,32],f32>
    torch.bind_symbolic_shape %92, [%32], affine_map<()[s0] -> (s0 * 32, 32)> : !torch.vtensor<[?,32],f32>
    %int1_49 = torch.constant.int 1
    %int0_50 = torch.constant.int 0
    %int9223372036854775807 = torch.constant.int 9223372036854775807
    %int1_51 = torch.constant.int 1
    %93 = torch.aten.slice.Tensor %92, %int1_49, %int0_50, %int9223372036854775807, %int1_51 : !torch.vtensor<[?,32],f32>, !torch.int, !torch.int, !torch.int, !torch.int -> !torch.vtensor<[?,32],f32>
    torch.bind_symbolic_shape %93, [%32], affine_map<()[s0] -> (s0 * 32, 32)> : !torch.vtensor<[?,32],f32>
    %int1_52 = torch.constant.int 1
    %int0_53 = torch.constant.int 0
    %int9223372036854775807_54 = torch.constant.int 9223372036854775807
    %int1_55 = torch.constant.int 1
    %94 = torch.aten.slice.Tensor %93, %int1_52, %int0_53, %int9223372036854775807_54, %int1_55 : !torch.vtensor<[?,32],f32>, !torch.int, !torch.int, !torch.int, !torch.int -> !torch.vtensor<[?,32],f32>
    torch.bind_symbolic_shape %94, [%32], affine_map<()[s0] -> (s0 * 32, 32)> : !torch.vtensor<[?,32],f32>
    %int0_56 = torch.constant.int 0
    %95 = torch.aten.unsqueeze %94, %int0_56 : !torch.vtensor<[?,32],f32>, !torch.int -> !torch.vtensor<[1,?,32],f32>
    torch.bind_symbolic_shape %95, [%32], affine_map<()[s0] -> (1, s0 * 32, 32)> : !torch.vtensor<[1,?,32],f32>
    %int1_57 = torch.constant.int 1
    %int0_58 = torch.constant.int 0
    %int9223372036854775807_59 = torch.constant.int 9223372036854775807
    %int1_60 = torch.constant.int 1
    %96 = torch.aten.slice.Tensor %95, %int1_57, %int0_58, %int9223372036854775807_59, %int1_60 : !torch.vtensor<[1,?,32],f32>, !torch.int, !torch.int, !torch.int, !torch.int -> !torch.vtensor<[1,?,32],f32>
    torch.bind_symbolic_shape %96, [%32], affine_map<()[s0] -> (1, s0 * 32, 32)> : !torch.vtensor<[1,?,32],f32>
    %int2_61 = torch.constant.int 2
    %int0_62 = torch.constant.int 0
    %int9223372036854775807_63 = torch.constant.int 9223372036854775807
    %int1_64 = torch.constant.int 1
    %97 = torch.aten.slice.Tensor %96, %int2_61, %int0_62, %int9223372036854775807_63, %int1_64 : !torch.vtensor<[1,?,32],f32>, !torch.int, !torch.int, !torch.int, !torch.int -> !torch.vtensor<[1,?,32],f32>
    torch.bind_symbolic_shape %97, [%32], affine_map<()[s0] -> (1, s0 * 32, 32)> : !torch.vtensor<[1,?,32],f32>
    %int1_65 = torch.constant.int 1
    %int1_66 = torch.constant.int 1
    %int1_67 = torch.constant.int 1
    %98 = torch.prim.ListConstruct %int1_65, %int1_66, %int1_67 : (!torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %99 = torch.aten.repeat %97, %98 : !torch.vtensor<[1,?,32],f32>, !torch.list<int> -> !torch.vtensor<[1,?,32],f32>
    torch.bind_symbolic_shape %99, [%32], affine_map<()[s0] -> (1, s0 * 32, 32)> : !torch.vtensor<[1,?,32],f32>
    %int6_68 = torch.constant.int 6
    %100 = torch.prims.convert_element_type %74, %int6_68 : !torch.vtensor<[1,?,8,32],f16>, !torch.int -> !torch.vtensor<[1,?,8,32],f32>
    torch.bind_symbolic_shape %100, [%32], affine_map<()[s0] -> (1, s0 * 32, 8, 32)> : !torch.vtensor<[1,?,8,32],f32>
    %101 = torch_c.to_builtin_tensor %100 : !torch.vtensor<[1,?,8,32],f32> -> tensor<1x?x8x32xf32>
    %102 = torch_c.to_builtin_tensor %99 : !torch.vtensor<[1,?,32],f32> -> tensor<1x?x32xf32>
    %103 = util.call @sharktank_rotary_embedding_1_D_8_32_f32(%101, %102) : (tensor<1x?x8x32xf32>, tensor<1x?x32xf32>) -> tensor<1x?x8x32xf32>
    %104 = torch_c.from_builtin_tensor %103 : tensor<1x?x8x32xf32> -> !torch.vtensor<[1,?,8,32],f32>
    torch.bind_symbolic_shape %104, [%32], affine_map<()[s0] -> (1, s0 * 32, 8, 32)> : !torch.vtensor<[1,?,8,32],f32>
    %int5_69 = torch.constant.int 5
    %105 = torch.prims.convert_element_type %104, %int5_69 : !torch.vtensor<[1,?,8,32],f32>, !torch.int -> !torch.vtensor<[1,?,8,32],f16>
    torch.bind_symbolic_shape %105, [%32], affine_map<()[s0] -> (1, s0 * 32, 8, 32)> : !torch.vtensor<[1,?,8,32],f16>
    %int128_70 = torch.constant.int 128
    %none_71 = torch.constant.none
    %none_72 = torch.constant.none
    %cpu_73 = torch.constant.device "cpu"
    %false_74 = torch.constant.bool false
    %106 = torch.aten.arange %int128_70, %none_71, %none_72, %cpu_73, %false_74 : !torch.int, !torch.none, !torch.none, !torch.Device, !torch.bool -> !torch.vtensor<[128],si64>
    %int0_75 = torch.constant.int 0
    %int32_76 = torch.constant.int 32
    %none_77 = torch.constant.none
    %none_78 = torch.constant.none
    %cpu_79 = torch.constant.device "cpu"
    %false_80 = torch.constant.bool false
    %107 = torch.aten.arange.start %int0_75, %int32_76, %none_77, %none_78, %cpu_79, %false_80 : !torch.int, !torch.int, !torch.none, !torch.none, !torch.Device, !torch.bool -> !torch.vtensor<[32],si64>
    %int2_81 = torch.constant.int 2
    %108 = torch.aten.floor_divide.Scalar %107, %int2_81 : !torch.vtensor<[32],si64>, !torch.int -> !torch.vtensor<[32],si64>
    %int6_82 = torch.constant.int 6
    %109 = torch.prims.convert_element_type %108, %int6_82 : !torch.vtensor<[32],si64>, !torch.int -> !torch.vtensor<[32],f32>
    %int32_83 = torch.constant.int 32
    %110 = torch.aten.div.Scalar %109, %int32_83 : !torch.vtensor<[32],f32>, !torch.int -> !torch.vtensor<[32],f32>
    %float2.000000e00_84 = torch.constant.float 2.000000e+00
    %111 = torch.aten.mul.Scalar %110, %float2.000000e00_84 : !torch.vtensor<[32],f32>, !torch.float -> !torch.vtensor<[32],f32>
    %float5.000000e05_85 = torch.constant.float 5.000000e+05
    %112 = torch.aten.pow.Scalar %float5.000000e05_85, %111 : !torch.float, !torch.vtensor<[32],f32> -> !torch.vtensor<[32],f32>
    %113 = torch.aten.reciprocal %112 : !torch.vtensor<[32],f32> -> !torch.vtensor<[32],f32>
    %float1.000000e00_86 = torch.constant.float 1.000000e+00
    %114 = torch.aten.mul.Scalar %113, %float1.000000e00_86 : !torch.vtensor<[32],f32>, !torch.float -> !torch.vtensor<[32],f32>
    %int1_87 = torch.constant.int 1
    %115 = torch.aten.unsqueeze %106, %int1_87 : !torch.vtensor<[128],si64>, !torch.int -> !torch.vtensor<[128,1],si64>
    %int0_88 = torch.constant.int 0
    %116 = torch.aten.unsqueeze %114, %int0_88 : !torch.vtensor<[32],f32>, !torch.int -> !torch.vtensor<[1,32],f32>
    %117 = torch.aten.mul.Tensor %115, %116 : !torch.vtensor<[128,1],si64>, !torch.vtensor<[1,32],f32> -> !torch.vtensor<[128,32],f32>
    %int6_89 = torch.constant.int 6
    %118 = torch.prims.convert_element_type %117, %int6_89 : !torch.vtensor<[128,32],f32>, !torch.int -> !torch.vtensor<[128,32],f32>
    %int0_90 = torch.constant.int 0
    %int0_91 = torch.constant.int 0
    %int1_92 = torch.constant.int 1
    %119 = torch.aten.slice.Tensor %118, %int0_90, %int0_91, %38, %int1_92 : !torch.vtensor<[128,32],f32>, !torch.int, !torch.int, !torch.int, !torch.int -> !torch.vtensor<[?,32],f32>
    torch.bind_symbolic_shape %119, [%32], affine_map<()[s0] -> (s0 * 32, 32)> : !torch.vtensor<[?,32],f32>
    %int1_93 = torch.constant.int 1
    %int0_94 = torch.constant.int 0
    %int9223372036854775807_95 = torch.constant.int 9223372036854775807
    %int1_96 = torch.constant.int 1
    %120 = torch.aten.slice.Tensor %119, %int1_93, %int0_94, %int9223372036854775807_95, %int1_96 : !torch.vtensor<[?,32],f32>, !torch.int, !torch.int, !torch.int, !torch.int -> !torch.vtensor<[?,32],f32>
    torch.bind_symbolic_shape %120, [%32], affine_map<()[s0] -> (s0 * 32, 32)> : !torch.vtensor<[?,32],f32>
    %int1_97 = torch.constant.int 1
    %int0_98 = torch.constant.int 0
    %int9223372036854775807_99 = torch.constant.int 9223372036854775807
    %int1_100 = torch.constant.int 1
    %121 = torch.aten.slice.Tensor %120, %int1_97, %int0_98, %int9223372036854775807_99, %int1_100 : !torch.vtensor<[?,32],f32>, !torch.int, !torch.int, !torch.int, !torch.int -> !torch.vtensor<[?,32],f32>
    torch.bind_symbolic_shape %121, [%32], affine_map<()[s0] -> (s0 * 32, 32)> : !torch.vtensor<[?,32],f32>
    %int0_101 = torch.constant.int 0
    %122 = torch.aten.unsqueeze %121, %int0_101 : !torch.vtensor<[?,32],f32>, !torch.int -> !torch.vtensor<[1,?,32],f32>
    torch.bind_symbolic_shape %122, [%32], affine_map<()[s0] -> (1, s0 * 32, 32)> : !torch.vtensor<[1,?,32],f32>
    %int1_102 = torch.constant.int 1
    %int0_103 = torch.constant.int 0
    %int9223372036854775807_104 = torch.constant.int 9223372036854775807
    %int1_105 = torch.constant.int 1
    %123 = torch.aten.slice.Tensor %122, %int1_102, %int0_103, %int9223372036854775807_104, %int1_105 : !torch.vtensor<[1,?,32],f32>, !torch.int, !torch.int, !torch.int, !torch.int -> !torch.vtensor<[1,?,32],f32>
    torch.bind_symbolic_shape %123, [%32], affine_map<()[s0] -> (1, s0 * 32, 32)> : !torch.vtensor<[1,?,32],f32>
    %int2_106 = torch.constant.int 2
    %int0_107 = torch.constant.int 0
    %int9223372036854775807_108 = torch.constant.int 9223372036854775807
    %int1_109 = torch.constant.int 1
    %124 = torch.aten.slice.Tensor %123, %int2_106, %int0_107, %int9223372036854775807_108, %int1_109 : !torch.vtensor<[1,?,32],f32>, !torch.int, !torch.int, !torch.int, !torch.int -> !torch.vtensor<[1,?,32],f32>
    torch.bind_symbolic_shape %124, [%32], affine_map<()[s0] -> (1, s0 * 32, 32)> : !torch.vtensor<[1,?,32],f32>
    %int1_110 = torch.constant.int 1
    %int1_111 = torch.constant.int 1
    %int1_112 = torch.constant.int 1
    %125 = torch.prim.ListConstruct %int1_110, %int1_111, %int1_112 : (!torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %126 = torch.aten.repeat %124, %125 : !torch.vtensor<[1,?,32],f32>, !torch.list<int> -> !torch.vtensor<[1,?,32],f32>
    torch.bind_symbolic_shape %126, [%32], affine_map<()[s0] -> (1, s0 * 32, 32)> : !torch.vtensor<[1,?,32],f32>
    %int6_113 = torch.constant.int 6
    %127 = torch.prims.convert_element_type %76, %int6_113 : !torch.vtensor<[1,?,4,32],f16>, !torch.int -> !torch.vtensor<[1,?,4,32],f32>
    torch.bind_symbolic_shape %127, [%32], affine_map<()[s0] -> (1, s0 * 32, 4, 32)> : !torch.vtensor<[1,?,4,32],f32>
    %128 = torch_c.to_builtin_tensor %127 : !torch.vtensor<[1,?,4,32],f32> -> tensor<1x?x4x32xf32>
    %129 = torch_c.to_builtin_tensor %126 : !torch.vtensor<[1,?,32],f32> -> tensor<1x?x32xf32>
    %130 = util.call @sharktank_rotary_embedding_1_D_4_32_f32(%128, %129) : (tensor<1x?x4x32xf32>, tensor<1x?x32xf32>) -> tensor<1x?x4x32xf32>
    %131 = torch_c.from_builtin_tensor %130 : tensor<1x?x4x32xf32> -> !torch.vtensor<[1,?,4,32],f32>
    torch.bind_symbolic_shape %131, [%32], affine_map<()[s0] -> (1, s0 * 32, 4, 32)> : !torch.vtensor<[1,?,4,32],f32>
    %int5_114 = torch.constant.int 5
    %132 = torch.prims.convert_element_type %131, %int5_114 : !torch.vtensor<[1,?,4,32],f32>, !torch.int -> !torch.vtensor<[1,?,4,32],f16>
    torch.bind_symbolic_shape %132, [%32], affine_map<()[s0] -> (1, s0 * 32, 4, 32)> : !torch.vtensor<[1,?,4,32],f16>
    %int3 = torch.constant.int 3
    %int2_115 = torch.constant.int 2
    %int32_116 = torch.constant.int 32
    %int4_117 = torch.constant.int 4
    %int32_118 = torch.constant.int 32
    %133 = torch.prim.ListConstruct %35, %int3, %int2_115, %int32_116, %int4_117, %int32_118 : (!torch.int, !torch.int, !torch.int, !torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %134 = torch.aten.view %30, %133 : !torch.vtensor<[?,24576],f16>, !torch.list<int> -> !torch.vtensor<[?,3,2,32,4,32],f16>
    torch.bind_symbolic_shape %134, [%33], affine_map<()[s0] -> (s0, 3, 2, 32, 4, 32)> : !torch.vtensor<[?,3,2,32,4,32],f16>
    %int3_119 = torch.constant.int 3
    %135 = torch.aten.mul.int %35, %int3_119 : !torch.int, !torch.int -> !torch.int
    %int2_120 = torch.constant.int 2
    %136 = torch.aten.mul.int %135, %int2_120 : !torch.int, !torch.int -> !torch.int
    %int32_121 = torch.constant.int 32
    %int4_122 = torch.constant.int 4
    %int32_123 = torch.constant.int 32
    %137 = torch.prim.ListConstruct %136, %int32_121, %int4_122, %int32_123 : (!torch.int, !torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %138 = torch.aten.view %134, %137 : !torch.vtensor<[?,3,2,32,4,32],f16>, !torch.list<int> -> !torch.vtensor<[?,32,4,32],f16>
    torch.bind_symbolic_shape %138, [%33], affine_map<()[s0] -> (s0 * 6, 32, 4, 32)> : !torch.vtensor<[?,32,4,32],f16>
    %int6_124 = torch.constant.int 6
    %139 = torch.aten.mul.Scalar %arg2, %int6_124 : !torch.vtensor<[1,?],si64>, !torch.int -> !torch.vtensor<[1,?],si64>
    torch.bind_symbolic_shape %139, [%32], affine_map<()[s0] -> (1, s0)> : !torch.vtensor<[1,?],si64>
    %int0_125 = torch.constant.int 0
    %int1_126 = torch.constant.int 1
    %140 = torch.aten.add.Scalar %139, %int0_125, %int1_126 : !torch.vtensor<[1,?],si64>, !torch.int, !torch.int -> !torch.vtensor<[1,?],si64>
    torch.bind_symbolic_shape %140, [%32], affine_map<()[s0] -> (1, s0)> : !torch.vtensor<[1,?],si64>
    %int1_127 = torch.constant.int 1
    %int32_128 = torch.constant.int 32
    %int4_129 = torch.constant.int 4
    %int32_130 = torch.constant.int 32
    %141 = torch.prim.ListConstruct %int1_127, %34, %int32_128, %int4_129, %int32_130 : (!torch.int, !torch.int, !torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %142 = torch.aten.view %132, %141 : !torch.vtensor<[1,?,4,32],f16>, !torch.list<int> -> !torch.vtensor<[1,?,32,4,32],f16>
    torch.bind_symbolic_shape %142, [%32], affine_map<()[s0] -> (1, s0, 32, 4, 32)> : !torch.vtensor<[1,?,32,4,32],f16>
    %int32_131 = torch.constant.int 32
    %int4_132 = torch.constant.int 4
    %int32_133 = torch.constant.int 32
    %143 = torch.prim.ListConstruct %34, %int32_131, %int4_132, %int32_133 : (!torch.int, !torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %144 = torch.aten.view %142, %143 : !torch.vtensor<[1,?,32,4,32],f16>, !torch.list<int> -> !torch.vtensor<[?,32,4,32],f16>
    torch.bind_symbolic_shape %144, [%32], affine_map<()[s0] -> (s0, 32, 4, 32)> : !torch.vtensor<[?,32,4,32],f16>
    %145 = torch.prim.ListConstruct %34 : (!torch.int) -> !torch.list<int>
    %146 = torch.aten.view %140, %145 : !torch.vtensor<[1,?],si64>, !torch.list<int> -> !torch.vtensor<[?],si64>
    torch.bind_symbolic_shape %146, [%32], affine_map<()[s0] -> (s0)> : !torch.vtensor<[?],si64>
    %int5_134 = torch.constant.int 5
    %147 = torch.prims.convert_element_type %144, %int5_134 : !torch.vtensor<[?,32,4,32],f16>, !torch.int -> !torch.vtensor<[?,32,4,32],f16>
    torch.bind_symbolic_shape %147, [%32], affine_map<()[s0] -> (s0, 32, 4, 32)> : !torch.vtensor<[?,32,4,32],f16>
    %148 = torch.prim.ListConstruct %146 : (!torch.vtensor<[?],si64>) -> !torch.list<optional<vtensor>>
    %false_135 = torch.constant.bool false
    %149 = torch.aten.index_put %138, %148, %147, %false_135 : !torch.vtensor<[?,32,4,32],f16>, !torch.list<optional<vtensor>>, !torch.vtensor<[?,32,4,32],f16>, !torch.bool -> !torch.vtensor<[?,32,4,32],f16>
    torch.bind_symbolic_shape %149, [%33], affine_map<()[s0] -> (s0 * 6, 32, 4, 32)> : !torch.vtensor<[?,32,4,32],f16>
    %int3_136 = torch.constant.int 3
    %int2_137 = torch.constant.int 2
    %int32_138 = torch.constant.int 32
    %int4_139 = torch.constant.int 4
    %int32_140 = torch.constant.int 32
    %150 = torch.prim.ListConstruct %35, %int3_136, %int2_137, %int32_138, %int4_139, %int32_140 : (!torch.int, !torch.int, !torch.int, !torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %151 = torch.aten.view %149, %150 : !torch.vtensor<[?,32,4,32],f16>, !torch.list<int> -> !torch.vtensor<[?,3,2,32,4,32],f16>
    torch.bind_symbolic_shape %151, [%33], affine_map<()[s0] -> (s0, 3, 2, 32, 4, 32)> : !torch.vtensor<[?,3,2,32,4,32],f16>
    %int24576 = torch.constant.int 24576
    %152 = torch.prim.ListConstruct %35, %int24576 : (!torch.int, !torch.int) -> !torch.list<int>
    %153 = torch.aten.view %151, %152 : !torch.vtensor<[?,3,2,32,4,32],f16>, !torch.list<int> -> !torch.vtensor<[?,24576],f16>
    torch.bind_symbolic_shape %153, [%33], affine_map<()[s0] -> (s0, 24576)> : !torch.vtensor<[?,24576],f16>
    %int3_141 = torch.constant.int 3
    %int2_142 = torch.constant.int 2
    %int32_143 = torch.constant.int 32
    %int4_144 = torch.constant.int 4
    %int32_145 = torch.constant.int 32
    %154 = torch.prim.ListConstruct %35, %int3_141, %int2_142, %int32_143, %int4_144, %int32_145 : (!torch.int, !torch.int, !torch.int, !torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %155 = torch.aten.view %153, %154 : !torch.vtensor<[?,24576],f16>, !torch.list<int> -> !torch.vtensor<[?,3,2,32,4,32],f16>
    torch.bind_symbolic_shape %155, [%33], affine_map<()[s0] -> (s0, 3, 2, 32, 4, 32)> : !torch.vtensor<[?,3,2,32,4,32],f16>
    %int32_146 = torch.constant.int 32
    %int4_147 = torch.constant.int 4
    %int32_148 = torch.constant.int 32
    %156 = torch.prim.ListConstruct %136, %int32_146, %int4_147, %int32_148 : (!torch.int, !torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %157 = torch.aten.view %155, %156 : !torch.vtensor<[?,3,2,32,4,32],f16>, !torch.list<int> -> !torch.vtensor<[?,32,4,32],f16>
    torch.bind_symbolic_shape %157, [%33], affine_map<()[s0] -> (s0 * 6, 32, 4, 32)> : !torch.vtensor<[?,32,4,32],f16>
    %int1_149 = torch.constant.int 1
    %int32_150 = torch.constant.int 32
    %int4_151 = torch.constant.int 4
    %int32_152 = torch.constant.int 32
    %158 = torch.prim.ListConstruct %int1_149, %34, %int32_150, %int4_151, %int32_152 : (!torch.int, !torch.int, !torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %159 = torch.aten.view %78, %158 : !torch.vtensor<[1,?,4,32],f16>, !torch.list<int> -> !torch.vtensor<[1,?,32,4,32],f16>
    torch.bind_symbolic_shape %159, [%32], affine_map<()[s0] -> (1, s0, 32, 4, 32)> : !torch.vtensor<[1,?,32,4,32],f16>
    %int32_153 = torch.constant.int 32
    %int4_154 = torch.constant.int 4
    %int32_155 = torch.constant.int 32
    %160 = torch.prim.ListConstruct %34, %int32_153, %int4_154, %int32_155 : (!torch.int, !torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %161 = torch.aten.view %159, %160 : !torch.vtensor<[1,?,32,4,32],f16>, !torch.list<int> -> !torch.vtensor<[?,32,4,32],f16>
    torch.bind_symbolic_shape %161, [%32], affine_map<()[s0] -> (s0, 32, 4, 32)> : !torch.vtensor<[?,32,4,32],f16>
    %int1_156 = torch.constant.int 1
    %int1_157 = torch.constant.int 1
    %162 = torch.aten.add.Scalar %140, %int1_156, %int1_157 : !torch.vtensor<[1,?],si64>, !torch.int, !torch.int -> !torch.vtensor<[1,?],si64>
    torch.bind_symbolic_shape %162, [%32], affine_map<()[s0] -> (1, s0)> : !torch.vtensor<[1,?],si64>
    %163 = torch.prim.ListConstruct %34 : (!torch.int) -> !torch.list<int>
    %164 = torch.aten.view %162, %163 : !torch.vtensor<[1,?],si64>, !torch.list<int> -> !torch.vtensor<[?],si64>
    torch.bind_symbolic_shape %164, [%32], affine_map<()[s0] -> (s0)> : !torch.vtensor<[?],si64>
    %int5_158 = torch.constant.int 5
    %165 = torch.prims.convert_element_type %161, %int5_158 : !torch.vtensor<[?,32,4,32],f16>, !torch.int -> !torch.vtensor<[?,32,4,32],f16>
    torch.bind_symbolic_shape %165, [%32], affine_map<()[s0] -> (s0, 32, 4, 32)> : !torch.vtensor<[?,32,4,32],f16>
    %166 = torch.prim.ListConstruct %164 : (!torch.vtensor<[?],si64>) -> !torch.list<optional<vtensor>>
    %false_159 = torch.constant.bool false
    %167 = torch.aten.index_put %157, %166, %165, %false_159 : !torch.vtensor<[?,32,4,32],f16>, !torch.list<optional<vtensor>>, !torch.vtensor<[?,32,4,32],f16>, !torch.bool -> !torch.vtensor<[?,32,4,32],f16>
    torch.bind_symbolic_shape %167, [%33], affine_map<()[s0] -> (s0 * 6, 32, 4, 32)> : !torch.vtensor<[?,32,4,32],f16>
    %int3_160 = torch.constant.int 3
    %int2_161 = torch.constant.int 2
    %int32_162 = torch.constant.int 32
    %int4_163 = torch.constant.int 4
    %int32_164 = torch.constant.int 32
    %168 = torch.prim.ListConstruct %35, %int3_160, %int2_161, %int32_162, %int4_163, %int32_164 : (!torch.int, !torch.int, !torch.int, !torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %169 = torch.aten.view %167, %168 : !torch.vtensor<[?,32,4,32],f16>, !torch.list<int> -> !torch.vtensor<[?,3,2,32,4,32],f16>
    torch.bind_symbolic_shape %169, [%33], affine_map<()[s0] -> (s0, 3, 2, 32, 4, 32)> : !torch.vtensor<[?,3,2,32,4,32],f16>
    %int24576_165 = torch.constant.int 24576
    %170 = torch.prim.ListConstruct %35, %int24576_165 : (!torch.int, !torch.int) -> !torch.list<int>
    %171 = torch.aten.view %169, %170 : !torch.vtensor<[?,3,2,32,4,32],f16>, !torch.list<int> -> !torch.vtensor<[?,24576],f16>
    torch.bind_symbolic_shape %171, [%33], affine_map<()[s0] -> (s0, 24576)> : !torch.vtensor<[?,24576],f16>
    %int-2_166 = torch.constant.int -2
    %172 = torch.aten.unsqueeze %132, %int-2_166 : !torch.vtensor<[1,?,4,32],f16>, !torch.int -> !torch.vtensor<[1,?,4,1,32],f16>
    torch.bind_symbolic_shape %172, [%32], affine_map<()[s0] -> (1, s0 * 32, 4, 1, 32)> : !torch.vtensor<[1,?,4,1,32],f16>
    %int1_167 = torch.constant.int 1
    %int4_168 = torch.constant.int 4
    %int2_169 = torch.constant.int 2
    %int32_170 = torch.constant.int 32
    %173 = torch.prim.ListConstruct %int1_167, %38, %int4_168, %int2_169, %int32_170 : (!torch.int, !torch.int, !torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %false_171 = torch.constant.bool false
    %174 = torch.aten.expand %172, %173, %false_171 : !torch.vtensor<[1,?,4,1,32],f16>, !torch.list<int>, !torch.bool -> !torch.vtensor<[1,?,4,2,32],f16>
    torch.bind_symbolic_shape %174, [%32], affine_map<()[s0] -> (1, s0 * 32, 4, 2, 32)> : !torch.vtensor<[1,?,4,2,32],f16>
    %int0_172 = torch.constant.int 0
    %175 = torch.aten.clone %174, %int0_172 : !torch.vtensor<[1,?,4,2,32],f16>, !torch.int -> !torch.vtensor<[1,?,4,2,32],f16>
    torch.bind_symbolic_shape %175, [%32], affine_map<()[s0] -> (1, s0 * 32, 4, 2, 32)> : !torch.vtensor<[1,?,4,2,32],f16>
    %int1_173 = torch.constant.int 1
    %int8_174 = torch.constant.int 8
    %int32_175 = torch.constant.int 32
    %176 = torch.prim.ListConstruct %int1_173, %38, %int8_174, %int32_175 : (!torch.int, !torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %177 = torch.aten._unsafe_view %175, %176 : !torch.vtensor<[1,?,4,2,32],f16>, !torch.list<int> -> !torch.vtensor<[1,?,8,32],f16>
    torch.bind_symbolic_shape %177, [%32], affine_map<()[s0] -> (1, s0 * 32, 8, 32)> : !torch.vtensor<[1,?,8,32],f16>
    %int-2_176 = torch.constant.int -2
    %178 = torch.aten.unsqueeze %78, %int-2_176 : !torch.vtensor<[1,?,4,32],f16>, !torch.int -> !torch.vtensor<[1,?,4,1,32],f16>
    torch.bind_symbolic_shape %178, [%32], affine_map<()[s0] -> (1, s0 * 32, 4, 1, 32)> : !torch.vtensor<[1,?,4,1,32],f16>
    %int1_177 = torch.constant.int 1
    %int4_178 = torch.constant.int 4
    %int2_179 = torch.constant.int 2
    %int32_180 = torch.constant.int 32
    %179 = torch.prim.ListConstruct %int1_177, %38, %int4_178, %int2_179, %int32_180 : (!torch.int, !torch.int, !torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %false_181 = torch.constant.bool false
    %180 = torch.aten.expand %178, %179, %false_181 : !torch.vtensor<[1,?,4,1,32],f16>, !torch.list<int>, !torch.bool -> !torch.vtensor<[1,?,4,2,32],f16>
    torch.bind_symbolic_shape %180, [%32], affine_map<()[s0] -> (1, s0 * 32, 4, 2, 32)> : !torch.vtensor<[1,?,4,2,32],f16>
    %int0_182 = torch.constant.int 0
    %181 = torch.aten.clone %180, %int0_182 : !torch.vtensor<[1,?,4,2,32],f16>, !torch.int -> !torch.vtensor<[1,?,4,2,32],f16>
    torch.bind_symbolic_shape %181, [%32], affine_map<()[s0] -> (1, s0 * 32, 4, 2, 32)> : !torch.vtensor<[1,?,4,2,32],f16>
    %int1_183 = torch.constant.int 1
    %int8_184 = torch.constant.int 8
    %int32_185 = torch.constant.int 32
    %182 = torch.prim.ListConstruct %int1_183, %38, %int8_184, %int32_185 : (!torch.int, !torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %183 = torch.aten._unsafe_view %181, %182 : !torch.vtensor<[1,?,4,2,32],f16>, !torch.list<int> -> !torch.vtensor<[1,?,8,32],f16>
    torch.bind_symbolic_shape %183, [%32], affine_map<()[s0] -> (1, s0 * 32, 8, 32)> : !torch.vtensor<[1,?,8,32],f16>
    %int1_186 = torch.constant.int 1
    %int2_187 = torch.constant.int 2
    %184 = torch.aten.transpose.int %105, %int1_186, %int2_187 : !torch.vtensor<[1,?,8,32],f16>, !torch.int, !torch.int -> !torch.vtensor<[1,8,?,32],f16>
    torch.bind_symbolic_shape %184, [%32], affine_map<()[s0] -> (1, 8, s0 * 32, 32)> : !torch.vtensor<[1,8,?,32],f16>
    %int1_188 = torch.constant.int 1
    %int2_189 = torch.constant.int 2
    %185 = torch.aten.transpose.int %177, %int1_188, %int2_189 : !torch.vtensor<[1,?,8,32],f16>, !torch.int, !torch.int -> !torch.vtensor<[1,8,?,32],f16>
    torch.bind_symbolic_shape %185, [%32], affine_map<()[s0] -> (1, 8, s0 * 32, 32)> : !torch.vtensor<[1,8,?,32],f16>
    %int1_190 = torch.constant.int 1
    %int2_191 = torch.constant.int 2
    %186 = torch.aten.transpose.int %183, %int1_190, %int2_191 : !torch.vtensor<[1,?,8,32],f16>, !torch.int, !torch.int -> !torch.vtensor<[1,8,?,32],f16>
    torch.bind_symbolic_shape %186, [%32], affine_map<()[s0] -> (1, 8, s0 * 32, 32)> : !torch.vtensor<[1,8,?,32],f16>
    %int5_192 = torch.constant.int 5
    %187 = torch.prims.convert_element_type %184, %int5_192 : !torch.vtensor<[1,8,?,32],f16>, !torch.int -> !torch.vtensor<[1,8,?,32],f16>
    torch.bind_symbolic_shape %187, [%32], affine_map<()[s0] -> (1, 8, s0 * 32, 32)> : !torch.vtensor<[1,8,?,32],f16>
    %int5_193 = torch.constant.int 5
    %188 = torch.prims.convert_element_type %185, %int5_193 : !torch.vtensor<[1,8,?,32],f16>, !torch.int -> !torch.vtensor<[1,8,?,32],f16>
    torch.bind_symbolic_shape %188, [%32], affine_map<()[s0] -> (1, 8, s0 * 32, 32)> : !torch.vtensor<[1,8,?,32],f16>
    %int5_194 = torch.constant.int 5
    %189 = torch.prims.convert_element_type %186, %int5_194 : !torch.vtensor<[1,8,?,32],f16>, !torch.int -> !torch.vtensor<[1,8,?,32],f16>
