#map = affine_map<(d0, d1, d2, d3) -> (d0, d1, d3)>
#map1 = affine_map<(d0, d1, d2, d3) -> (d0, d1, d2, d3)>
module @module {
  util.global private @__auto.token_embd.weight = #stream.parameter.named<"model"::"token_embd.weight"> : tensor<256x256xf32>
  util.global private @__auto.blk.0.attn_norm.weight = #stream.parameter.named<"model"::"blk.0.attn_norm.weight"> : tensor<256xf32>
  util.global private @__auto.blk.0.attn_q.weight = #stream.parameter.named<"model"::"blk.0.attn_q.weight"> : tensor<256x256xf32>
  util.global private @__auto.blk.0.attn_k.weight = #stream.parameter.named<"model"::"blk.0.attn_k.weight"> : tensor<128x256xf32>
  util.global private @__auto.blk.0.attn_v.weight = #stream.parameter.named<"model"::"blk.0.attn_v.weight"> : tensor<128x256xf32>
  util.global private @__auto.blk.0.attn_output.weight = #stream.parameter.named<"model"::"blk.0.attn_output.weight"> : tensor<256x256xf32>
  util.global private @__auto.blk.0.ffn_norm.weight = #stream.parameter.named<"model"::"blk.0.ffn_norm.weight"> : tensor<256xf32>
  util.global private @__auto.blk.0.ffn_gate.weight = #stream.parameter.named<"model"::"blk.0.ffn_gate.weight"> : tensor<23x256xf32>
  util.global private @__auto.blk.0.ffn_up.weight = #stream.parameter.named<"model"::"blk.0.ffn_up.weight"> : tensor<23x256xf32>
  util.global private @__auto.blk.0.ffn_down.weight = #stream.parameter.named<"model"::"blk.0.ffn_down.weight"> : tensor<256x23xf32>
  util.global private @__auto.blk.1.attn_norm.weight = #stream.parameter.named<"model"::"blk.1.attn_norm.weight"> : tensor<256xf32>
  util.global private @__auto.blk.1.attn_q.weight = #stream.parameter.named<"model"::"blk.1.attn_q.weight"> : tensor<256x256xf32>
  util.global private @__auto.blk.1.attn_k.weight = #stream.parameter.named<"model"::"blk.1.attn_k.weight"> : tensor<128x256xf32>
  util.global private @__auto.blk.1.attn_v.weight = #stream.parameter.named<"model"::"blk.1.attn_v.weight"> : tensor<128x256xf32>
  util.global private @__auto.blk.1.attn_output.weight = #stream.parameter.named<"model"::"blk.1.attn_output.weight"> : tensor<256x256xf32>
  util.global private @__auto.blk.1.ffn_norm.weight = #stream.parameter.named<"model"::"blk.1.ffn_norm.weight"> : tensor<256xf32>
  util.global private @__auto.blk.1.ffn_gate.weight = #stream.parameter.named<"model"::"blk.1.ffn_gate.weight"> : tensor<23x256xf32>
  util.global private @__auto.blk.1.ffn_up.weight = #stream.parameter.named<"model"::"blk.1.ffn_up.weight"> : tensor<23x256xf32>
  util.global private @__auto.blk.1.ffn_down.weight = #stream.parameter.named<"model"::"blk.1.ffn_down.weight"> : tensor<256x23xf32>
  util.global private @__auto.blk.2.attn_norm.weight = #stream.parameter.named<"model"::"blk.2.attn_norm.weight"> : tensor<256xf32>
  util.global private @__auto.blk.2.attn_q.weight = #stream.parameter.named<"model"::"blk.2.attn_q.weight"> : tensor<256x256xf32>
  util.global private @__auto.blk.2.attn_k.weight = #stream.parameter.named<"model"::"blk.2.attn_k.weight"> : tensor<128x256xf32>
  util.global private @__auto.blk.2.attn_v.weight = #stream.parameter.named<"model"::"blk.2.attn_v.weight"> : tensor<128x256xf32>
  util.global private @__auto.blk.2.attn_output.weight = #stream.parameter.named<"model"::"blk.2.attn_output.weight"> : tensor<256x256xf32>
  util.global private @__auto.blk.2.ffn_norm.weight = #stream.parameter.named<"model"::"blk.2.ffn_norm.weight"> : tensor<256xf32>
  util.global private @__auto.blk.2.ffn_gate.weight = #stream.parameter.named<"model"::"blk.2.ffn_gate.weight"> : tensor<23x256xf32>
  util.global private @__auto.blk.2.ffn_up.weight = #stream.parameter.named<"model"::"blk.2.ffn_up.weight"> : tensor<23x256xf32>
  util.global private @__auto.blk.2.ffn_down.weight = #stream.parameter.named<"model"::"blk.2.ffn_down.weight"> : tensor<256x23xf32>
  util.global private @__auto.output_norm.weight = #stream.parameter.named<"model"::"output_norm.weight"> : tensor<1x256xf32>
  util.global private @__auto.output.weight = #stream.parameter.named<"model"::"output.weight"> : tensor<256x256xf32>
  func.func @prefill_bs1(%arg0: !torch.vtensor<[1,?],si64>, %arg1: !torch.vtensor<[1],si64>, %arg2: !torch.vtensor<[1,?],si64>, %arg3: !torch.tensor<[?,24576],f16>) -> !torch.vtensor<[1,?,256],f16> attributes {torch.assume_strict_symbolic_shapes} {
    %__auto.token_embd.weight = util.global.load @__auto.token_embd.weight : tensor<256x256xf32>
    %0 = torch_c.from_builtin_tensor %__auto.token_embd.weight : tensor<256x256xf32> -> !torch.vtensor<[256,256],f32>
    %__auto.blk.0.attn_norm.weight = util.global.load @__auto.blk.0.attn_norm.weight : tensor<256xf32>
    %1 = torch_c.from_builtin_tensor %__auto.blk.0.attn_norm.weight : tensor<256xf32> -> !torch.vtensor<[256],f32>
    %__auto.blk.0.attn_q.weight = util.global.load @__auto.blk.0.attn_q.weight : tensor<256x256xf32>
    %2 = torch_c.from_builtin_tensor %__auto.blk.0.attn_q.weight : tensor<256x256xf32> -> !torch.vtensor<[256,256],f32>
    %__auto.blk.0.attn_k.weight = util.global.load @__auto.blk.0.attn_k.weight : tensor<128x256xf32>
    %3 = torch_c.from_builtin_tensor %__auto.blk.0.attn_k.weight : tensor<128x256xf32> -> !torch.vtensor<[128,256],f32>
    %__auto.blk.0.attn_v.weight = util.global.load @__auto.blk.0.attn_v.weight : tensor<128x256xf32>
    %4 = torch_c.from_builtin_tensor %__auto.blk.0.attn_v.weight : tensor<128x256xf32> -> !torch.vtensor<[128,256],f32>
    %__auto.blk.0.attn_output.weight = util.global.load @__auto.blk.0.attn_output.weight : tensor<256x256xf32>
    %5 = torch_c.from_builtin_tensor %__auto.blk.0.attn_output.weight : tensor<256x256xf32> -> !torch.vtensor<[256,256],f32>
    %__auto.blk.0.ffn_norm.weight = util.global.load @__auto.blk.0.ffn_norm.weight : tensor<256xf32>
    %6 = torch_c.from_builtin_tensor %__auto.blk.0.ffn_norm.weight : tensor<256xf32> -> !torch.vtensor<[256],f32>
    %__auto.blk.0.ffn_gate.weight = util.global.load @__auto.blk.0.ffn_gate.weight : tensor<23x256xf32>
    %7 = torch_c.from_builtin_tensor %__auto.blk.0.ffn_gate.weight : tensor<23x256xf32> -> !torch.vtensor<[23,256],f32>
    %__auto.blk.0.ffn_up.weight = util.global.load @__auto.blk.0.ffn_up.weight : tensor<23x256xf32>
    %8 = torch_c.from_builtin_tensor %__auto.blk.0.ffn_up.weight : tensor<23x256xf32> -> !torch.vtensor<[23,256],f32>
    %__auto.blk.0.ffn_down.weight = util.global.load @__auto.blk.0.ffn_down.weight : tensor<256x23xf32>
    %9 = torch_c.from_builtin_tensor %__auto.blk.0.ffn_down.weight : tensor<256x23xf32> -> !torch.vtensor<[256,23],f32>
    %__auto.blk.1.attn_norm.weight = util.global.load @__auto.blk.1.attn_norm.weight : tensor<256xf32>
    %10 = torch_c.from_builtin_tensor %__auto.blk.1.attn_norm.weight : tensor<256xf32> -> !torch.vtensor<[256],f32>
    %__auto.blk.1.attn_q.weight = util.global.load @__auto.blk.1.attn_q.weight : tensor<256x256xf32>
    %11 = torch_c.from_builtin_tensor %__auto.blk.1.attn_q.weight : tensor<256x256xf32> -> !torch.vtensor<[256,256],f32>
    %__auto.blk.1.attn_k.weight = util.global.load @__auto.blk.1.attn_k.weight : tensor<128x256xf32>
    %12 = torch_c.from_builtin_tensor %__auto.blk.1.attn_k.weight : tensor<128x256xf32> -> !torch.vtensor<[128,256],f32>
    %__auto.blk.1.attn_v.weight = util.global.load @__auto.blk.1.attn_v.weight : tensor<128x256xf32>
    %13 = torch_c.from_builtin_tensor %__auto.blk.1.attn_v.weight : tensor<128x256xf32> -> !torch.vtensor<[128,256],f32>
    %__auto.blk.1.attn_output.weight = util.global.load @__auto.blk.1.attn_output.weight : tensor<256x256xf32>
    %14 = torch_c.from_builtin_tensor %__auto.blk.1.attn_output.weight : tensor<256x256xf32> -> !torch.vtensor<[256,256],f32>
    %__auto.blk.1.ffn_norm.weight = util.global.load @__auto.blk.1.ffn_norm.weight : tensor<256xf32>
    %15 = torch_c.from_builtin_tensor %__auto.blk.1.ffn_norm.weight : tensor<256xf32> -> !torch.vtensor<[256],f32>
    %__auto.blk.1.ffn_gate.weight = util.global.load @__auto.blk.1.ffn_gate.weight : tensor<23x256xf32>
    %16 = torch_c.from_builtin_tensor %__auto.blk.1.ffn_gate.weight : tensor<23x256xf32> -> !torch.vtensor<[23,256],f32>
    %__auto.blk.1.ffn_up.weight = util.global.load @__auto.blk.1.ffn_up.weight : tensor<23x256xf32>
    %17 = torch_c.from_builtin_tensor %__auto.blk.1.ffn_up.weight : tensor<23x256xf32> -> !torch.vtensor<[23,256],f32>
    %__auto.blk.1.ffn_down.weight = util.global.load @__auto.blk.1.ffn_down.weight : tensor<256x23xf32>
    %18 = torch_c.from_builtin_tensor %__auto.blk.1.ffn_down.weight : tensor<256x23xf32> -> !torch.vtensor<[256,23],f32>
    %__auto.blk.2.attn_norm.weight = util.global.load @__auto.blk.2.attn_norm.weight : tensor<256xf32>
    %19 = torch_c.from_builtin_tensor %__auto.blk.2.attn_norm.weight : tensor<256xf32> -> !torch.vtensor<[256],f32>
    %__auto.blk.2.attn_q.weight = util.global.load @__auto.blk.2.attn_q.weight : tensor<256x256xf32>
    %20 = torch_c.from_builtin_tensor %__auto.blk.2.attn_q.weight : tensor<256x256xf32> -> !torch.vtensor<[256,256],f32>
    %__auto.blk.2.attn_k.weight = util.global.load @__auto.blk.2.attn_k.weight : tensor<128x256xf32>
    %21 = torch_c.from_builtin_tensor %__auto.blk.2.attn_k.weight : tensor<128x256xf32> -> !torch.vtensor<[128,256],f32>
    %__auto.blk.2.attn_v.weight = util.global.load @__auto.blk.2.attn_v.weight : tensor<128x256xf32>
    %22 = torch_c.from_builtin_tensor %__auto.blk.2.attn_v.weight : tensor<128x256xf32> -> !torch.vtensor<[128,256],f32>
    %__auto.blk.2.attn_output.weight = util.global.load @__auto.blk.2.attn_output.weight : tensor<256x256xf32>
    %23 = torch_c.from_builtin_tensor %__auto.blk.2.attn_output.weight : tensor<256x256xf32> -> !torch.vtensor<[256,256],f32>
    %__auto.blk.2.ffn_norm.weight = util.global.load @__auto.blk.2.ffn_norm.weight : tensor<256xf32>
    %24 = torch_c.from_builtin_tensor %__auto.blk.2.ffn_norm.weight : tensor<256xf32> -> !torch.vtensor<[256],f32>
    %__auto.blk.2.ffn_gate.weight = util.global.load @__auto.blk.2.ffn_gate.weight : tensor<23x256xf32>
    %25 = torch_c.from_builtin_tensor %__auto.blk.2.ffn_gate.weight : tensor<23x256xf32> -> !torch.vtensor<[23,256],f32>
    %__auto.blk.2.ffn_up.weight = util.global.load @__auto.blk.2.ffn_up.weight : tensor<23x256xf32>
    %26 = torch_c.from_builtin_tensor %__auto.blk.2.ffn_up.weight : tensor<23x256xf32> -> !torch.vtensor<[23,256],f32>
    %__auto.blk.2.ffn_down.weight = util.global.load @__auto.blk.2.ffn_down.weight : tensor<256x23xf32>
    %27 = torch_c.from_builtin_tensor %__auto.blk.2.ffn_down.weight : tensor<256x23xf32> -> !torch.vtensor<[256,23],f32>
    %__auto.output_norm.weight = util.global.load @__auto.output_norm.weight : tensor<1x256xf32>
    %28 = torch_c.from_builtin_tensor %__auto.output_norm.weight : tensor<1x256xf32> -> !torch.vtensor<[1,256],f32>
    %__auto.output.weight = util.global.load @__auto.output.weight : tensor<256x256xf32>
    %29 = torch_c.from_builtin_tensor %__auto.output.weight : tensor<256x256xf32> -> !torch.vtensor<[256,256],f32>
    %30 = torch.copy.to_vtensor %arg3 : !torch.vtensor<[?,24576],f16>
    %31 = torch.symbolic_int "s1" {min_val = 2, max_val = 3} : !torch.int
    %32 = torch.symbolic_int "s2" {min_val = 2, max_val = 9223372036854775806} : !torch.int
    torch.bind_symbolic_shape %arg0, [%31], affine_map<()[s0] -> (1, s0 * 32)> : !torch.vtensor<[1,?],si64>
    torch.bind_symbolic_shape %arg2, [%31], affine_map<()[s0] -> (1, s0)> : !torch.vtensor<[1,?],si64>
    torch.bind_symbolic_shape %30, [%32], affine_map<()[s0] -> (s0, 24576)> : !torch.vtensor<[?,24576],f16>
    %int5 = torch.constant.int 5
    %33 = torch.prims.convert_element_type %0, %int5 : !torch.vtensor<[256,256],f32>, !torch.int -> !torch.vtensor<[256,256],f16>
    %int-1 = torch.constant.int -1
    %false = torch.constant.bool false
    %false_0 = torch.constant.bool false
    %34 = torch.aten.embedding %33, %arg0, %int-1, %false, %false_0 : !torch.vtensor<[256,256],f16>, !torch.vtensor<[1,?],si64>, !torch.int, !torch.bool, !torch.bool -> !torch.vtensor<[1,?,256],f16>
    torch.bind_symbolic_shape %34, [%31], affine_map<()[s0] -> (1, s0 * 32, 256)> : !torch.vtensor<[1,?,256],f16>
    %int6 = torch.constant.int 6
    %35 = torch.prims.convert_element_type %34, %int6 : !torch.vtensor<[1,?,256],f16>, !torch.int -> !torch.vtensor<[1,?,256],f32>
    torch.bind_symbolic_shape %35, [%31], affine_map<()[s0] -> (1, s0 * 32, 256)> : !torch.vtensor<[1,?,256],f32>
    %int2 = torch.constant.int 2
    %36 = torch.aten.pow.Tensor_Scalar %35, %int2 : !torch.vtensor<[1,?,256],f32>, !torch.int -> !torch.vtensor<[1,?,256],f32>
    torch.bind_symbolic_shape %36, [%31], affine_map<()[s0] -> (1, s0 * 32, 256)> : !torch.vtensor<[1,?,256],f32>
    %int-1_1 = torch.constant.int -1
    %37 = torch.prim.ListConstruct %int-1_1 : (!torch.int) -> !torch.list<int>
    %true = torch.constant.bool true
    %none = torch.constant.none
    %38 = torch.aten.mean.dim %36, %37, %true, %none : !torch.vtensor<[1,?,256],f32>, !torch.list<int>, !torch.bool, !torch.none -> !torch.vtensor<[1,?,1],f32>
    torch.bind_symbolic_shape %38, [%31], affine_map<()[s0] -> (1, s0 * 32, 1)> : !torch.vtensor<[1,?,1],f32>
    %float1.000000e-02 = torch.constant.float 1.000000e-02
    %int1 = torch.constant.int 1
    %39 = torch.aten.add.Scalar %38, %float1.000000e-02, %int1 : !torch.vtensor<[1,?,1],f32>, !torch.float, !torch.int -> !torch.vtensor<[1,?,1],f32>
    torch.bind_symbolic_shape %39, [%31], affine_map<()[s0] -> (1, s0 * 32, 1)> : !torch.vtensor<[1,?,1],f32>
    %40 = torch.aten.rsqrt %39 : !torch.vtensor<[1,?,1],f32> -> !torch.vtensor<[1,?,1],f32>
    torch.bind_symbolic_shape %40, [%31], affine_map<()[s0] -> (1, s0 * 32, 1)> : !torch.vtensor<[1,?,1],f32>
    %41 = torch.aten.mul.Tensor %35, %40 : !torch.vtensor<[1,?,256],f32>, !torch.vtensor<[1,?,1],f32> -> !torch.vtensor<[1,?,256],f32>
    torch.bind_symbolic_shape %41, [%31], affine_map<()[s0] -> (1, s0 * 32, 256)> : !torch.vtensor<[1,?,256],f32>
    %int5_2 = torch.constant.int 5
    %42 = torch.prims.convert_element_type %41, %int5_2 : !torch.vtensor<[1,?,256],f32>, !torch.int -> !torch.vtensor<[1,?,256],f16>
    torch.bind_symbolic_shape %42, [%31], affine_map<()[s0] -> (1, s0 * 32, 256)> : !torch.vtensor<[1,?,256],f16>
    %43 = torch.aten.mul.Tensor %1, %42 : !torch.vtensor<[256],f32>, !torch.vtensor<[1,?,256],f16> -> !torch.vtensor<[1,?,256],f32>
    torch.bind_symbolic_shape %43, [%31], affine_map<()[s0] -> (1, s0 * 32, 256)> : !torch.vtensor<[1,?,256],f32>
    %int5_3 = torch.constant.int 5
    %44 = torch.prims.convert_element_type %43, %int5_3 : !torch.vtensor<[1,?,256],f32>, !torch.int -> !torch.vtensor<[1,?,256],f16>
    torch.bind_symbolic_shape %44, [%31], affine_map<()[s0] -> (1, s0 * 32, 256)> : !torch.vtensor<[1,?,256],f16>
    %int5_4 = torch.constant.int 5
    %45 = torch.prims.convert_element_type %2, %int5_4 : !torch.vtensor<[256,256],f32>, !torch.int -> !torch.vtensor<[256,256],f16>
    %int-2 = torch.constant.int -2
    %int-1_5 = torch.constant.int -1
    %46 = torch.aten.transpose.int %45, %int-2, %int-1_5 : !torch.vtensor<[256,256],f16>, !torch.int, !torch.int -> !torch.vtensor<[256,256],f16>
    %int1_6 = torch.constant.int 1
    %47 = torch.aten.size.int %arg0, %int1_6 : !torch.vtensor<[1,?],si64>, !torch.int -> !torch.int
    %int256 = torch.constant.int 256
    %48 = torch.prim.ListConstruct %47, %int256 : (!torch.int, !torch.int) -> !torch.list<int>
    %49 = torch.aten.view %44, %48 : !torch.vtensor<[1,?,256],f16>, !torch.list<int> -> !torch.vtensor<[?,256],f16>
    torch.bind_symbolic_shape %49, [%31], affine_map<()[s0] -> (s0 * 32, 256)> : !torch.vtensor<[?,256],f16>
    %50 = torch.aten.mm %49, %46 : !torch.vtensor<[?,256],f16>, !torch.vtensor<[256,256],f16> -> !torch.vtensor<[?,256],f16>
    torch.bind_symbolic_shape %50, [%31], affine_map<()[s0] -> (s0 * 32, 256)> : !torch.vtensor<[?,256],f16>
    %int1_7 = torch.constant.int 1
    %int256_8 = torch.constant.int 256
    %51 = torch.prim.ListConstruct %int1_7, %47, %int256_8 : (!torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %52 = torch.aten.view %50, %51 : !torch.vtensor<[?,256],f16>, !torch.list<int> -> !torch.vtensor<[1,?,256],f16>
    torch.bind_symbolic_shape %52, [%31], affine_map<()[s0] -> (1, s0 * 32, 256)> : !torch.vtensor<[1,?,256],f16>
    %int5_9 = torch.constant.int 5
    %53 = torch.prims.convert_element_type %3, %int5_9 : !torch.vtensor<[128,256],f32>, !torch.int -> !torch.vtensor<[128,256],f16>
    %int-2_10 = torch.constant.int -2
    %int-1_11 = torch.constant.int -1
    %54 = torch.aten.transpose.int %53, %int-2_10, %int-1_11 : !torch.vtensor<[128,256],f16>, !torch.int, !torch.int -> !torch.vtensor<[256,128],f16>
    %int256_12 = torch.constant.int 256
    %55 = torch.prim.ListConstruct %47, %int256_12 : (!torch.int, !torch.int) -> !torch.list<int>
    %56 = torch.aten.view %44, %55 : !torch.vtensor<[1,?,256],f16>, !torch.list<int> -> !torch.vtensor<[?,256],f16>
    torch.bind_symbolic_shape %56, [%31], affine_map<()[s0] -> (s0 * 32, 256)> : !torch.vtensor<[?,256],f16>
    %57 = torch.aten.mm %56, %54 : !torch.vtensor<[?,256],f16>, !torch.vtensor<[256,128],f16> -> !torch.vtensor<[?,128],f16>
    torch.bind_symbolic_shape %57, [%31], affine_map<()[s0] -> (s0 * 32, 128)> : !torch.vtensor<[?,128],f16>
    %int1_13 = torch.constant.int 1
    %int128 = torch.constant.int 128
    %58 = torch.prim.ListConstruct %int1_13, %47, %int128 : (!torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %59 = torch.aten.view %57, %58 : !torch.vtensor<[?,128],f16>, !torch.list<int> -> !torch.vtensor<[1,?,128],f16>
    torch.bind_symbolic_shape %59, [%31], affine_map<()[s0] -> (1, s0 * 32, 128)> : !torch.vtensor<[1,?,128],f16>
    %int5_14 = torch.constant.int 5
    %60 = torch.prims.convert_element_type %4, %int5_14 : !torch.vtensor<[128,256],f32>, !torch.int -> !torch.vtensor<[128,256],f16>
    %int-2_15 = torch.constant.int -2
    %int-1_16 = torch.constant.int -1
    %61 = torch.aten.transpose.int %60, %int-2_15, %int-1_16 : !torch.vtensor<[128,256],f16>, !torch.int, !torch.int -> !torch.vtensor<[256,128],f16>
    %int256_17 = torch.constant.int 256
    %62 = torch.prim.ListConstruct %47, %int256_17 : (!torch.int, !torch.int) -> !torch.list<int>
    %63 = torch.aten.view %44, %62 : !torch.vtensor<[1,?,256],f16>, !torch.list<int> -> !torch.vtensor<[?,256],f16>
    torch.bind_symbolic_shape %63, [%31], affine_map<()[s0] -> (s0 * 32, 256)> : !torch.vtensor<[?,256],f16>
    %64 = torch.aten.mm %63, %61 : !torch.vtensor<[?,256],f16>, !torch.vtensor<[256,128],f16> -> !torch.vtensor<[?,128],f16>
    torch.bind_symbolic_shape %64, [%31], affine_map<()[s0] -> (s0 * 32, 128)> : !torch.vtensor<[?,128],f16>
    %int1_18 = torch.constant.int 1
    %int128_19 = torch.constant.int 128
    %65 = torch.prim.ListConstruct %int1_18, %47, %int128_19 : (!torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %66 = torch.aten.view %64, %65 : !torch.vtensor<[?,128],f16>, !torch.list<int> -> !torch.vtensor<[1,?,128],f16>
    torch.bind_symbolic_shape %66, [%31], affine_map<()[s0] -> (1, s0 * 32, 128)> : !torch.vtensor<[1,?,128],f16>
    %int1_20 = torch.constant.int 1
    %int8 = torch.constant.int 8
    %int32 = torch.constant.int 32
    %67 = torch.prim.ListConstruct %int1_20, %47, %int8, %int32 : (!torch.int, !torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %68 = torch.aten.view %52, %67 : !torch.vtensor<[1,?,256],f16>, !torch.list<int> -> !torch.vtensor<[1,?,8,32],f16>
    torch.bind_symbolic_shape %68, [%31], affine_map<()[s0] -> (1, s0 * 32, 8, 32)> : !torch.vtensor<[1,?,8,32],f16>
    %int1_21 = torch.constant.int 1
    %int4 = torch.constant.int 4
    %int32_22 = torch.constant.int 32
    %69 = torch.prim.ListConstruct %int1_21, %47, %int4, %int32_22 : (!torch.int, !torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %70 = torch.aten.view %59, %69 : !torch.vtensor<[1,?,128],f16>, !torch.list<int> -> !torch.vtensor<[1,?,4,32],f16>
    torch.bind_symbolic_shape %70, [%31], affine_map<()[s0] -> (1, s0 * 32, 4, 32)> : !torch.vtensor<[1,?,4,32],f16>
    %int1_23 = torch.constant.int 1
    %int4_24 = torch.constant.int 4
    %int32_25 = torch.constant.int 32
    %71 = torch.prim.ListConstruct %int1_23, %47, %int4_24, %int32_25 : (!torch.int, !torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %72 = torch.aten.view %66, %71 : !torch.vtensor<[1,?,128],f16>, !torch.list<int> -> !torch.vtensor<[1,?,4,32],f16>
    torch.bind_symbolic_shape %72, [%31], affine_map<()[s0] -> (1, s0 * 32, 4, 32)> : !torch.vtensor<[1,?,4,32],f16>
    %int128_26 = torch.constant.int 128
    %none_27 = torch.constant.none
    %none_28 = torch.constant.none
    %cpu = torch.constant.device "cpu"
    %false_29 = torch.constant.bool false
    %73 = torch.aten.arange %int128_26, %none_27, %none_28, %cpu, %false_29 : !torch.int, !torch.none, !torch.none, !torch.Device, !torch.bool -> !torch.vtensor<[128],si64>
    %int0 = torch.constant.int 0
    %int32_30 = torch.constant.int 32
    %none_31 = torch.constant.none
    %none_32 = torch.constant.none
    %cpu_33 = torch.constant.device "cpu"
    %false_34 = torch.constant.bool false
    %74 = torch.aten.arange.start %int0, %int32_30, %none_31, %none_32, %cpu_33, %false_34 : !torch.int, !torch.int, !torch.none, !torch.none, !torch.Device, !torch.bool -> !torch.vtensor<[32],si64>
    %int2_35 = torch.constant.int 2
    %75 = torch.aten.floor_divide.Scalar %74, %int2_35 : !torch.vtensor<[32],si64>, !torch.int -> !torch.vtensor<[32],si64>
    %int6_36 = torch.constant.int 6
    %76 = torch.prims.convert_element_type %75, %int6_36 : !torch.vtensor<[32],si64>, !torch.int -> !torch.vtensor<[32],f32>
    %int32_37 = torch.constant.int 32
    %77 = torch.aten.div.Scalar %76, %int32_37 : !torch.vtensor<[32],f32>, !torch.int -> !torch.vtensor<[32],f32>
    %float2.000000e00 = torch.constant.float 2.000000e+00
    %78 = torch.aten.mul.Scalar %77, %float2.000000e00 : !torch.vtensor<[32],f32>, !torch.float -> !torch.vtensor<[32],f32>
    %float5.000000e05 = torch.constant.float 5.000000e+05
    %79 = torch.aten.pow.Scalar %float5.000000e05, %78 : !torch.float, !torch.vtensor<[32],f32> -> !torch.vtensor<[32],f32>
    %80 = torch.aten.reciprocal %79 : !torch.vtensor<[32],f32> -> !torch.vtensor<[32],f32>
    %float1.000000e00 = torch.constant.float 1.000000e+00
    %81 = torch.aten.mul.Scalar %80, %float1.000000e00 : !torch.vtensor<[32],f32>, !torch.float -> !torch.vtensor<[32],f32>
    %int1_38 = torch.constant.int 1
    %82 = torch.aten.unsqueeze %73, %int1_38 : !torch.vtensor<[128],si64>, !torch.int -> !torch.vtensor<[128,1],si64>
    %int0_39 = torch.constant.int 0
    %83 = torch.aten.unsqueeze %81, %int0_39 : !torch.vtensor<[32],f32>, !torch.int -> !torch.vtensor<[1,32],f32>
    %84 = torch.aten.mul.Tensor %82, %83 : !torch.vtensor<[128,1],si64>, !torch.vtensor<[1,32],f32> -> !torch.vtensor<[128,32],f32>
    %int1_40 = torch.constant.int 1
    %85 = torch.aten.size.int %52, %int1_40 : !torch.vtensor<[1,?,256],f16>, !torch.int -> !torch.int
    %int0_41 = torch.constant.int 0
    %86 = torch.aten.add.int %int0_41, %85 : !torch.int, !torch.int -> !torch.int
    %int0_42 = torch.constant.int 0
    %int0_43 = torch.constant.int 0
    %int1_44 = torch.constant.int 1
    %87 = torch.aten.slice.Tensor %84, %int0_42, %int0_43, %86, %int1_44 : !torch.vtensor<[128,32],f32>, !torch.int, !torch.int, !torch.int, !torch.int -> !torch.vtensor<[?,32],f32>
    torch.bind_symbolic_shape %87, [%31], affine_map<()[s0] -> (s0 * 32, 32)> : !torch.vtensor<[?,32],f32>
    %int1_45 = torch.constant.int 1
    %int0_46 = torch.constant.int 0
    %int9223372036854775807 = torch.constant.int 9223372036854775807
    %int1_47 = torch.constant.int 1
    %88 = torch.aten.slice.Tensor %87, %int1_45, %int0_46, %int9223372036854775807, %int1_47 : !torch.vtensor<[?,32],f32>, !torch.int, !torch.int, !torch.int, !torch.int -> !torch.vtensor<[?,32],f32>
    torch.bind_symbolic_shape %88, [%31], affine_map<()[s0] -> (s0 * 32, 32)> : !torch.vtensor<[?,32],f32>
    %int1_48 = torch.constant.int 1
    %int0_49 = torch.constant.int 0
    %int9223372036854775807_50 = torch.constant.int 9223372036854775807
    %int1_51 = torch.constant.int 1
    %89 = torch.aten.slice.Tensor %88, %int1_48, %int0_49, %int9223372036854775807_50, %int1_51 : !torch.vtensor<[?,32],f32>, !torch.int, !torch.int, !torch.int, !torch.int -> !torch.vtensor<[?,32],f32>
    torch.bind_symbolic_shape %89, [%31], affine_map<()[s0] -> (s0 * 32, 32)> : !torch.vtensor<[?,32],f32>
    %int0_52 = torch.constant.int 0
    %90 = torch.aten.unsqueeze %89, %int0_52 : !torch.vtensor<[?,32],f32>, !torch.int -> !torch.vtensor<[1,?,32],f32>
    torch.bind_symbolic_shape %90, [%31], affine_map<()[s0] -> (1, s0 * 32, 32)> : !torch.vtensor<[1,?,32],f32>
    %int1_53 = torch.constant.int 1
    %int0_54 = torch.constant.int 0
    %int9223372036854775807_55 = torch.constant.int 9223372036854775807
    %int1_56 = torch.constant.int 1
    %91 = torch.aten.slice.Tensor %90, %int1_53, %int0_54, %int9223372036854775807_55, %int1_56 : !torch.vtensor<[1,?,32],f32>, !torch.int, !torch.int, !torch.int, !torch.int -> !torch.vtensor<[1,?,32],f32>
    torch.bind_symbolic_shape %91, [%31], affine_map<()[s0] -> (1, s0 * 32, 32)> : !torch.vtensor<[1,?,32],f32>
    %int2_57 = torch.constant.int 2
    %int0_58 = torch.constant.int 0
    %int9223372036854775807_59 = torch.constant.int 9223372036854775807
    %int1_60 = torch.constant.int 1
    %92 = torch.aten.slice.Tensor %91, %int2_57, %int0_58, %int9223372036854775807_59, %int1_60 : !torch.vtensor<[1,?,32],f32>, !torch.int, !torch.int, !torch.int, !torch.int -> !torch.vtensor<[1,?,32],f32>
    torch.bind_symbolic_shape %92, [%31], affine_map<()[s0] -> (1, s0 * 32, 32)> : !torch.vtensor<[1,?,32],f32>
    %int1_61 = torch.constant.int 1
    %int1_62 = torch.constant.int 1
    %int1_63 = torch.constant.int 1
    %93 = torch.prim.ListConstruct %int1_61, %int1_62, %int1_63 : (!torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %94 = torch.aten.repeat %92, %93 : !torch.vtensor<[1,?,32],f32>, !torch.list<int> -> !torch.vtensor<[1,?,32],f32>
    torch.bind_symbolic_shape %94, [%31], affine_map<()[s0] -> (1, s0 * 32, 32)> : !torch.vtensor<[1,?,32],f32>
    %int6_64 = torch.constant.int 6
    %95 = torch.prims.convert_element_type %68, %int6_64 : !torch.vtensor<[1,?,8,32],f16>, !torch.int -> !torch.vtensor<[1,?,8,32],f32>
    torch.bind_symbolic_shape %95, [%31], affine_map<()[s0] -> (1, s0 * 32, 8, 32)> : !torch.vtensor<[1,?,8,32],f32>
    %96 = torch_c.to_builtin_tensor %95 : !torch.vtensor<[1,?,8,32],f32> -> tensor<1x?x8x32xf32>
    %97 = torch_c.to_builtin_tensor %94 : !torch.vtensor<[1,?,32],f32> -> tensor<1x?x32xf32>
    %98 = util.call @sharktank_rotary_embedding_1_D_8_32_f32(%96, %97) : (tensor<1x?x8x32xf32>, tensor<1x?x32xf32>) -> tensor<1x?x8x32xf32>
    %99 = torch_c.from_builtin_tensor %98 : tensor<1x?x8x32xf32> -> !torch.vtensor<[1,?,8,32],f32>
    torch.bind_symbolic_shape %99, [%31], affine_map<()[s0] -> (1, s0 * 32, 8, 32)> : !torch.vtensor<[1,?,8,32],f32>
    %int5_65 = torch.constant.int 5
    %100 = torch.prims.convert_element_type %99, %int5_65 : !torch.vtensor<[1,?,8,32],f32>, !torch.int -> !torch.vtensor<[1,?,8,32],f16>
    torch.bind_symbolic_shape %100, [%31], affine_map<()[s0] -> (1, s0 * 32, 8, 32)> : !torch.vtensor<[1,?,8,32],f16>
    %int128_66 = torch.constant.int 128
    %none_67 = torch.constant.none
    %none_68 = torch.constant.none
    %cpu_69 = torch.constant.device "cpu"
    %false_70 = torch.constant.bool false
    %101 = torch.aten.arange %int128_66, %none_67, %none_68, %cpu_69, %false_70 : !torch.int, !torch.none, !torch.none, !torch.Device, !torch.bool -> !torch.vtensor<[128],si64>
    %int0_71 = torch.constant.int 0
    %int32_72 = torch.constant.int 32
    %none_73 = torch.constant.none
    %none_74 = torch.constant.none
    %cpu_75 = torch.constant.device "cpu"
    %false_76 = torch.constant.bool false
    %102 = torch.aten.arange.start %int0_71, %int32_72, %none_73, %none_74, %cpu_75, %false_76 : !torch.int, !torch.int, !torch.none, !torch.none, !torch.Device, !torch.bool -> !torch.vtensor<[32],si64>
    %int2_77 = torch.constant.int 2
    %103 = torch.aten.floor_divide.Scalar %102, %int2_77 : !torch.vtensor<[32],si64>, !torch.int -> !torch.vtensor<[32],si64>
    %int6_78 = torch.constant.int 6
    %104 = torch.prims.convert_element_type %103, %int6_78 : !torch.vtensor<[32],si64>, !torch.int -> !torch.vtensor<[32],f32>
    %int32_79 = torch.constant.int 32
    %105 = torch.aten.div.Scalar %104, %int32_79 : !torch.vtensor<[32],f32>, !torch.int -> !torch.vtensor<[32],f32>
    %float2.000000e00_80 = torch.constant.float 2.000000e+00
    %106 = torch.aten.mul.Scalar %105, %float2.000000e00_80 : !torch.vtensor<[32],f32>, !torch.float -> !torch.vtensor<[32],f32>
    %float5.000000e05_81 = torch.constant.float 5.000000e+05
    %107 = torch.aten.pow.Scalar %float5.000000e05_81, %106 : !torch.float, !torch.vtensor<[32],f32> -> !torch.vtensor<[32],f32>
    %108 = torch.aten.reciprocal %107 : !torch.vtensor<[32],f32> -> !torch.vtensor<[32],f32>
    %float1.000000e00_82 = torch.constant.float 1.000000e+00
    %109 = torch.aten.mul.Scalar %108, %float1.000000e00_82 : !torch.vtensor<[32],f32>, !torch.float -> !torch.vtensor<[32],f32>
    %int1_83 = torch.constant.int 1
    %110 = torch.aten.unsqueeze %101, %int1_83 : !torch.vtensor<[128],si64>, !torch.int -> !torch.vtensor<[128,1],si64>
    %int0_84 = torch.constant.int 0
    %111 = torch.aten.unsqueeze %109, %int0_84 : !torch.vtensor<[32],f32>, !torch.int -> !torch.vtensor<[1,32],f32>
    %112 = torch.aten.mul.Tensor %110, %111 : !torch.vtensor<[128,1],si64>, !torch.vtensor<[1,32],f32> -> !torch.vtensor<[128,32],f32>
    %int1_85 = torch.constant.int 1
    %113 = torch.aten.size.int %59, %int1_85 : !torch.vtensor<[1,?,128],f16>, !torch.int -> !torch.int
    %int0_86 = torch.constant.int 0
    %114 = torch.aten.add.int %int0_86, %113 : !torch.int, !torch.int -> !torch.int
    %int0_87 = torch.constant.int 0
    %int0_88 = torch.constant.int 0
    %int1_89 = torch.constant.int 1
    %115 = torch.aten.slice.Tensor %112, %int0_87, %int0_88, %114, %int1_89 : !torch.vtensor<[128,32],f32>, !torch.int, !torch.int, !torch.int, !torch.int -> !torch.vtensor<[?,32],f32>
    torch.bind_symbolic_shape %115, [%31], affine_map<()[s0] -> (s0 * 32, 32)> : !torch.vtensor<[?,32],f32>
    %int1_90 = torch.constant.int 1
    %int0_91 = torch.constant.int 0
    %int9223372036854775807_92 = torch.constant.int 9223372036854775807
    %int1_93 = torch.constant.int 1
    %116 = torch.aten.slice.Tensor %115, %int1_90, %int0_91, %int9223372036854775807_92, %int1_93 : !torch.vtensor<[?,32],f32>, !torch.int, !torch.int, !torch.int, !torch.int -> !torch.vtensor<[?,32],f32>
    torch.bind_symbolic_shape %116, [%31], affine_map<()[s0] -> (s0 * 32, 32)> : !torch.vtensor<[?,32],f32>
    %int1_94 = torch.constant.int 1
    %int0_95 = torch.constant.int 0
    %int9223372036854775807_96 = torch.constant.int 9223372036854775807
    %int1_97 = torch.constant.int 1
    %117 = torch.aten.slice.Tensor %116, %int1_94, %int0_95, %int9223372036854775807_96, %int1_97 : !torch.vtensor<[?,32],f32>, !torch.int, !torch.int, !torch.int, !torch.int -> !torch.vtensor<[?,32],f32>
    torch.bind_symbolic_shape %117, [%31], affine_map<()[s0] -> (s0 * 32, 32)> : !torch.vtensor<[?,32],f32>
    %int0_98 = torch.constant.int 0
    %118 = torch.aten.unsqueeze %117, %int0_98 : !torch.vtensor<[?,32],f32>, !torch.int -> !torch.vtensor<[1,?,32],f32>
    torch.bind_symbolic_shape %118, [%31], affine_map<()[s0] -> (1, s0 * 32, 32)> : !torch.vtensor<[1,?,32],f32>
    %int1_99 = torch.constant.int 1
    %int0_100 = torch.constant.int 0
    %int9223372036854775807_101 = torch.constant.int 9223372036854775807
    %int1_102 = torch.constant.int 1
    %119 = torch.aten.slice.Tensor %118, %int1_99, %int0_100, %int9223372036854775807_101, %int1_102 : !torch.vtensor<[1,?,32],f32>, !torch.int, !torch.int, !torch.int, !torch.int -> !torch.vtensor<[1,?,32],f32>
    torch.bind_symbolic_shape %119, [%31], affine_map<()[s0] -> (1, s0 * 32, 32)> : !torch.vtensor<[1,?,32],f32>
    %int2_103 = torch.constant.int 2
    %int0_104 = torch.constant.int 0
    %int9223372036854775807_105 = torch.constant.int 9223372036854775807
    %int1_106 = torch.constant.int 1
    %120 = torch.aten.slice.Tensor %119, %int2_103, %int0_104, %int9223372036854775807_105, %int1_106 : !torch.vtensor<[1,?,32],f32>, !torch.int, !torch.int, !torch.int, !torch.int -> !torch.vtensor<[1,?,32],f32>
    torch.bind_symbolic_shape %120, [%31], affine_map<()[s0] -> (1, s0 * 32, 32)> : !torch.vtensor<[1,?,32],f32>
    %int1_107 = torch.constant.int 1
    %int1_108 = torch.constant.int 1
    %int1_109 = torch.constant.int 1
    %121 = torch.prim.ListConstruct %int1_107, %int1_108, %int1_109 : (!torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %122 = torch.aten.repeat %120, %121 : !torch.vtensor<[1,?,32],f32>, !torch.list<int> -> !torch.vtensor<[1,?,32],f32>
    torch.bind_symbolic_shape %122, [%31], affine_map<()[s0] -> (1, s0 * 32, 32)> : !torch.vtensor<[1,?,32],f32>
    %int6_110 = torch.constant.int 6
    %123 = torch.prims.convert_element_type %70, %int6_110 : !torch.vtensor<[1,?,4,32],f16>, !torch.int -> !torch.vtensor<[1,?,4,32],f32>
    torch.bind_symbolic_shape %123, [%31], affine_map<()[s0] -> (1, s0 * 32, 4, 32)> : !torch.vtensor<[1,?,4,32],f32>
    %124 = torch_c.to_builtin_tensor %123 : !torch.vtensor<[1,?,4,32],f32> -> tensor<1x?x4x32xf32>
    %125 = torch_c.to_builtin_tensor %122 : !torch.vtensor<[1,?,32],f32> -> tensor<1x?x32xf32>
    %126 = util.call @sharktank_rotary_embedding_1_D_4_32_f32(%124, %125) : (tensor<1x?x4x32xf32>, tensor<1x?x32xf32>) -> tensor<1x?x4x32xf32>
    %127 = torch_c.from_builtin_tensor %126 : tensor<1x?x4x32xf32> -> !torch.vtensor<[1,?,4,32],f32>
    torch.bind_symbolic_shape %127, [%31], affine_map<()[s0] -> (1, s0 * 32, 4, 32)> : !torch.vtensor<[1,?,4,32],f32>
    %int5_111 = torch.constant.int 5
    %128 = torch.prims.convert_element_type %127, %int5_111 : !torch.vtensor<[1,?,4,32],f32>, !torch.int -> !torch.vtensor<[1,?,4,32],f16>
    torch.bind_symbolic_shape %128, [%31], affine_map<()[s0] -> (1, s0 * 32, 4, 32)> : !torch.vtensor<[1,?,4,32],f16>
    %int0_112 = torch.constant.int 0
    %129 = torch.aten.size.int %30, %int0_112 : !torch.vtensor<[?,24576],f16>, !torch.int -> !torch.int
    %int3 = torch.constant.int 3
    %int2_113 = torch.constant.int 2
    %int32_114 = torch.constant.int 32
    %int4_115 = torch.constant.int 4
    %int32_116 = torch.constant.int 32
    %130 = torch.prim.ListConstruct %129, %int3, %int2_113, %int32_114, %int4_115, %int32_116 : (!torch.int, !torch.int, !torch.int, !torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %131 = torch.aten.view %30, %130 : !torch.vtensor<[?,24576],f16>, !torch.list<int> -> !torch.vtensor<[?,3,2,32,4,32],f16>
    torch.bind_symbolic_shape %131, [%32], affine_map<()[s0] -> (s0, 3, 2, 32, 4, 32)> : !torch.vtensor<[?,3,2,32,4,32],f16>
    %int3_117 = torch.constant.int 3
    %132 = torch.aten.mul.int %129, %int3_117 : !torch.int, !torch.int -> !torch.int
    %int2_118 = torch.constant.int 2
    %133 = torch.aten.mul.int %132, %int2_118 : !torch.int, !torch.int -> !torch.int
    %int32_119 = torch.constant.int 32
    %int4_120 = torch.constant.int 4
    %int32_121 = torch.constant.int 32
    %134 = torch.prim.ListConstruct %133, %int32_119, %int4_120, %int32_121 : (!torch.int, !torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %135 = torch.aten.view %131, %134 : !torch.vtensor<[?,3,2,32,4,32],f16>, !torch.list<int> -> !torch.vtensor<[?,32,4,32],f16>
    torch.bind_symbolic_shape %135, [%32], affine_map<()[s0] -> (s0 * 6, 32, 4, 32)> : !torch.vtensor<[?,32,4,32],f16>
    %int6_122 = torch.constant.int 6
    %136 = torch.aten.mul.Scalar %arg2, %int6_122 : !torch.vtensor<[1,?],si64>, !torch.int -> !torch.vtensor<[1,?],si64>
    torch.bind_symbolic_shape %136, [%31], affine_map<()[s0] -> (1, s0)> : !torch.vtensor<[1,?],si64>
    %int0_123 = torch.constant.int 0
    %int1_124 = torch.constant.int 1
    %137 = torch.aten.add.Scalar %136, %int0_123, %int1_124 : !torch.vtensor<[1,?],si64>, !torch.int, !torch.int -> !torch.vtensor<[1,?],si64>
    torch.bind_symbolic_shape %137, [%31], affine_map<()[s0] -> (1, s0)> : !torch.vtensor<[1,?],si64>
    %int1_125 = torch.constant.int 1
    %138 = torch.aten.size.int %arg2, %int1_125 : !torch.vtensor<[1,?],si64>, !torch.int -> !torch.int
    %int1_126 = torch.constant.int 1
    %int32_127 = torch.constant.int 32
    %int4_128 = torch.constant.int 4
    %int32_129 = torch.constant.int 32
    %139 = torch.prim.ListConstruct %int1_126, %138, %int32_127, %int4_128, %int32_129 : (!torch.int, !torch.int, !torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %140 = torch.aten.view %128, %139 : !torch.vtensor<[1,?,4,32],f16>, !torch.list<int> -> !torch.vtensor<[1,?,32,4,32],f16>
    torch.bind_symbolic_shape %140, [%31], affine_map<()[s0] -> (1, s0, 32, 4, 32)> : !torch.vtensor<[1,?,32,4,32],f16>
    %int32_130 = torch.constant.int 32
    %int4_131 = torch.constant.int 4
    %int32_132 = torch.constant.int 32
    %141 = torch.prim.ListConstruct %138, %int32_130, %int4_131, %int32_132 : (!torch.int, !torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %142 = torch.aten.view %140, %141 : !torch.vtensor<[1,?,32,4,32],f16>, !torch.list<int> -> !torch.vtensor<[?,32,4,32],f16>
    torch.bind_symbolic_shape %142, [%31], affine_map<()[s0] -> (s0, 32, 4, 32)> : !torch.vtensor<[?,32,4,32],f16>
    %143 = torch.prim.ListConstruct %138 : (!torch.int) -> !torch.list<int>
    %144 = torch.aten.view %137, %143 : !torch.vtensor<[1,?],si64>, !torch.list<int> -> !torch.vtensor<[?],si64>
    torch.bind_symbolic_shape %144, [%31], affine_map<()[s0] -> (s0)> : !torch.vtensor<[?],si64>
    %145 = torch.prim.ListConstruct %144 : (!torch.vtensor<[?],si64>) -> !torch.list<optional<vtensor>>
    %false_133 = torch.constant.bool false
    %146 = torch.aten.index_put %135, %145, %142, %false_133 : !torch.vtensor<[?,32,4,32],f16>, !torch.list<optional<vtensor>>, !torch.vtensor<[?,32,4,32],f16>, !torch.bool -> !torch.vtensor<[?,32,4,32],f16>
    torch.bind_symbolic_shape %146, [%32], affine_map<()[s0] -> (s0 * 6, 32, 4, 32)> : !torch.vtensor<[?,32,4,32],f16>
    %int3_134 = torch.constant.int 3
    %int2_135 = torch.constant.int 2
    %int32_136 = torch.constant.int 32
    %int4_137 = torch.constant.int 4
    %int32_138 = torch.constant.int 32
    %147 = torch.prim.ListConstruct %129, %int3_134, %int2_135, %int32_136, %int4_137, %int32_138 : (!torch.int, !torch.int, !torch.int, !torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %148 = torch.aten.view %146, %147 : !torch.vtensor<[?,32,4,32],f16>, !torch.list<int> -> !torch.vtensor<[?,3,2,32,4,32],f16>
    torch.bind_symbolic_shape %148, [%32], affine_map<()[s0] -> (s0, 3, 2, 32, 4, 32)> : !torch.vtensor<[?,3,2,32,4,32],f16>
    %int24576 = torch.constant.int 24576
    %149 = torch.prim.ListConstruct %129, %int24576 : (!torch.int, !torch.int) -> !torch.list<int>
    %150 = torch.aten.view %148, %149 : !torch.vtensor<[?,3,2,32,4,32],f16>, !torch.list<int> -> !torch.vtensor<[?,24576],f16>
    torch.bind_symbolic_shape %150, [%32], affine_map<()[s0] -> (s0, 24576)> : !torch.vtensor<[?,24576],f16>
    %int3_139 = torch.constant.int 3
    %int2_140 = torch.constant.int 2
    %int32_141 = torch.constant.int 32
    %int4_142 = torch.constant.int 4
    %int32_143 = torch.constant.int 32
    %151 = torch.prim.ListConstruct %129, %int3_139, %int2_140, %int32_141, %int4_142, %int32_143 : (!torch.int, !torch.int, !torch.int, !torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %152 = torch.aten.view %150, %151 : !torch.vtensor<[?,24576],f16>, !torch.list<int> -> !torch.vtensor<[?,3,2,32,4,32],f16>
    torch.bind_symbolic_shape %152, [%32], affine_map<()[s0] -> (s0, 3, 2, 32, 4, 32)> : !torch.vtensor<[?,3,2,32,4,32],f16>
    %int32_144 = torch.constant.int 32
    %int4_145 = torch.constant.int 4
    %int32_146 = torch.constant.int 32
    %153 = torch.prim.ListConstruct %133, %int32_144, %int4_145, %int32_146 : (!torch.int, !torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %154 = torch.aten.view %152, %153 : !torch.vtensor<[?,3,2,32,4,32],f16>, !torch.list<int> -> !torch.vtensor<[?,32,4,32],f16>
    torch.bind_symbolic_shape %154, [%32], affine_map<()[s0] -> (s0 * 6, 32, 4, 32)> : !torch.vtensor<[?,32,4,32],f16>
    %int1_147 = torch.constant.int 1
    %int32_148 = torch.constant.int 32
    %int4_149 = torch.constant.int 4
    %int32_150 = torch.constant.int 32
    %155 = torch.prim.ListConstruct %int1_147, %138, %int32_148, %int4_149, %int32_150 : (!torch.int, !torch.int, !torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %156 = torch.aten.view %72, %155 : !torch.vtensor<[1,?,4,32],f16>, !torch.list<int> -> !torch.vtensor<[1,?,32,4,32],f16>
    torch.bind_symbolic_shape %156, [%31], affine_map<()[s0] -> (1, s0, 32, 4, 32)> : !torch.vtensor<[1,?,32,4,32],f16>
    %int32_151 = torch.constant.int 32
    %int4_152 = torch.constant.int 4
    %int32_153 = torch.constant.int 32
    %157 = torch.prim.ListConstruct %138, %int32_151, %int4_152, %int32_153 : (!torch.int, !torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %158 = torch.aten.view %156, %157 : !torch.vtensor<[1,?,32,4,32],f16>, !torch.list<int> -> !torch.vtensor<[?,32,4,32],f16>
    torch.bind_symbolic_shape %158, [%31], affine_map<()[s0] -> (s0, 32, 4, 32)> : !torch.vtensor<[?,32,4,32],f16>
    %int1_154 = torch.constant.int 1
    %int1_155 = torch.constant.int 1
    %159 = torch.aten.add.Scalar %137, %int1_154, %int1_155 : !torch.vtensor<[1,?],si64>, !torch.int, !torch.int -> !torch.vtensor<[1,?],si64>
    torch.bind_symbolic_shape %159, [%31], affine_map<()[s0] -> (1, s0)> : !torch.vtensor<[1,?],si64>
    %160 = torch.prim.ListConstruct %138 : (!torch.int) -> !torch.list<int>
    %161 = torch.aten.view %159, %160 : !torch.vtensor<[1,?],si64>, !torch.list<int> -> !torch.vtensor<[?],si64>
    torch.bind_symbolic_shape %161, [%31], affine_map<()[s0] -> (s0)> : !torch.vtensor<[?],si64>
    %162 = torch.prim.ListConstruct %161 : (!torch.vtensor<[?],si64>) -> !torch.list<optional<vtensor>>
    %false_156 = torch.constant.bool false
    %163 = torch.aten.index_put %154, %162, %158, %false_156 : !torch.vtensor<[?,32,4,32],f16>, !torch.list<optional<vtensor>>, !torch.vtensor<[?,32,4,32],f16>, !torch.bool -> !torch.vtensor<[?,32,4,32],f16>
    torch.bind_symbolic_shape %163, [%32], affine_map<()[s0] -> (s0 * 6, 32, 4, 32)> : !torch.vtensor<[?,32,4,32],f16>
    %int3_157 = torch.constant.int 3
    %int2_158 = torch.constant.int 2
    %int32_159 = torch.constant.int 32
    %int4_160 = torch.constant.int 4
    %int32_161 = torch.constant.int 32
    %164 = torch.prim.ListConstruct %129, %int3_157, %int2_158, %int32_159, %int4_160, %int32_161 : (!torch.int, !torch.int, !torch.int, !torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %165 = torch.aten.view %163, %164 : !torch.vtensor<[?,32,4,32],f16>, !torch.list<int> -> !torch.vtensor<[?,3,2,32,4,32],f16>
    torch.bind_symbolic_shape %165, [%32], affine_map<()[s0] -> (s0, 3, 2, 32, 4, 32)> : !torch.vtensor<[?,3,2,32,4,32],f16>
    %int24576_162 = torch.constant.int 24576
    %166 = torch.prim.ListConstruct %129, %int24576_162 : (!torch.int, !torch.int) -> !torch.list<int>
    %167 = torch.aten.view %165, %166 : !torch.vtensor<[?,3,2,32,4,32],f16>, !torch.list<int> -> !torch.vtensor<[?,24576],f16>
    torch.bind_symbolic_shape %167, [%32], affine_map<()[s0] -> (s0, 24576)> : !torch.vtensor<[?,24576],f16>
    %int-2_163 = torch.constant.int -2
    %168 = torch.aten.unsqueeze %128, %int-2_163 : !torch.vtensor<[1,?,4,32],f16>, !torch.int -> !torch.vtensor<[1,?,4,1,32],f16>
    torch.bind_symbolic_shape %168, [%31], affine_map<()[s0] -> (1, s0 * 32, 4, 1, 32)> : !torch.vtensor<[1,?,4,1,32],f16>
    %int1_164 = torch.constant.int 1
    %int4_165 = torch.constant.int 4
    %int2_166 = torch.constant.int 2
    %int32_167 = torch.constant.int 32
    %169 = torch.prim.ListConstruct %int1_164, %113, %int4_165, %int2_166, %int32_167 : (!torch.int, !torch.int, !torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %false_168 = torch.constant.bool false
    %170 = torch.aten.expand %168, %169, %false_168 : !torch.vtensor<[1,?,4,1,32],f16>, !torch.list<int>, !torch.bool -> !torch.vtensor<[1,?,4,2,32],f16>
    torch.bind_symbolic_shape %170, [%31], affine_map<()[s0] -> (1, s0 * 32, 4, 2, 32)> : !torch.vtensor<[1,?,4,2,32],f16>
    %int0_169 = torch.constant.int 0
    %171 = torch.aten.clone %170, %int0_169 : !torch.vtensor<[1,?,4,2,32],f16>, !torch.int -> !torch.vtensor<[1,?,4,2,32],f16>
    torch.bind_symbolic_shape %171, [%31], affine_map<()[s0] -> (1, s0 * 32, 4, 2, 32)> : !torch.vtensor<[1,?,4,2,32],f16>
    %int1_170 = torch.constant.int 1
    %int8_171 = torch.constant.int 8
    %int32_172 = torch.constant.int 32
    %172 = torch.prim.ListConstruct %int1_170, %113, %int8_171, %int32_172 : (!torch.int, !torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %173 = torch.aten._unsafe_view %171, %172 : !torch.vtensor<[1,?,4,2,32],f16>, !torch.list<int> -> !torch.vtensor<[1,?,8,32],f16>
    torch.bind_symbolic_shape %173, [%31], affine_map<()[s0] -> (1, s0 * 32, 8, 32)> : !torch.vtensor<[1,?,8,32],f16>
    %int-2_173 = torch.constant.int -2
    %174 = torch.aten.unsqueeze %72, %int-2_173 : !torch.vtensor<[1,?,4,32],f16>, !torch.int -> !torch.vtensor<[1,?,4,1,32],f16>
    torch.bind_symbolic_shape %174, [%31], affine_map<()[s0] -> (1, s0 * 32, 4, 1, 32)> : !torch.vtensor<[1,?,4,1,32],f16>
    %int1_174 = torch.constant.int 1
    %175 = torch.aten.size.int %66, %int1_174 : !torch.vtensor<[1,?,128],f16>, !torch.int -> !torch.int
    %int1_175 = torch.constant.int 1
    %int4_176 = torch.constant.int 4
    %int2_177 = torch.constant.int 2
    %int32_178 = torch.constant.int 32
    %176 = torch.prim.ListConstruct %int1_175, %175, %int4_176, %int2_177, %int32_178 : (!torch.int, !torch.int, !torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %false_179 = torch.constant.bool false
    %177 = torch.aten.expand %174, %176, %false_179 : !torch.vtensor<[1,?,4,1,32],f16>, !torch.list<int>, !torch.bool -> !torch.vtensor<[1,?,4,2,32],f16>
    torch.bind_symbolic_shape %177, [%31], affine_map<()[s0] -> (1, s0 * 32, 4, 2, 32)> : !torch.vtensor<[1,?,4,2,32],f16>
    %int0_180 = torch.constant.int 0
    %178 = torch.aten.clone %177, %int0_180 : !torch.vtensor<[1,?,4,2,32],f16>, !torch.int -> !torch.vtensor<[1,?,4,2,32],f16>
    torch.bind_symbolic_shape %178, [%31], affine_map<()[s0] -> (1, s0 * 32, 4, 2, 32)> : !torch.vtensor<[1,?,4,2,32],f16>
    %int1_181 = torch.constant.int 1
    %int8_182 = torch.constant.int 8
    %int32_183 = torch.constant.int 32
    %179 = torch.prim.ListConstruct %int1_181, %175, %int8_182, %int32_183 : (!torch.int, !torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %180 = torch.aten._unsafe_view %178, %179 : !torch.vtensor<[1,?,4,2,32],f16>, !torch.list<int> -> !torch.vtensor<[1,?,8,32],f16>
    torch.bind_symbolic_shape %180, [%31], affine_map<()[s0] -> (1, s0 * 32, 8, 32)> : !torch.vtensor<[1,?,8,32],f16>
    %int1_184 = torch.constant.int 1
    %int2_185 = torch.constant.int 2
    %181 = torch.aten.transpose.int %100, %int1_184, %int2_185 : !torch.vtensor<[1,?,8,32],f16>, !torch.int, !torch.int -> !torch.vtensor<[1,8,?,32],f16>
    torch.bind_symbolic_shape %181, [%31], affine_map<()[s0] -> (1, 8, s0 * 32, 32)> : !torch.vtensor<[1,8,?,32],f16>
    %int1_186 = torch.constant.int 1
    %int2_187 = torch.constant.int 2
    %182 = torch.aten.transpose.int %173, %int1_186, %int2_187 : !torch.vtensor<[1,?,8,32],f16>, !torch.int, !torch.int -> !torch.vtensor<[1,8,?,32],f16>
    torch.bind_symbolic_shape %182, [%31], affine_map<()[s0] -> (1, 8, s0 * 32, 32)> : !torch.vtensor<[1,8,?,32],f16>
    %int1_188 = torch.constant.int 1
    %int2_189 = torch.constant.int 2
    %183 = torch.aten.transpose.int %180, %int1_188, %int2_189 : !torch.vtensor<[1,?,8,32],f16>, !torch.int, !torch.int -> !torch.vtensor<[1,8,?,32],f16>
    torch.bind_symbolic_shape %183, [%31], affine_map<()[s0] -> (1, 8, s0 * 32, 32)> : !torch.vtensor<[1,8,?,32],f16>
    %float0.000000e00 = torch.constant.float 0.000000e+00
    %true_190 = torch.constant.bool true
    %none_191 = torch.constant.none
    %none_192 = torch.constant.none
    %184:2 = torch.operator "torch.aten._scaled_dot_product_flash_attention_for_cpu"(%181, %182, %183, %float0.000000e00, %true_190, %none_191, %none_192) : (!torch.vtensor<[1,8,?,32],f16>, !torch.vtensor<[1,8,?,32],f16>, !torch.vtensor<[1,8,?,32],f16>, !torch.float, !torch.bool, !torch.none, !torch.none) -> (!torch.vtensor<[1,8,?,32],f16>, !torch.vtensor<[1,8,?],f32>) 
    torch.bind_symbolic_shape %184#0, [%31], affine_map<()[s0] -> (1, 8, s0 * 32, 32)> : !torch.vtensor<[1,8,?,32],f16>
    %int1_193 = torch.constant.int 1
    %int2_194 = torch.constant.int 2
    %185 = torch.aten.transpose.int %184#0, %int1_193, %int2_194 : !torch.vtensor<[1,8,?,32],f16>, !torch.int, !torch.int -> !torch.vtensor<[1,?,8,32],f16>
    torch.bind_symbolic_shape %185, [%31], affine_map<()[s0] -> (1, s0 * 32, 8, 32)> : !torch.vtensor<[1,?,8,32],f16>
    %int1_195 = torch.constant.int 1
    %int256_196 = torch.constant.int 256
    %186 = torch.prim.ListConstruct %int1_195, %85, %int256_196 : (!torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %187 = torch.aten.view %185, %186 : !torch.vtensor<[1,?,8,32],f16>, !torch.list<int> -> !torch.vtensor<[1,?,256],f16>
    torch.bind_symbolic_shape %187, [%31], affine_map<()[s0] -> (1, s0 * 32, 256)> : !torch.vtensor<[1,?,256],f16>
    %int5_197 = torch.constant.int 5
    %188 = torch.prims.convert_element_type %5, %int5_197 : !torch.vtensor<[256,256],f32>, !torch.int -> !torch.vtensor<[256,256],f16>
    %int-2_198 = torch.constant.int -2
    %int-1_199 = torch.constant.int -1
